;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Thu Aug 18 12:16:05 2016                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("adc.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("abs"), DW_AT_symbol_name("_abs")
	.dwattr DW$1, DW_AT_type(*DW$T$10)
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$1


DW$3	.dwtag  DW_TAG_subprogram, DW_AT_name("sprintf"), DW_AT_symbol_name("_sprintf")
	.dwattr DW$3, DW_AT_type(*DW$T$10)
	.dwattr DW$3, DW_AT_declaration(0x01)
	.dwattr DW$3, DW_AT_external(0x01)
DW$4	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$127)
DW$5	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$145)
DW$6	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$3


DW$7	.dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
	.dwattr DW$7, DW_AT_type(*DW$T$3)
	.dwattr DW$7, DW_AT_declaration(0x01)

DW$T$188	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$70)
	.dwattr DW$T$188, DW_AT_address_class(0x16)

DW$T$189	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$188)
	.dwattr DW$T$189, DW_AT_language(DW_LANG_C)
DW$356	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$189

DW$T$194	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$193)
	.dwattr DW$T$194, DW_AT_address_class(0x16)

DW$T$195	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$194)
	.dwattr DW$T$195, DW_AT_language(DW_LANG_C)
DW$357	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$195


DW$T$196	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$193)
	.dwattr DW$T$196, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$196, DW_AT_byte_size(0x1c)
DW$358	.dwtag  DW_TAG_subrange_type
	.dwattr DW$358, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$196

DW$359	.dwtag  DW_TAG_far_type
	.dwattr DW$359, DW_AT_type(*DW$T$201)
DW$T$202	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$202, DW_AT_type(*DW$359)
DW$360	.dwtag  DW_TAG_far_type
	.dwattr DW$360, DW_AT_type(*DW$T$205)
DW$T$206	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$206, DW_AT_type(*DW$360)
DW$361	.dwtag  DW_TAG_far_type
	.dwattr DW$361, DW_AT_type(*DW$T$209)
DW$T$210	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$210, DW_AT_type(*DW$361)
DW$T$213	.dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$31)
	.dwattr DW$T$213, DW_AT_language(DW_LANG_C)
DW$T$214	.dwtag  DW_TAG_typedef, DW_AT_name("motionstruct"), DW_AT_type(*DW$T$33)
	.dwattr DW$T$214, DW_AT_language(DW_LANG_C)
DW$T$216	.dwtag  DW_TAG_typedef, DW_AT_name("safestruct1struct"), DW_AT_type(*DW$T$37)
	.dwattr DW$T$216, DW_AT_language(DW_LANG_C)
DW$T$218	.dwtag  DW_TAG_typedef, DW_AT_name("safestruct2struct"), DW_AT_type(*DW$T$50)
	.dwattr DW$T$218, DW_AT_language(DW_LANG_C)
DW$T$220	.dwtag  DW_TAG_typedef, DW_AT_name("xtswplusanastruct"), DW_AT_type(*DW$T$51)
	.dwattr DW$T$220, DW_AT_language(DW_LANG_C)
DW$362	.dwtag  DW_TAG_far_type
	.dwattr DW$362, DW_AT_type(*DW$T$222)
DW$T$223	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$223, DW_AT_type(*DW$362)
DW$T$226	.dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$55)
	.dwattr DW$T$226, DW_AT_language(DW_LANG_C)
DW$T$228	.dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$62)
	.dwattr DW$T$228, DW_AT_language(DW_LANG_C)
DW$T$229	.dwtag  DW_TAG_typedef, DW_AT_name("loopcheckstruct"), DW_AT_type(*DW$T$66)
	.dwattr DW$T$229, DW_AT_language(DW_LANG_C)
DW$T$230	.dwtag  DW_TAG_typedef, DW_AT_name("offsetstruct"), DW_AT_type(*DW$T$68)
	.dwattr DW$T$230, DW_AT_language(DW_LANG_C)

DW$T$233	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$232)
	.dwattr DW$T$233, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$233, DW_AT_byte_size(0x1f8)
DW$363	.dwtag  DW_TAG_subrange_type
	.dwattr DW$363, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$233

DW$T$236	.dwtag  DW_TAG_typedef, DW_AT_name("rpmstruct"), DW_AT_type(*DW$T$74)
	.dwattr DW$T$236, DW_AT_language(DW_LANG_C)
DW$364	.dwtag  DW_TAG_far_type
	.dwattr DW$364, DW_AT_type(*DW$T$95)
DW$T$240	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$240, DW_AT_type(*DW$364)
DW$365	.dwtag  DW_TAG_far_type
	.dwattr DW$365, DW_AT_type(*DW$T$251)
DW$T$252	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$252, DW_AT_type(*DW$365)
DW$366	.dwtag  DW_TAG_far_type
	.dwattr DW$366, DW_AT_type(*DW$T$283)
DW$T$284	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$284, DW_AT_type(*DW$366)
DW$T$287	.dwtag  DW_TAG_typedef, DW_AT_name("slemsettingsstruct"), DW_AT_type(*DW$T$111)
	.dwattr DW$T$287, DW_AT_language(DW_LANG_C)
DW$T$289	.dwtag  DW_TAG_typedef, DW_AT_name("slemstruct"), DW_AT_type(*DW$T$113)
	.dwattr DW$T$289, DW_AT_language(DW_LANG_C)
DW$T$291	.dwtag  DW_TAG_typedef, DW_AT_name("rtcbatstruct"), DW_AT_type(*DW$T$115)
	.dwattr DW$T$291, DW_AT_language(DW_LANG_C)
DW$T$293	.dwtag  DW_TAG_typedef, DW_AT_name("cppstruct"), DW_AT_type(*DW$T$116)
	.dwattr DW$T$293, DW_AT_language(DW_LANG_C)
DW$T$294	.dwtag  DW_TAG_typedef, DW_AT_name("cppsettingsstruct"), DW_AT_type(*DW$T$117)
	.dwattr DW$T$294, DW_AT_language(DW_LANG_C)
DW$T$296	.dwtag  DW_TAG_typedef, DW_AT_name("sensorMovingstruct"), DW_AT_type(*DW$T$118)
	.dwattr DW$T$296, DW_AT_language(DW_LANG_C)
DW$T$298	.dwtag  DW_TAG_typedef, DW_AT_name("dcmodechecksstruct"), DW_AT_type(*DW$T$122)
	.dwattr DW$T$298, DW_AT_language(DW_LANG_C)
DW$T$127	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$126)
	.dwattr DW$T$127, DW_AT_address_class(0x16)
DW$T$145	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$144)
	.dwattr DW$T$145, DW_AT_address_class(0x16)

DW$T$300	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$126)
	.dwattr DW$T$300, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$300, DW_AT_byte_size(0x64)
DW$367	.dwtag  DW_TAG_subrange_type
	.dwattr DW$367, DW_AT_upper_bound(0x63)
	.dwendtag DW$T$300

DW$T$176	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$175)
	.dwattr DW$T$176, DW_AT_address_class(0x16)
DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$T$70	.dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$70, DW_AT_language(DW_LANG_C)
DW$T$193	.dwtag  DW_TAG_typedef, DW_AT_name("status3struct"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$193, DW_AT_language(DW_LANG_C)
DW$T$201	.dwtag  DW_TAG_typedef, DW_AT_name("gpaport"), DW_AT_type(*DW$T$23)
	.dwattr DW$T$201, DW_AT_language(DW_LANG_C)
DW$T$205	.dwtag  DW_TAG_typedef, DW_AT_name("gpbport"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$205, DW_AT_language(DW_LANG_C)
DW$T$209	.dwtag  DW_TAG_typedef, DW_AT_name("gpdport"), DW_AT_type(*DW$T$29)
	.dwattr DW$T$209, DW_AT_language(DW_LANG_C)

DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$31, DW_AT_name("tag_settingsstruct")
	.dwattr DW$T$31, DW_AT_byte_size(0x24)
DW$368	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$368, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
	.dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
DW$369	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$369, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
	.dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
DW$370	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$370, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
	.dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
DW$371	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$371, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
	.dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
DW$372	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$372, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
	.dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
DW$373	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$373, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
	.dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
DW$374	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$374, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
	.dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
DW$375	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$375, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
	.dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
DW$376	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$376, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
	.dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
DW$377	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$377, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
	.dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
DW$378	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$378, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
	.dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
DW$379	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$379, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
	.dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
DW$380	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$380, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
	.dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
DW$381	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$381, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
DW$382	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$382, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
	.dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
DW$383	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$383, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
	.dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
DW$384	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$384, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
	.dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
DW$385	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$385, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
	.dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
DW$386	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$386, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
	.dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
DW$387	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$387, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
DW$388	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$388, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
	.dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
DW$389	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$389, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
DW$390	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$390, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
	.dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
DW$391	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$391, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
	.dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
DW$392	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$392, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
DW$393	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$393, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
DW$394	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$394, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
DW$395	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$395, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
DW$396	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$396, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
DW$397	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$397, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
	.dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
DW$398	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$398, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
	.dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
DW$399	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$399, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
	.dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
DW$400	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$400, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
	.dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
DW$401	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$401, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
	.dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
DW$402	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$402, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$31


DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$33, DW_AT_name("tag_motionstruct")
	.dwattr DW$T$33, DW_AT_byte_size(0x09)
DW$403	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$403, DW_AT_name("counter"), DW_AT_symbol_name("_counter")
	.dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
DW$404	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$404, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
	.dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
DW$405	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$405, DW_AT_name("order"), DW_AT_symbol_name("_order")
	.dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
DW$406	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$406, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
DW$407	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$407, DW_AT_name("forwardasternflagprev"), DW_AT_symbol_name("_forwardasternflagprev")
	.dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
DW$408	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$408, DW_AT_name("recalnow"), DW_AT_symbol_name("_recalnow")
	.dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
DW$409	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$409, DW_AT_name("calerror"), DW_AT_symbol_name("_calerror")
	.dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
DW$410	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$410, DW_AT_name("recheckdir"), DW_AT_symbol_name("_recheckdir")
	.dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$33


DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$37, DW_AT_name("tag_safestruct1struct")
	.dwattr DW$T$37, DW_AT_byte_size(0x1f)
DW$411	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
	.dwattr DW$411, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
	.dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
DW$412	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$412, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
	.dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$37


DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$50, DW_AT_name("tag_safestruct2struct")
	.dwattr DW$T$50, DW_AT_byte_size(0x1e)
DW$413	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$413, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
	.dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
DW$414	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
	.dwattr DW$414, DW_AT_name("log"), DW_AT_symbol_name("_log")
	.dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
DW$415	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$415, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
	.dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
DW$416	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
	.dwattr DW$416, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
	.dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
DW$417	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
	.dwattr DW$417, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
	.dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
DW$418	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$418, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
	.dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
DW$419	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$419, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
	.dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
DW$420	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
	.dwattr DW$420, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
	.dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
DW$421	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$421, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
	.dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
DW$422	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$422, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
	.dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
DW$423	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$423, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
	.dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$50


DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$51, DW_AT_name("tag_xtswplusanastruct")
	.dwattr DW$T$51, DW_AT_byte_size(0x0e)
DW$424	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$424, DW_AT_name("analog18ma"), DW_AT_symbol_name("_analog18ma")
	.dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$51

DW$T$222	.dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$52)
	.dwattr DW$T$222, DW_AT_language(DW_LANG_C)

DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$55, DW_AT_name("tag_allsensorstruct")
	.dwattr DW$T$55, DW_AT_byte_size(0x2d)
DW$425	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$425, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
	.dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
DW$426	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$426, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
	.dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
DW$427	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$427, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
	.dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
DW$428	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$428, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
	.dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
DW$429	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$429, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
	.dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
DW$430	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$430, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
	.dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
DW$431	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$431, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
	.dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
DW$432	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$432, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
	.dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
DW$433	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$433, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
	.dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
DW$434	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$434, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
DW$435	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$435, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
DW$436	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$436, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
	.dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
DW$437	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$437, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
	.dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
DW$438	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$438, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
DW$439	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$439, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
DW$440	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$440, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
DW$441	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
	.dwattr DW$441, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
	.dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
DW$442	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$442, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
	.dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
DW$443	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$443, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
	.dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
DW$444	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$444, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
	.dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
DW$445	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$445, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
	.dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
DW$446	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$446, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
	.dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
DW$447	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$447, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
	.dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
DW$448	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$448, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
	.dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
DW$449	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$449, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
	.dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
DW$450	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$450, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
	.dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
DW$451	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$451, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
	.dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
DW$452	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$452, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
	.dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
DW$453	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$453, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
	.dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
DW$454	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
	.dwattr DW$454, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
DW$455	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$455, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow")
	.dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
DW$456	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$456, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHigh")
	.dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$55


DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$62, DW_AT_name("tag_configstruct")
	.dwattr DW$T$62, DW_AT_byte_size(0x18)
DW$457	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$457, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
	.dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
DW$458	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
	.dwattr DW$458, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
	.dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
DW$459	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
	.dwattr DW$459, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
	.dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
DW$460	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$460, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
	.dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
DW$461	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
	.dwattr DW$461, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
	.dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
DW$462	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
	.dwattr DW$462, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
	.dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$62


DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$66, DW_AT_name("tag_loopcheckstruct")
	.dwattr DW$T$66, DW_AT_byte_size(0x10)
DW$463	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
	.dwattr DW$463, DW_AT_name("min"), DW_AT_symbol_name("_min")
	.dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
DW$464	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$464, DW_AT_name("max"), DW_AT_symbol_name("_max")
	.dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
DW$465	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
	.dwattr DW$465, DW_AT_name("last"), DW_AT_symbol_name("_last")
	.dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
DW$466	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$466, DW_AT_name("value"), DW_AT_symbol_name("_value")
	.dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$66


DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$68, DW_AT_name("tag_offsetstruct")
	.dwattr DW$T$68, DW_AT_byte_size(0x1c)
DW$467	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
	.dwattr DW$467, DW_AT_name("val"), DW_AT_symbol_name("_val")
	.dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$68

DW$T$232	.dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$72)
	.dwattr DW$T$232, DW_AT_language(DW_LANG_C)

DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$74, DW_AT_byte_size(0x13)
DW$468	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$468, DW_AT_name("count"), DW_AT_symbol_name("_count")
	.dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
DW$469	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$469, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
	.dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
DW$470	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$470, DW_AT_name("previouscount"), DW_AT_symbol_name("_previouscount")
	.dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
DW$471	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$471, DW_AT_name("sampleperiod"), DW_AT_symbol_name("_sampleperiod")
	.dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
DW$472	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$472, DW_AT_name("period"), DW_AT_symbol_name("_period")
	.dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
DW$473	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
	.dwattr DW$473, DW_AT_name("stable"), DW_AT_symbol_name("_stable")
	.dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$74


DW$T$95	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$95, DW_AT_name("ADC_REGS")
	.dwattr DW$T$95, DW_AT_byte_size(0x1a)
DW$474	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
	.dwattr DW$474, DW_AT_name("ADCTRL1"), DW_AT_symbol_name("_ADCTRL1")
	.dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
DW$475	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
	.dwattr DW$475, DW_AT_name("ADCTRL2"), DW_AT_symbol_name("_ADCTRL2")
	.dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
DW$476	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
	.dwattr DW$476, DW_AT_name("ADCMAXCONV"), DW_AT_symbol_name("_ADCMAXCONV")
	.dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
DW$477	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
	.dwattr DW$477, DW_AT_name("ADCCHSELSEQ1"), DW_AT_symbol_name("_ADCCHSELSEQ1")
	.dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
DW$478	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
	.dwattr DW$478, DW_AT_name("ADCCHSELSEQ2"), DW_AT_symbol_name("_ADCCHSELSEQ2")
	.dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
DW$479	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$479, DW_AT_name("ADCCHSELSEQ3"), DW_AT_symbol_name("_ADCCHSELSEQ3")
	.dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
DW$480	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
	.dwattr DW$480, DW_AT_name("ADCCHSELSEQ4"), DW_AT_symbol_name("_ADCCHSELSEQ4")
	.dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
DW$481	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
	.dwattr DW$481, DW_AT_name("ADCASEQSR"), DW_AT_symbol_name("_ADCASEQSR")
	.dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
DW$482	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$482, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
	.dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
DW$483	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$483, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
	.dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
DW$484	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$484, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
	.dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
DW$485	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$485, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
	.dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
DW$486	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$486, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
	.dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
DW$487	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$487, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
	.dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
DW$488	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$488, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
	.dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
DW$489	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$489, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
	.dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
DW$490	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$490, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
	.dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
DW$491	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$491, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
	.dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
DW$492	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$492, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
	.dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
DW$493	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$493, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
	.dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
DW$494	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$494, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
	.dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
DW$495	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$495, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
	.dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
DW$496	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$496, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
	.dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
DW$497	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$497, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
	.dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
DW$498	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
	.dwattr DW$498, DW_AT_name("ADCTRL3"), DW_AT_symbol_name("_ADCTRL3")
	.dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
DW$499	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$499, DW_AT_name("ADCST"), DW_AT_symbol_name("_ADCST")
	.dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$95

DW$T$251	.dwtag  DW_TAG_typedef, DW_AT_name("adcdatastruct"), DW_AT_type(*DW$T$99)
	.dwattr DW$T$251, DW_AT_language(DW_LANG_C)
DW$T$283	.dwtag  DW_TAG_typedef, DW_AT_name("inputstruct"), DW_AT_type(*DW$T$110)
	.dwattr DW$T$283, DW_AT_language(DW_LANG_C)

DW$T$111	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$111, DW_AT_name("tag_slemsettingsstruct")
	.dwattr DW$T$111, DW_AT_byte_size(0x06)
DW$500	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$500, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
DW$501	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$501, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
	.dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
DW$502	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$502, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
DW$503	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$503, DW_AT_name("mVfsd"), DW_AT_symbol_name("_mVfsd")
	.dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
DW$504	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$504, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
	.dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
DW$505	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$505, DW_AT_name("alarmdelay"), DW_AT_symbol_name("_alarmdelay")
	.dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$111


DW$T$113	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$113, DW_AT_name("tag_slemsstruct")
	.dwattr DW$T$113, DW_AT_byte_size(0x03)
DW$506	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$506, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
	.dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
DW$507	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
	.dwattr DW$507, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
	.dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
DW$508	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$508, DW_AT_name("levelcount"), DW_AT_symbol_name("_levelcount")
	.dwattr DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$113


DW$T$115	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$115, DW_AT_name("tag_rtcbatstruct")
	.dwattr DW$T$115, DW_AT_byte_size(0x02)
DW$509	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$509, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
	.dwattr DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$509, DW_AT_accessibility(DW_ACCESS_public)
DW$510	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$114)
	.dwattr DW$510, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
	.dwattr DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$115


DW$T$116	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$116, DW_AT_name("tag_cppstruct")
	.dwattr DW$T$116, DW_AT_byte_size(0x06)
DW$511	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$511, DW_AT_name("iAtodValue"), DW_AT_symbol_name("_iAtodValue")
	.dwattr DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$511, DW_AT_accessibility(DW_ACCESS_public)
DW$512	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$512, DW_AT_name("fmAinput"), DW_AT_symbol_name("_fmAinput")
	.dwattr DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$512, DW_AT_accessibility(DW_ACCESS_public)
DW$513	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$513, DW_AT_name("fLoadPercent"), DW_AT_symbol_name("_fLoadPercent")
	.dwattr DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$116


DW$T$117	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$117, DW_AT_name("tag_cppsettingsstruct")
	.dwattr DW$T$117, DW_AT_byte_size(0x10)
DW$514	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$514, DW_AT_name("iCppEnable"), DW_AT_symbol_name("_iCppEnable")
	.dwattr DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$514, DW_AT_accessibility(DW_ACCESS_public)
DW$515	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$515, DW_AT_name("iCppLowLimit"), DW_AT_symbol_name("_iCppLowLimit")
	.dwattr DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$515, DW_AT_accessibility(DW_ACCESS_public)
DW$516	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$516, DW_AT_name("iCppHighLimit"), DW_AT_symbol_name("_iCppHighLimit")
	.dwattr DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$516, DW_AT_accessibility(DW_ACCESS_public)
DW$517	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$517, DW_AT_name("cppkvalue"), DW_AT_symbol_name("_cppkvalue")
	.dwattr DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$517, DW_AT_accessibility(DW_ACCESS_public)
DW$518	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$518, DW_AT_name("gammavalue"), DW_AT_symbol_name("_gammavalue")
	.dwattr DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$518, DW_AT_accessibility(DW_ACCESS_public)
DW$519	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$519, DW_AT_name("cpplevelx"), DW_AT_symbol_name("_cpplevelx")
	.dwattr DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$519, DW_AT_accessibility(DW_ACCESS_public)
DW$520	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$520, DW_AT_name("delatRpmPauseDelay"), DW_AT_symbol_name("_delatRpmPauseDelay")
	.dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
DW$521	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$521, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
	.dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
DW$522	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$522, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
DW$523	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$523, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
DW$524	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$524, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
DW$525	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$525, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
DW$526	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$526, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
DW$527	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$527, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$527, DW_AT_accessibility(DW_ACCESS_public)
DW$528	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$528, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$528, DW_AT_accessibility(DW_ACCESS_public)
DW$529	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$529, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$117


DW$T$118	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$118, DW_AT_name("tag_sensorMoving")
	.dwattr DW$T$118, DW_AT_byte_size(0x02)
DW$530	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$530, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
	.dwattr DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$530, DW_AT_accessibility(DW_ACCESS_public)
DW$531	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$531, DW_AT_name("unusedByte"), DW_AT_symbol_name("_unusedByte")
	.dwattr DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$118


DW$T$122	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$122, DW_AT_name("tag_dcmodechecksstruct")
	.dwattr DW$T$122, DW_AT_byte_size(0x0f)
DW$532	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
	.dwattr DW$532, DW_AT_name("ideal"), DW_AT_symbol_name("_ideal")
	.dwattr DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$532, DW_AT_accessibility(DW_ACCESS_public)
DW$533	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$120)
	.dwattr DW$533, DW_AT_name("ok"), DW_AT_symbol_name("_ok")
	.dwattr DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$533, DW_AT_accessibility(DW_ACCESS_public)
DW$534	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$121)
	.dwattr DW$534, DW_AT_name("cylinderComparison"), DW_AT_symbol_name("_cylinderComparison")
	.dwattr DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$534, DW_AT_accessibility(DW_ACCESS_public)
DW$535	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$535, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$535, DW_AT_accessibility(DW_ACCESS_public)
DW$536	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$536, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$536, DW_AT_accessibility(DW_ACCESS_public)
DW$537	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$537, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$537, DW_AT_accessibility(DW_ACCESS_public)
DW$538	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$538, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$538, DW_AT_accessibility(DW_ACCESS_public)
DW$539	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$539, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$539, DW_AT_accessibility(DW_ACCESS_public)
DW$540	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$540, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$540, DW_AT_accessibility(DW_ACCESS_public)
DW$541	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$541, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$541, DW_AT_accessibility(DW_ACCESS_public)
DW$542	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$542, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$542, DW_AT_accessibility(DW_ACCESS_public)
DW$543	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$543, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$122

DW$T$126	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$126, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$126, DW_AT_byte_size(0x01)
DW$544	.dwtag  DW_TAG_far_type
	.dwattr DW$544, DW_AT_type(*DW$T$126)
DW$T$144	.dwtag  DW_TAG_const_type
	.dwattr DW$T$144, DW_AT_type(*DW$544)

DW$T$32	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$32, DW_AT_byte_size(0x02)
DW$545	.dwtag  DW_TAG_subrange_type
	.dwattr DW$545, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$32


DW$T$73	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$73, DW_AT_byte_size(0x0e)
DW$546	.dwtag  DW_TAG_subrange_type
	.dwattr DW$546, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$73


DW$T$34	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$34, DW_AT_byte_size(0x0e)
DW$547	.dwtag  DW_TAG_subrange_type
	.dwattr DW$547, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$34

DW$548	.dwtag  DW_TAG_far_type
	.dwattr DW$548, DW_AT_type(*DW$T$11)
DW$T$175	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$175, DW_AT_type(*DW$548)

DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$19, DW_AT_name("tag_status1struct")
	.dwattr DW$T$19, DW_AT_byte_size(0x01)
DW$549	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$549, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$549, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$549, DW_AT_accessibility(DW_ACCESS_public)
DW$550	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$550, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
	.dwattr DW$550, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$550, DW_AT_accessibility(DW_ACCESS_public)
DW$551	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$551, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
	.dwattr DW$551, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$551, DW_AT_accessibility(DW_ACCESS_public)
DW$552	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$552, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$552, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$552, DW_AT_accessibility(DW_ACCESS_public)
DW$553	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$553, DW_AT_name("replaced"), DW_AT_symbol_name("_replaced")
	.dwattr DW$553, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$553, DW_AT_accessibility(DW_ACCESS_public)
DW$554	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$554, DW_AT_name("excludeslowroll"), DW_AT_symbol_name("_excludeslowroll")
	.dwattr DW$554, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$554, DW_AT_accessibility(DW_ACCESS_public)
DW$555	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$555, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$555, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$555, DW_AT_accessibility(DW_ACCESS_public)
DW$556	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$556, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$556, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$556, DW_AT_accessibility(DW_ACCESS_public)
DW$557	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$557, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$557, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$557, DW_AT_accessibility(DW_ACCESS_public)
DW$558	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$558, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
	.dwattr DW$558, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$558, DW_AT_accessibility(DW_ACCESS_public)
DW$559	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$559, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
	.dwattr DW$559, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$559, DW_AT_accessibility(DW_ACCESS_public)
DW$560	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$560, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
	.dwattr DW$560, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$560, DW_AT_accessibility(DW_ACCESS_public)
DW$561	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$561, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$561, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$561, DW_AT_accessibility(DW_ACCESS_public)
DW$562	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$562, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$562, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$562, DW_AT_accessibility(DW_ACCESS_public)
DW$563	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$563, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$563, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$563, DW_AT_accessibility(DW_ACCESS_public)
DW$564	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$564, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$564, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$19


DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_name("tag_status3struct")
	.dwattr DW$T$20, DW_AT_byte_size(0x01)
DW$565	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$565, DW_AT_name("nopulse"), DW_AT_symbol_name("_nopulse")
	.dwattr DW$565, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$565, DW_AT_accessibility(DW_ACCESS_public)
DW$566	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$566, DW_AT_name("low"), DW_AT_symbol_name("_low")
	.dwattr DW$566, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$566, DW_AT_accessibility(DW_ACCESS_public)
DW$567	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$567, DW_AT_name("high"), DW_AT_symbol_name("_high")
	.dwattr DW$567, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$567, DW_AT_accessibility(DW_ACCESS_public)
DW$568	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$568, DW_AT_name("rpmoor"), DW_AT_symbol_name("_rpmoor")
	.dwattr DW$568, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$568, DW_AT_accessibility(DW_ACCESS_public)
DW$569	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$569, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$569, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$569, DW_AT_accessibility(DW_ACCESS_public)
DW$570	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$570, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$570, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$570, DW_AT_accessibility(DW_ACCESS_public)
DW$571	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$571, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$571, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$571, DW_AT_accessibility(DW_ACCESS_public)
DW$572	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$572, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$572, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$572, DW_AT_accessibility(DW_ACCESS_public)
DW$573	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$573, DW_AT_name("nopulselatched"), DW_AT_symbol_name("_nopulselatched")
	.dwattr DW$573, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$573, DW_AT_accessibility(DW_ACCESS_public)
DW$574	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$574, DW_AT_name("lowlatched"), DW_AT_symbol_name("_lowlatched")
	.dwattr DW$574, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$574, DW_AT_accessibility(DW_ACCESS_public)
DW$575	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$575, DW_AT_name("highlatched"), DW_AT_symbol_name("_highlatched")
	.dwattr DW$575, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$575, DW_AT_accessibility(DW_ACCESS_public)
DW$576	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$576, DW_AT_name("rpmoorlatched"), DW_AT_symbol_name("_rpmoorlatched")
	.dwattr DW$576, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$576, DW_AT_accessibility(DW_ACCESS_public)
DW$577	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$577, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$577, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$577, DW_AT_accessibility(DW_ACCESS_public)
DW$578	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$578, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$578, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$578, DW_AT_accessibility(DW_ACCESS_public)
DW$579	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$579, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$579, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$579, DW_AT_accessibility(DW_ACCESS_public)
DW$580	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$580, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$580, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20


DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$23, DW_AT_name("taggpaport")
	.dwattr DW$T$23, DW_AT_byte_size(0x01)
DW$581	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$581, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
	.dwattr DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$23


DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$26, DW_AT_name("taggpbport")
	.dwattr DW$T$26, DW_AT_byte_size(0x01)
DW$582	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$582, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
	.dwattr DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$26


DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$29, DW_AT_name("taggpdport")
	.dwattr DW$T$29, DW_AT_byte_size(0x01)
DW$583	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$583, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
	.dwattr DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$29


DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$30, DW_AT_byte_size(0x02)
DW$584	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$584, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
	.dwattr DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$584, DW_AT_accessibility(DW_ACCESS_public)
DW$585	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$585, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
	.dwattr DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$30


DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$35, DW_AT_byte_size(0x1e)
DW$586	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$586, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
	.dwattr DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$586, DW_AT_accessibility(DW_ACCESS_public)
DW$587	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$587, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
	.dwattr DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$587, DW_AT_accessibility(DW_ACCESS_public)
DW$588	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$588, DW_AT_name("chan18ma"), DW_AT_symbol_name("_chan18ma")
	.dwattr DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$588, DW_AT_accessibility(DW_ACCESS_public)
DW$589	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$589, DW_AT_name("notused"), DW_AT_symbol_name("_notused")
	.dwattr DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$35


DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$36, DW_AT_byte_size(0x01)
DW$590	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$590, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$36


DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$39, DW_AT_byte_size(0x0b)
DW$591	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$591, DW_AT_name("calprtzero"), DW_AT_symbol_name("_calprtzero")
	.dwattr DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$591, DW_AT_accessibility(DW_ACCESS_public)
DW$592	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$592, DW_AT_name("calprtfullscale"), DW_AT_symbol_name("_calprtfullscale")
	.dwattr DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$592, DW_AT_accessibility(DW_ACCESS_public)
DW$593	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$593, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
	.dwattr DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$593, DW_AT_accessibility(DW_ACCESS_public)
DW$594	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$594, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$594, DW_AT_accessibility(DW_ACCESS_public)
DW$595	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$595, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$39


DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$40, DW_AT_byte_size(0x03)
DW$596	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$596, DW_AT_name("mainrate"), DW_AT_symbol_name("_mainrate")
	.dwattr DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$596, DW_AT_accessibility(DW_ACCESS_public)
DW$597	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$597, DW_AT_name("trendrate"), DW_AT_symbol_name("_trendrate")
	.dwattr DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$597, DW_AT_accessibility(DW_ACCESS_public)
DW$598	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$598, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$40


DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$41, DW_AT_byte_size(0x01)
DW$599	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$599, DW_AT_name("address"), DW_AT_symbol_name("_address")
	.dwattr DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$41


DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$42, DW_AT_byte_size(0x02)
DW$600	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$600, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
	.dwattr DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$600, DW_AT_accessibility(DW_ACCESS_public)
DW$601	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$601, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$42


DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$43, DW_AT_byte_size(0x03)
DW$602	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$602, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
	.dwattr DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$602, DW_AT_accessibility(DW_ACCESS_public)
DW$603	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$603, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
	.dwattr DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$603, DW_AT_accessibility(DW_ACCESS_public)
DW$604	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$604, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
	.dwattr DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$43


DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$44, DW_AT_byte_size(0x01)
DW$605	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$605, DW_AT_name("rate"), DW_AT_symbol_name("_rate")
	.dwattr DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$44


DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$45, DW_AT_byte_size(0x02)
DW$606	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$606, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
	.dwattr DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$606, DW_AT_accessibility(DW_ACCESS_public)
DW$607	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$607, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
	.dwattr DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$45


DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$46, DW_AT_byte_size(0x04)
DW$608	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$608, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
	.dwattr DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$608, DW_AT_accessibility(DW_ACCESS_public)
DW$609	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$609, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
	.dwattr DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$609, DW_AT_accessibility(DW_ACCESS_public)
DW$610	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$610, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
	.dwattr DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$610, DW_AT_accessibility(DW_ACCESS_public)
DW$611	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$611, DW_AT_name("notused4"), DW_AT_symbol_name("_notused4")
	.dwattr DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$46


DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$47, DW_AT_byte_size(0x01)
DW$612	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$612, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
	.dwattr DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$47


DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$48, DW_AT_byte_size(0x01)
DW$613	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$613, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
	.dwattr DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$48


DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$49, DW_AT_byte_size(0x01)
DW$614	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$614, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
	.dwattr DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$49


DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$52, DW_AT_name("tag_timers")
	.dwattr DW$T$52, DW_AT_byte_size(0x4c)
DW$615	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$615, DW_AT_name("update"), DW_AT_symbol_name("_update")
	.dwattr DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$615, DW_AT_accessibility(DW_ACCESS_public)
DW$616	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$616, DW_AT_name("general"), DW_AT_symbol_name("_general")
	.dwattr DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$616, DW_AT_accessibility(DW_ACCESS_public)
DW$617	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$617, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
	.dwattr DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$617, DW_AT_accessibility(DW_ACCESS_public)
DW$618	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$618, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
	.dwattr DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$618, DW_AT_accessibility(DW_ACCESS_public)
DW$619	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$619, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
	.dwattr DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$619, DW_AT_accessibility(DW_ACCESS_public)
DW$620	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$620, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
	.dwattr DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$620, DW_AT_accessibility(DW_ACCESS_public)
DW$621	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$621, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
	.dwattr DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$621, DW_AT_accessibility(DW_ACCESS_public)
DW$622	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$622, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
	.dwattr DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$622, DW_AT_accessibility(DW_ACCESS_public)
DW$623	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$623, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
	.dwattr DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$623, DW_AT_accessibility(DW_ACCESS_public)
DW$624	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$624, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
	.dwattr DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$624, DW_AT_accessibility(DW_ACCESS_public)
DW$625	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$625, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
	.dwattr DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$625, DW_AT_accessibility(DW_ACCESS_public)
DW$626	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$626, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
	.dwattr DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$626, DW_AT_accessibility(DW_ACCESS_public)
DW$627	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$627, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
	.dwattr DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$627, DW_AT_accessibility(DW_ACCESS_public)
DW$628	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$628, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
	.dwattr DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$628, DW_AT_accessibility(DW_ACCESS_public)
DW$629	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$629, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
	.dwattr DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$629, DW_AT_accessibility(DW_ACCESS_public)
DW$630	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$630, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$630, DW_AT_accessibility(DW_ACCESS_public)
DW$631	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$631, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
	.dwattr DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$631, DW_AT_accessibility(DW_ACCESS_public)
DW$632	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$632, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
	.dwattr DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$632, DW_AT_accessibility(DW_ACCESS_public)
DW$633	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$633, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$633, DW_AT_accessibility(DW_ACCESS_public)
DW$634	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$634, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
	.dwattr DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$634, DW_AT_accessibility(DW_ACCESS_public)
DW$635	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$635, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
	.dwattr DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$635, DW_AT_accessibility(DW_ACCESS_public)
DW$636	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$636, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
	.dwattr DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$636, DW_AT_accessibility(DW_ACCESS_public)
DW$637	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$637, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
	.dwattr DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr DW$637, DW_AT_accessibility(DW_ACCESS_public)
DW$638	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$638, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
	.dwattr DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$638, DW_AT_accessibility(DW_ACCESS_public)
DW$639	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$639, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
	.dwattr DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr DW$639, DW_AT_accessibility(DW_ACCESS_public)
DW$640	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$640, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
	.dwattr DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$640, DW_AT_accessibility(DW_ACCESS_public)
DW$641	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$641, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
	.dwattr DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr DW$641, DW_AT_accessibility(DW_ACCESS_public)
DW$642	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$642, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
	.dwattr DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$642, DW_AT_accessibility(DW_ACCESS_public)
DW$643	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$643, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
	.dwattr DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr DW$643, DW_AT_accessibility(DW_ACCESS_public)
DW$644	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$644, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
	.dwattr DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$644, DW_AT_accessibility(DW_ACCESS_public)
DW$645	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$645, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
	.dwattr DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$645, DW_AT_accessibility(DW_ACCESS_public)
DW$646	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$646, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
	.dwattr DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$646, DW_AT_accessibility(DW_ACCESS_public)
DW$647	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$647, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
	.dwattr DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr DW$647, DW_AT_accessibility(DW_ACCESS_public)
DW$648	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$648, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
	.dwattr DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$648, DW_AT_accessibility(DW_ACCESS_public)
DW$649	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$649, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr DW$649, DW_AT_accessibility(DW_ACCESS_public)
DW$650	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$650, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
	.dwattr DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr DW$650, DW_AT_accessibility(DW_ACCESS_public)
DW$651	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$651, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
	.dwattr DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr DW$651, DW_AT_accessibility(DW_ACCESS_public)
DW$652	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$652, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
	.dwattr DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$652, DW_AT_accessibility(DW_ACCESS_public)
DW$653	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$653, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
	.dwattr DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr DW$653, DW_AT_accessibility(DW_ACCESS_public)
DW$654	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$654, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
	.dwattr DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$654, DW_AT_accessibility(DW_ACCESS_public)
DW$655	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$655, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
	.dwattr DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr DW$655, DW_AT_accessibility(DW_ACCESS_public)
DW$656	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$656, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
	.dwattr DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$656, DW_AT_accessibility(DW_ACCESS_public)
DW$657	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$657, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
	.dwattr DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$52


DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$53, DW_AT_byte_size(0x01)
DW$658	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$658, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
	.dwattr DW$658, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$658, DW_AT_accessibility(DW_ACCESS_public)
DW$659	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$659, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
	.dwattr DW$659, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$659, DW_AT_accessibility(DW_ACCESS_public)
DW$660	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$660, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
	.dwattr DW$660, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$660, DW_AT_accessibility(DW_ACCESS_public)
DW$661	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$661, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
	.dwattr DW$661, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$661, DW_AT_accessibility(DW_ACCESS_public)
DW$662	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$662, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
	.dwattr DW$662, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$53


DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$54, DW_AT_byte_size(0x01)
DW$663	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$663, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
	.dwattr DW$663, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$663, DW_AT_accessibility(DW_ACCESS_public)
DW$664	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$664, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
	.dwattr DW$664, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
	.dwattr DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$54


DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$56, DW_AT_byte_size(0x01)
DW$665	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$665, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
	.dwattr DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$56


DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$57, DW_AT_byte_size(0x01)
DW$666	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$666, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
	.dwattr DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$57


DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$58, DW_AT_byte_size(0x01)
DW$667	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$667, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
	.dwattr DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$58


DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$59, DW_AT_byte_size(0x03)
DW$668	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$668, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
	.dwattr DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$668, DW_AT_accessibility(DW_ACCESS_public)
DW$669	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$669, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
	.dwattr DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$669, DW_AT_accessibility(DW_ACCESS_public)
DW$670	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$670, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
	.dwattr DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$59


DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$60, DW_AT_byte_size(0x02)
DW$671	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$671, DW_AT_name("shortlrate"), DW_AT_symbol_name("_shortlrate")
	.dwattr DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$671, DW_AT_accessibility(DW_ACCESS_public)
DW$672	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$672, DW_AT_name("longlrate"), DW_AT_symbol_name("_longlrate")
	.dwattr DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$60


DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$61, DW_AT_byte_size(0x10)
DW$673	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$673, DW_AT_name("wiorequest"), DW_AT_symbol_name("_wiorequest")
	.dwattr DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$673, DW_AT_accessibility(DW_ACCESS_public)
DW$674	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$674, DW_AT_name("wiocancelled"), DW_AT_symbol_name("_wiocancelled")
	.dwattr DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$674, DW_AT_accessibility(DW_ACCESS_public)
DW$675	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$675, DW_AT_name("wioreceived"), DW_AT_symbol_name("_wioreceived")
	.dwattr DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$675, DW_AT_accessibility(DW_ACCESS_public)
DW$676	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$676, DW_AT_name("slaverequest"), DW_AT_symbol_name("_slaverequest")
	.dwattr DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$676, DW_AT_accessibility(DW_ACCESS_public)
DW$677	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$677, DW_AT_name("slavereceived"), DW_AT_symbol_name("_slavereceived")
	.dwattr DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$677, DW_AT_accessibility(DW_ACCESS_public)
DW$678	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$678, DW_AT_name("slaveretry"), DW_AT_symbol_name("_slaveretry")
	.dwattr DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$678, DW_AT_accessibility(DW_ACCESS_public)
DW$679	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$679, DW_AT_name("pcrequest"), DW_AT_symbol_name("_pcrequest")
	.dwattr DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$679, DW_AT_accessibility(DW_ACCESS_public)
DW$680	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$680, DW_AT_name("pcreqtimeout"), DW_AT_symbol_name("_pcreqtimeout")
	.dwattr DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$680, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$61


DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$63, DW_AT_byte_size(0x06)
DW$681	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$681, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
	.dwattr DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$681, DW_AT_accessibility(DW_ACCESS_public)
DW$682	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$682, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
	.dwattr DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$682, DW_AT_accessibility(DW_ACCESS_public)
DW$683	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$683, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
	.dwattr DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$683, DW_AT_accessibility(DW_ACCESS_public)
DW$684	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$684, DW_AT_name("value"), DW_AT_symbol_name("_value")
	.dwattr DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$684, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$63


DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$64, DW_AT_byte_size(0x06)
DW$685	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$685, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
	.dwattr DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$685, DW_AT_accessibility(DW_ACCESS_public)
DW$686	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$686, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
	.dwattr DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$686, DW_AT_accessibility(DW_ACCESS_public)
DW$687	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$687, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
	.dwattr DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$687, DW_AT_accessibility(DW_ACCESS_public)
DW$688	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$688, DW_AT_name("value"), DW_AT_symbol_name("_value")
	.dwattr DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$64


DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$65, DW_AT_byte_size(0x02)
DW$689	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$689, DW_AT_name("value"), DW_AT_symbol_name("_value")
	.dwattr DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$689, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$65


DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$72, DW_AT_name("tag_sensorstruct")
	.dwattr DW$T$72, DW_AT_byte_size(0x12)
DW$690	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$690, DW_AT_name("status1"), DW_AT_symbol_name("_status1")
	.dwattr DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$690, DW_AT_accessibility(DW_ACCESS_public)
DW$691	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
	.dwattr DW$691, DW_AT_name("status2"), DW_AT_symbol_name("_status2")
	.dwattr DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$691, DW_AT_accessibility(DW_ACCESS_public)
DW$692	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$692, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
	.dwattr DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$692, DW_AT_accessibility(DW_ACCESS_public)
DW$693	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$693, DW_AT_name("val"), DW_AT_symbol_name("_val")
	.dwattr DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$693, DW_AT_accessibility(DW_ACCESS_public)
DW$694	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$694, DW_AT_name("immediateval"), DW_AT_symbol_name("_immediateval")
	.dwattr DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$694, DW_AT_accessibility(DW_ACCESS_public)
DW$695	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$695, DW_AT_name("initialval"), DW_AT_symbol_name("_initialval")
	.dwattr DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$695, DW_AT_accessibility(DW_ACCESS_public)
DW$696	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$696, DW_AT_name("precomp"), DW_AT_symbol_name("_precomp")
	.dwattr DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$696, DW_AT_accessibility(DW_ACCESS_public)
DW$697	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$697, DW_AT_name("postcomp"), DW_AT_symbol_name("_postcomp")
	.dwattr DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$697, DW_AT_accessibility(DW_ACCESS_public)
DW$698	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$698, DW_AT_name("postfilter"), DW_AT_symbol_name("_postfilter")
