;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Thu Aug 18 12:16:07 2016                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("common.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-2,16
	.field  	_MagicNumber+0,32
	.field  	0,32			; _MagicNumber @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_f_filesystem_initialized+0,32
	.field  	0,16			; _f_filesystem_initialized @ 0


DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy"), DW_AT_symbol_name("_memcpy")
	.dwattr DW$1, DW_AT_type(*DW$T$3)
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$3	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$81)
DW$4	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$1



DW$634	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$81)
DW$635	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$636	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$637	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$179)
	.dwendtag DW$T$236


DW$T$238	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$238, DW_AT_language(DW_LANG_C)
DW$638	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$179)
	.dwendtag DW$T$238

DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$T$59	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$59, DW_AT_address_class(0x16)
DW$T$83	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$83, DW_AT_language(DW_LANG_C)

DW$T$242	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$242, DW_AT_language(DW_LANG_C)
DW$639	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$T$242


DW$T$244	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$244, DW_AT_language(DW_LANG_C)
DW$640	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$244


DW$T$246	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$246, DW_AT_language(DW_LANG_C)
DW$641	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$92)
	.dwendtag DW$T$246


DW$T$248	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$248, DW_AT_language(DW_LANG_C)
DW$642	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$92)
DW$643	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$100)
	.dwendtag DW$T$248

DW$T$156	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$48)
	.dwattr DW$T$156, DW_AT_address_class(0x16)
DW$T$36	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
	.dwattr DW$T$36, DW_AT_address_class(0x16)
DW$T$53	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$52)
	.dwattr DW$T$53, DW_AT_address_class(0x16)

DW$T$258	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$53)
	.dwattr DW$T$258, DW_AT_language(DW_LANG_C)

DW$T$260	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$52)
	.dwattr DW$T$260, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$260, DW_AT_byte_size(0x200)
DW$644	.dwtag  DW_TAG_subrange_type
	.dwattr DW$644, DW_AT_upper_bound(0x1ff)
	.dwendtag DW$T$260

DW$T$92	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$74)
	.dwattr DW$T$92, DW_AT_address_class(0x16)
DW$T$142	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$92)
	.dwattr DW$T$142, DW_AT_address_class(0x16)
DW$T$106	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$105)
	.dwattr DW$T$106, DW_AT_address_class(0x16)
DW$T$185	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$106)
	.dwattr DW$T$185, DW_AT_address_class(0x16)

DW$T$273	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$105)
	.dwattr DW$T$273, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$273, DW_AT_byte_size(0x1a)
DW$645	.dwtag  DW_TAG_subrange_type
	.dwattr DW$645, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$273

DW$T$64	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
	.dwattr DW$T$64, DW_AT_address_class(0x16)
DW$T$179	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$67)
	.dwattr DW$T$179, DW_AT_address_class(0x16)
DW$T$108	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
	.dwattr DW$T$108, DW_AT_address_class(0x16)

DW$T$285	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$108)
	.dwattr DW$T$285, DW_AT_language(DW_LANG_C)
DW$646	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$179)
	.dwendtag DW$T$285

DW$T$100	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$99)
	.dwattr DW$T$100, DW_AT_address_class(0x16)
DW$T$171	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$170)
	.dwattr DW$T$171, DW_AT_address_class(0x16)
DW$T$299	.dwtag  DW_TAG_typedef, DW_AT_name("F_FILESYSTEM"), DW_AT_type(*DW$T$78)
	.dwattr DW$T$299, DW_AT_language(DW_LANG_C)

DW$T$303	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$302)
	.dwattr DW$T$303, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$303, DW_AT_byte_size(0x18)
DW$647	.dwtag  DW_TAG_subrange_type
	.dwattr DW$647, DW_AT_upper_bound(0x05)
	.dwendtag DW$T$303

DW$648	.dwtag  DW_TAG_far_type
DW$T$80	.dwtag  DW_TAG_const_type
	.dwattr DW$T$80, DW_AT_type(*DW$648)
DW$649	.dwtag  DW_TAG_far_type
	.dwattr DW$649, DW_AT_type(*DW$T$6)
DW$T$121	.dwtag  DW_TAG_const_type
	.dwattr DW$T$121, DW_AT_type(*DW$649)
DW$T$147	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$146)
	.dwattr DW$T$147, DW_AT_address_class(0x16)
DW$T$48	.dwtag  DW_TAG_typedef, DW_AT_name("F_BOOTRECORD"), DW_AT_type(*DW$T$24)
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
DW$T$35	.dwtag  DW_TAG_typedef, DW_AT_name("F_PHY"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$35, DW_AT_language(DW_LANG_C)
DW$T$52	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$52, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$52, DW_AT_byte_size(0x01)
DW$T$74	.dwtag  DW_TAG_typedef, DW_AT_name("F_VOLUME"), DW_AT_type(*DW$T$55)
	.dwattr DW$T$74, DW_AT_language(DW_LANG_C)
DW$T$105	.dwtag  DW_TAG_typedef, DW_AT_name("F_MULTI"), DW_AT_type(*DW$T$60)
	.dwattr DW$T$105, DW_AT_language(DW_LANG_C)
DW$T$63	.dwtag  DW_TAG_typedef, DW_AT_name("F_POS"), DW_AT_type(*DW$T$61)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("F_FILE"), DW_AT_type(*DW$T$62)
	.dwattr DW$T$67, DW_AT_language(DW_LANG_C)
DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("F_FILEINT"), DW_AT_type(*DW$T$70)
	.dwattr DW$T$76, DW_AT_language(DW_LANG_C)
DW$T$99	.dwtag  DW_TAG_typedef, DW_AT_name("F_DIRENTRY"), DW_AT_type(*DW$T$72)
	.dwattr DW$T$99, DW_AT_language(DW_LANG_C)
DW$T$170	.dwtag  DW_TAG_typedef, DW_AT_name("F_SPACE"), DW_AT_type(*DW$T$73)
	.dwattr DW$T$170, DW_AT_language(DW_LANG_C)

DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$78, DW_AT_byte_size(0xa4a)
DW$650	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
	.dwattr DW$650, DW_AT_name("volumes"), DW_AT_symbol_name("_volumes")
	.dwattr DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$650, DW_AT_accessibility(DW_ACCESS_public)
DW$651	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
	.dwattr DW$651, DW_AT_name("files"), DW_AT_symbol_name("_files")
	.dwattr DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x47c]
	.dwattr DW$651, DW_AT_accessibility(DW_ACCESS_public)
DW$652	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$652, DW_AT_name("sectorbuffer"), DW_AT_symbol_name("_sectorbuffer")
	.dwattr DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x84a]
	.dwattr DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$78

DW$653	.dwtag  DW_TAG_far_type
	.dwattr DW$653, DW_AT_type(*DW$T$301)
DW$T$302	.dwtag  DW_TAG_const_type
	.dwattr DW$T$302, DW_AT_type(*DW$653)

DW$T$50	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$50, DW_AT_byte_size(0x200)
DW$654	.dwtag  DW_TAG_subrange_type
	.dwattr DW$654, DW_AT_upper_bound(0x1ff)
	.dwendtag DW$T$50


DW$T$146	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$146, DW_AT_language(DW_LANG_C)
DW$655	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$145)
DW$656	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$146


DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$24, DW_AT_byte_size(0x48)
DW$657	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$657, DW_AT_name("jump_code"), DW_AT_symbol_name("_jump_code")
	.dwattr DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$657, DW_AT_accessibility(DW_ACCESS_public)
DW$658	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$658, DW_AT_name("OEM_name"), DW_AT_symbol_name("_OEM_name")
	.dwattr DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$658, DW_AT_accessibility(DW_ACCESS_public)
DW$659	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$659, DW_AT_name("bytes_per_sector"), DW_AT_symbol_name("_bytes_per_sector")
	.dwattr DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$659, DW_AT_accessibility(DW_ACCESS_public)
DW$660	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$660, DW_AT_name("sector_per_cluster"), DW_AT_symbol_name("_sector_per_cluster")
	.dwattr DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$660, DW_AT_accessibility(DW_ACCESS_public)
DW$661	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$661, DW_AT_name("reserved_sectors"), DW_AT_symbol_name("_reserved_sectors")
	.dwattr DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$661, DW_AT_accessibility(DW_ACCESS_public)
DW$662	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$662, DW_AT_name("number_of_FATs"), DW_AT_symbol_name("_number_of_FATs")
	.dwattr DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$662, DW_AT_accessibility(DW_ACCESS_public)
DW$663	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$663, DW_AT_name("max_root_entry"), DW_AT_symbol_name("_max_root_entry")
	.dwattr DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$663, DW_AT_accessibility(DW_ACCESS_public)
DW$664	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$664, DW_AT_name("number_of_sectors_less32"), DW_AT_symbol_name("_number_of_sectors_less32")
	.dwattr DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$664, DW_AT_accessibility(DW_ACCESS_public)
DW$665	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$665, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
	.dwattr DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$665, DW_AT_accessibility(DW_ACCESS_public)
DW$666	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$666, DW_AT_name("sector_per_FAT"), DW_AT_symbol_name("_sector_per_FAT")
	.dwattr DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$666, DW_AT_accessibility(DW_ACCESS_public)
DW$667	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$667, DW_AT_name("sector_per_Track"), DW_AT_symbol_name("_sector_per_Track")
	.dwattr DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$667, DW_AT_accessibility(DW_ACCESS_public)
DW$668	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$668, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
	.dwattr DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$668, DW_AT_accessibility(DW_ACCESS_public)
DW$669	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$669, DW_AT_name("number_of_hidden_sectors"), DW_AT_symbol_name("_number_of_hidden_sectors")
	.dwattr DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$669, DW_AT_accessibility(DW_ACCESS_public)
DW$670	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$670, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
	.dwattr DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$670, DW_AT_accessibility(DW_ACCESS_public)
DW$671	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$671, DW_AT_name("sector_per_FAT32"), DW_AT_symbol_name("_sector_per_FAT32")
	.dwattr DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$671, DW_AT_accessibility(DW_ACCESS_public)
DW$672	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$672, DW_AT_name("extflags"), DW_AT_symbol_name("_extflags")
	.dwattr DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$672, DW_AT_accessibility(DW_ACCESS_public)
DW$673	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$673, DW_AT_name("fsversion"), DW_AT_symbol_name("_fsversion")
	.dwattr DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$673, DW_AT_accessibility(DW_ACCESS_public)
DW$674	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$674, DW_AT_name("rootcluster"), DW_AT_symbol_name("_rootcluster")
	.dwattr DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$674, DW_AT_accessibility(DW_ACCESS_public)
DW$675	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$675, DW_AT_name("fsinfo"), DW_AT_symbol_name("_fsinfo")
	.dwattr DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$675, DW_AT_accessibility(DW_ACCESS_public)
DW$676	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$676, DW_AT_name("bkbootsec"), DW_AT_symbol_name("_bkbootsec")
	.dwattr DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$676, DW_AT_accessibility(DW_ACCESS_public)
DW$677	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$677, DW_AT_name("reserved"), DW_AT_symbol_name("_reserved")
	.dwattr DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$677, DW_AT_accessibility(DW_ACCESS_public)
DW$678	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$678, DW_AT_name("logical_drive_num"), DW_AT_symbol_name("_logical_drive_num")
	.dwattr DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$678, DW_AT_accessibility(DW_ACCESS_public)
DW$679	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$679, DW_AT_name("extended_signature"), DW_AT_symbol_name("_extended_signature")
	.dwattr DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
	.dwattr DW$679, DW_AT_accessibility(DW_ACCESS_public)
DW$680	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$680, DW_AT_name("serial_number"), DW_AT_symbol_name("_serial_number")
	.dwattr DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$680, DW_AT_accessibility(DW_ACCESS_public)
DW$681	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$681, DW_AT_name("volume_name"), DW_AT_symbol_name("_volume_name")
	.dwattr DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$681, DW_AT_accessibility(DW_ACCESS_public)
DW$682	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$682, DW_AT_name("FAT_name"), DW_AT_symbol_name("_FAT_name")
	.dwattr DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr DW$682, DW_AT_accessibility(DW_ACCESS_public)
DW$683	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$683, DW_AT_name("executable_marker"), DW_AT_symbol_name("_executable_marker")
	.dwattr DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr DW$683, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$24


DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$26, DW_AT_byte_size(0x08)
DW$684	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$684, DW_AT_name("number_of_cylinders"), DW_AT_symbol_name("_number_of_cylinders")
	.dwattr DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$684, DW_AT_accessibility(DW_ACCESS_public)
DW$685	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$685, DW_AT_name("sector_per_track"), DW_AT_symbol_name("_sector_per_track")
	.dwattr DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$685, DW_AT_accessibility(DW_ACCESS_public)
DW$686	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$686, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
	.dwattr DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$686, DW_AT_accessibility(DW_ACCESS_public)
DW$687	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$687, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
	.dwattr DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$687, DW_AT_accessibility(DW_ACCESS_public)
DW$688	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$688, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
	.dwattr DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$26

DW$T$145	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
	.dwattr DW$T$145, DW_AT_address_class(0x16)

DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$55, DW_AT_byte_size(0x47c)
DW$689	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$689, DW_AT_name("state"), DW_AT_symbol_name("_state")
	.dwattr DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$689, DW_AT_accessibility(DW_ACCESS_public)
DW$690	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$690, DW_AT_name("bootrecord"), DW_AT_symbol_name("_bootrecord")
	.dwattr DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$690, DW_AT_accessibility(DW_ACCESS_public)
DW$691	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$691, DW_AT_name("firstfat"), DW_AT_symbol_name("_firstfat")
	.dwattr DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr DW$691, DW_AT_accessibility(DW_ACCESS_public)
DW$692	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$692, DW_AT_name("root"), DW_AT_symbol_name("_root")
	.dwattr DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr DW$692, DW_AT_accessibility(DW_ACCESS_public)
DW$693	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$693, DW_AT_name("data"), DW_AT_symbol_name("_data")
	.dwattr DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr DW$693, DW_AT_accessibility(DW_ACCESS_public)
DW$694	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$694, DW_AT_name("fat"), DW_AT_symbol_name("_fat")
	.dwattr DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr DW$694, DW_AT_accessibility(DW_ACCESS_public)
DW$695	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$695, DW_AT_name("fatsector"), DW_AT_symbol_name("_fatsector")
	.dwattr DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x256]
	.dwattr DW$695, DW_AT_accessibility(DW_ACCESS_public)
DW$696	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$696, DW_AT_name("fatmodified"), DW_AT_symbol_name("_fatmodified")
	.dwattr DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x258]
	.dwattr DW$696, DW_AT_accessibility(DW_ACCESS_public)
DW$697	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$697, DW_AT_name("direntry"), DW_AT_symbol_name("_direntry")
	.dwattr DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x25a]
	.dwattr DW$697, DW_AT_accessibility(DW_ACCESS_public)
DW$698	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$698, DW_AT_name("direntrysector"), DW_AT_symbol_name("_direntrysector")
	.dwattr DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x45a]
	.dwattr DW$698, DW_AT_accessibility(DW_ACCESS_public)
DW$699	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$699, DW_AT_name("lastalloccluster"), DW_AT_symbol_name("_lastalloccluster")
	.dwattr DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x45c]
	.dwattr DW$699, DW_AT_accessibility(DW_ACCESS_public)
DW$700	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$700, DW_AT_name("func"), DW_AT_symbol_name("_func")
	.dwattr DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x45e]
	.dwattr DW$700, DW_AT_accessibility(DW_ACCESS_public)
DW$701	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
	.dwattr DW$701, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
	.dwattr DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
	.dwattr DW$701, DW_AT_accessibility(DW_ACCESS_public)
DW$702	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$702, DW_AT_name("mediatype"), DW_AT_symbol_name("_mediatype")
	.dwattr DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x470]
	.dwattr DW$702, DW_AT_accessibility(DW_ACCESS_public)
DW$703	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
	.dwattr DW$703, DW_AT_name("clspace"), DW_AT_symbol_name("_clspace")
	.dwattr DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x472]
	.dwattr DW$703, DW_AT_accessibility(DW_ACCESS_public)
DW$704	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$704, DW_AT_name("cspaceok"), DW_AT_symbol_name("_cspaceok")
	.dwattr DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x478]
	.dwattr DW$704, DW_AT_accessibility(DW_ACCESS_public)
DW$705	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$705, DW_AT_name("mutex"), DW_AT_symbol_name("_mutex")
	.dwattr DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x47a]
	.dwattr DW$705, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$55


DW$T$75	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$74)
	.dwattr DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$75, DW_AT_byte_size(0x47c)
DW$706	.dwtag  DW_TAG_subrange_type
	.dwattr DW$706, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$75


DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$60, DW_AT_byte_size(0x1a)
DW$707	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$707, DW_AT_name("ID"), DW_AT_symbol_name("_ID")
	.dwattr DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$707, DW_AT_accessibility(DW_ACCESS_public)
DW$708	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$708, DW_AT_name("f_curdrive"), DW_AT_symbol_name("_f_curdrive")
	.dwattr DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$708, DW_AT_accessibility(DW_ACCESS_public)
DW$709	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
	.dwattr DW$709, DW_AT_name("f_vols"), DW_AT_symbol_name("_f_vols")
	.dwattr DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$709, DW_AT_accessibility(DW_ACCESS_public)
DW$710	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$710, DW_AT_name("pmutex"), DW_AT_symbol_name("_pmutex")
	.dwattr DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$710, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$60


DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$61, DW_AT_byte_size(0x0c)
DW$711	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$711, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
	.dwattr DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$711, DW_AT_accessibility(DW_ACCESS_public)
DW$712	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$712, DW_AT_name("prevcluster"), DW_AT_symbol_name("_prevcluster")
	.dwattr DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$712, DW_AT_accessibility(DW_ACCESS_public)
DW$713	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$713, DW_AT_name("sectorbegin"), DW_AT_symbol_name("_sectorbegin")
	.dwattr DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$713, DW_AT_accessibility(DW_ACCESS_public)
DW$714	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$714, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
	.dwattr DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$714, DW_AT_accessibility(DW_ACCESS_public)
DW$715	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$715, DW_AT_name("sectorend"), DW_AT_symbol_name("_sectorend")
	.dwattr DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$715, DW_AT_accessibility(DW_ACCESS_public)
DW$716	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$716, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$716, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$61


DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$62, DW_AT_byte_size(0x02)
DW$717	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$717, DW_AT_name("reference"), DW_AT_symbol_name("_reference")
	.dwattr DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$717, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$62


DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$70, DW_AT_byte_size(0x3ce)
DW$718	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
	.dwattr DW$718, DW_AT_name("file"), DW_AT_symbol_name("_file")
	.dwattr DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$718, DW_AT_accessibility(DW_ACCESS_public)
DW$719	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$719, DW_AT_name("modified"), DW_AT_symbol_name("_modified")
	.dwattr DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$719, DW_AT_accessibility(DW_ACCESS_public)
DW$720	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$720, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
	.dwattr DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$720, DW_AT_accessibility(DW_ACCESS_public)
DW$721	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$721, DW_AT_name("drivenum"), DW_AT_symbol_name("_drivenum")
	.dwattr DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$721, DW_AT_accessibility(DW_ACCESS_public)
DW$722	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$722, DW_AT_name("abspos"), DW_AT_symbol_name("_abspos")
	.dwattr DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$722, DW_AT_accessibility(DW_ACCESS_public)
DW$723	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$723, DW_AT_name("relpos"), DW_AT_symbol_name("_relpos")
	.dwattr DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$723, DW_AT_accessibility(DW_ACCESS_public)
DW$724	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$724, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
	.dwattr DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$724, DW_AT_accessibility(DW_ACCESS_public)
DW$725	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$725, DW_AT_name("data"), DW_AT_symbol_name("_data")
	.dwattr DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$725, DW_AT_accessibility(DW_ACCESS_public)
DW$726	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
	.dwattr DW$726, DW_AT_name("WrDataCache"), DW_AT_symbol_name("_WrDataCache")
	.dwattr DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
	.dwattr DW$726, DW_AT_accessibility(DW_ACCESS_public)
DW$727	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$727, DW_AT_name("startcluster"), DW_AT_symbol_name("_startcluster")
	.dwattr DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x392]
	.dwattr DW$727, DW_AT_accessibility(DW_ACCESS_public)
DW$728	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
	.dwattr DW$728, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x394]
	.dwattr DW$728, DW_AT_accessibility(DW_ACCESS_public)
DW$729	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
	.dwattr DW$729, DW_AT_name("dirpos"), DW_AT_symbol_name("_dirpos")
	.dwattr DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a0]
	.dwattr DW$729, DW_AT_accessibility(DW_ACCESS_public)
DW$730	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$730, DW_AT_name("seekpos"), DW_AT_symbol_name("_seekpos")
	.dwattr DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x3ac]
	.dwattr DW$730, DW_AT_accessibility(DW_ACCESS_public)
DW$731	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$731, DW_AT_name("seekprev"), DW_AT_symbol_name("_seekprev")
	.dwattr DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x3bc]
	.dwattr DW$731, DW_AT_accessibility(DW_ACCESS_public)
DW$732	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$732, DW_AT_name("seekshift"), DW_AT_symbol_name("_seekshift")
	.dwattr DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x3cc]
	.dwattr DW$732, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$70


DW$T$77	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$76)
	.dwattr DW$T$77, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$77, DW_AT_byte_size(0x3ce)
DW$733	.dwtag  DW_TAG_subrange_type
	.dwattr DW$733, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$77


DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$72, DW_AT_byte_size(0x20)
DW$734	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$734, DW_AT_name("name"), DW_AT_symbol_name("_name")
	.dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
DW$735	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$735, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
	.dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
DW$736	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$736, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
	.dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
DW$737	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$737, DW_AT_name("ntres"), DW_AT_symbol_name("_ntres")
	.dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
DW$738	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$738, DW_AT_name("crttimetenth"), DW_AT_symbol_name("_crttimetenth")
	.dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
DW$739	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$739, DW_AT_name("crttime"), DW_AT_symbol_name("_crttime")
	.dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
DW$740	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$740, DW_AT_name("crtdate"), DW_AT_symbol_name("_crtdate")
	.dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
DW$741	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$741, DW_AT_name("lastaccessdate"), DW_AT_symbol_name("_lastaccessdate")
	.dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
DW$742	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$742, DW_AT_name("clusterhi"), DW_AT_symbol_name("_clusterhi")
	.dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
DW$743	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$743, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
	.dwattr DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$743, DW_AT_accessibility(DW_ACCESS_public)
DW$744	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$744, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
	.dwattr DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$744, DW_AT_accessibility(DW_ACCESS_public)
DW$745	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$745, DW_AT_name("clusterlo"), DW_AT_symbol_name("_clusterlo")
	.dwattr DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$745, DW_AT_accessibility(DW_ACCESS_public)
DW$746	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
	.dwattr DW$746, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
	.dwattr DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$746, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$72


DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$73, DW_AT_byte_size(0x10)
DW$747	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$747, DW_AT_name("total"), DW_AT_symbol_name("_total")
	.dwattr DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$747, DW_AT_accessibility(DW_ACCESS_public)
DW$748	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$748, DW_AT_name("free"), DW_AT_symbol_name("_free")
	.dwattr DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$748, DW_AT_accessibility(DW_ACCESS_public)
DW$749	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$749, DW_AT_name("used"), DW_AT_symbol_name("_used")
	.dwattr DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$749, DW_AT_accessibility(DW_ACCESS_public)
DW$750	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$750, DW_AT_name("bad"), DW_AT_symbol_name("_bad")
	.dwattr DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$750, DW_AT_accessibility(DW_ACCESS_public)
DW$751	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$751, DW_AT_name("total_high"), DW_AT_symbol_name("_total_high")
	.dwattr DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$751, DW_AT_accessibility(DW_ACCESS_public)
DW$752	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$752, DW_AT_name("free_high"), DW_AT_symbol_name("_free_high")
	.dwattr DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$752, DW_AT_accessibility(DW_ACCESS_public)
DW$753	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$753, DW_AT_name("used_high"), DW_AT_symbol_name("_used_high")
	.dwattr DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$753, DW_AT_accessibility(DW_ACCESS_public)
DW$754	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$754, DW_AT_name("bad_high"), DW_AT_symbol_name("_bad_high")
	.dwattr DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$754, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$73

DW$T$301	.dwtag  DW_TAG_typedef, DW_AT_name("t_FAT32_CS"), DW_AT_type(*DW$T$79)
	.dwattr DW$T$301, DW_AT_language(DW_LANG_C)

DW$T$19	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$19, DW_AT_byte_size(0x03)
DW$755	.dwtag  DW_TAG_subrange_type
	.dwattr DW$755, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$19


DW$T$20	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$20, DW_AT_byte_size(0x08)
DW$756	.dwtag  DW_TAG_subrange_type
	.dwattr DW$756, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$20


DW$T$21	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$21, DW_AT_byte_size(0x0c)
DW$757	.dwtag  DW_TAG_subrange_type
	.dwattr DW$757, DW_AT_upper_bound(0x0b)
	.dwendtag DW$T$21


DW$T$22	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$22, DW_AT_byte_size(0x0b)
DW$758	.dwtag  DW_TAG_subrange_type
	.dwattr DW$758, DW_AT_upper_bound(0x0a)
	.dwendtag DW$T$22


DW$T$23	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$23, DW_AT_byte_size(0x02)
DW$759	.dwtag  DW_TAG_subrange_type
	.dwattr DW$759, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$23


DW$T$71	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$71, DW_AT_byte_size(0x04)
DW$760	.dwtag  DW_TAG_subrange_type
	.dwattr DW$760, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$71


DW$T$69	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$69, DW_AT_byte_size(0x10)
DW$761	.dwtag  DW_TAG_subrange_type
	.dwattr DW$761, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$69

DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("F_SECTOR"), DW_AT_type(*DW$T$25)
	.dwattr DW$T$49, DW_AT_language(DW_LANG_C)
DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$51, DW_AT_language(DW_LANG_C)
DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("F_CLSPACE"), DW_AT_type(*DW$T$47)
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)

DW$T$58	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$57)
	.dwattr DW$T$58, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$58, DW_AT_byte_size(0x14)
DW$762	.dwtag  DW_TAG_subrange_type
	.dwattr DW$762, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$58

DW$T$68	.dwtag  DW_TAG_typedef, DW_AT_name("t_WrDataCache"), DW_AT_type(*DW$T$66)
	.dwattr DW$T$68, DW_AT_language(DW_LANG_C)

DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$79, DW_AT_byte_size(0x04)
DW$763	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$763, DW_AT_name("max_sectors"), DW_AT_symbol_name("_max_sectors")
	.dwattr DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$763, DW_AT_accessibility(DW_ACCESS_public)
DW$764	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$764, DW_AT_name("sector_per_cluster"), DW_AT_symbol_name("_sector_per_cluster")
	.dwattr DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$764, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$79


DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$25, DW_AT_byte_size(0x04)
DW$765	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$765, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
	.dwattr DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$765, DW_AT_accessibility(DW_ACCESS_public)
DW$766	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$766, DW_AT_name("num"), DW_AT_symbol_name("_num")
	.dwattr DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$766, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$25


DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$46, DW_AT_byte_size(0x10)
DW$767	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$767, DW_AT_name("writesector"), DW_AT_symbol_name("_writesector")
	.dwattr DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$767, DW_AT_accessibility(DW_ACCESS_public)
DW$768	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$768, DW_AT_name("writemultiplesector"), DW_AT_symbol_name("_writemultiplesector")
	.dwattr DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$768, DW_AT_accessibility(DW_ACCESS_public)
DW$769	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$769, DW_AT_name("readsector"), DW_AT_symbol_name("_readsector")
	.dwattr DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$769, DW_AT_accessibility(DW_ACCESS_public)
DW$770	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$770, DW_AT_name("readmultiplesector"), DW_AT_symbol_name("_readmultiplesector")
	.dwattr DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$770, DW_AT_accessibility(DW_ACCESS_public)
DW$771	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$771, DW_AT_name("getphy"), DW_AT_symbol_name("_getphy")
	.dwattr DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$771, DW_AT_accessibility(DW_ACCESS_public)
DW$772	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
	.dwattr DW$772, DW_AT_name("getstatus"), DW_AT_symbol_name("_getstatus")
	.dwattr DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$772, DW_AT_accessibility(DW_ACCESS_public)
DW$773	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$773, DW_AT_name("delfunc"), DW_AT_symbol_name("_delfunc")
	.dwattr DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$773, DW_AT_accessibility(DW_ACCESS_public)
DW$774	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$774, DW_AT_name("user_ptr"), DW_AT_symbol_name("_user_ptr")
	.dwattr DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$774, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$46


DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$47, DW_AT_byte_size(0x06)
DW$775	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$775, DW_AT_name("clfree"), DW_AT_symbol_name("_clfree")
	.dwattr DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$775, DW_AT_accessibility(DW_ACCESS_public)
DW$776	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$776, DW_AT_name("clused"), DW_AT_symbol_name("_clused")
	.dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
DW$777	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$777, DW_AT_name("clbad"), DW_AT_symbol_name("_clbad")
	.dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$47


DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$57, DW_AT_byte_size(0x14)
DW$778	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$778, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
	.dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$57


DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$66, DW_AT_byte_size(0x186)
DW$779	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$779, DW_AT_name("N"), DW_AT_symbol_name("_N")
	.dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
DW$780	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
	.dwattr DW$780, DW_AT_name("ptr"), DW_AT_symbol_name("_ptr")
	.dwattr DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$780, DW_AT_accessibility(DW_ACCESS_public)
DW$781	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$781, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$781, DW_AT_accessibility(DW_ACCESS_public)
DW$782	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
	.dwattr DW$782, DW_AT_name("posbuf"), DW_AT_symbol_name("_posbuf")
	.dwattr DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$782, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$66

DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("F_WRITESECTOR"), DW_AT_type(*DW$T$28)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)
DW$T$33	.dwtag  DW_TAG_typedef, DW_AT_name("F_READSECTOR"), DW_AT_type(*DW$T$28)
	.dwattr DW$T$33, DW_AT_language(DW_LANG_C)
DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("F_WRITEMULTIPLESECTOR"), DW_AT_type(*DW$T$31)
	.dwattr DW$T$32, DW_AT_language(DW_LANG_C)
DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("F_READMULTIPLESECTOR"), DW_AT_type(*DW$T$31)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("F_GETPHY"), DW_AT_type(*DW$T$38)
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
DW$T$45	.dwtag  DW_TAG_typedef, DW_AT_name("F_DELFUNC"), DW_AT_type(*DW$T$44)
	.dwattr DW$T$45, DW_AT_language(DW_LANG_C)
DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("F_GETSTATUS"), DW_AT_type(*DW$T$41)
	.dwattr DW$T$42, DW_AT_language(DW_LANG_C)

DW$T$56	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$52)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$56, DW_AT_byte_size(0x14)
DW$783	.dwtag  DW_TAG_subrange_type
	.dwattr DW$783, DW_AT_upper_bound(0x13)
	.dwendtag DW$T$56


DW$T$65	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$63)
	.dwattr DW$T$65, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$65, DW_AT_byte_size(0x180)
DW$784	.dwtag  DW_TAG_subrange_type
	.dwattr DW$784, DW_AT_upper_bound(0x1f)
	.dwendtag DW$T$65

DW$T$28	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
	.dwattr DW$T$28, DW_AT_address_class(0x16)
DW$T$31	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
	.dwattr DW$T$31, DW_AT_address_class(0x16)
DW$T$38	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
	.dwattr DW$T$38, DW_AT_address_class(0x16)
DW$T$44	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
	.dwattr DW$T$44, DW_AT_address_class(0x16)
DW$T$41	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$41, DW_AT_address_class(0x16)

DW$T$27	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)
DW$785	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$786	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
DW$787	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$27


DW$T$30	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$30, DW_AT_language(DW_LANG_C)
DW$788	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$789	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
DW$790	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$791	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$30


DW$T$37	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$37, DW_AT_language(DW_LANG_C)
DW$792	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
DW$793	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$37


DW$T$43	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$43, DW_AT_language(DW_LANG_C)
DW$794	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$43


DW$T$40	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$40, DW_AT_language(DW_LANG_C)
DW$795	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$40


	.dwattr DW$242, DW_AT_external(0x01)
	.dwattr DW$242, DW_AT_type(*DW$T$10)
	.dwattr DW$395, DW_AT_external(0x01)
	.dwattr DW$395, DW_AT_type(*DW$T$108)
	.dwattr DW$276, DW_AT_external(0x01)
	.dwattr DW$276, DW_AT_type(*DW$T$10)
	.dwattr DW$285, DW_AT_external(0x01)
	.dwattr DW$285, DW_AT_type(*DW$T$10)
	.dwattr DW$57, DW_AT_external(0x01)
	.dwattr DW$57, DW_AT_type(*DW$T$10)
	.dwattr DW$177, DW_AT_external(0x01)
	.dwattr DW$261, DW_AT_external(0x01)
	.dwattr DW$261, DW_AT_type(*DW$T$10)
	.dwattr DW$351, DW_AT_external(0x01)
	.dwattr DW$351, DW_AT_type(*DW$T$10)
	.dwattr DW$322, DW_AT_external(0x01)
