;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Thu Aug 18 12:16:13 2016                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("fat.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy"), DW_AT_symbol_name("_memcpy")
	.dwattr DW$1, DW_AT_type(*DW$T$3)
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$3	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$84)
DW$4	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$1


DW$5	.dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
	.dwattr DW$5, DW_AT_type(*DW$T$3)
	.dwattr DW$5, DW_AT_declaration(0x01)
	.dwattr DW$5, DW_AT_external(0x01)
DW$6	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$7	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$8	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$86)
	.dwendtag DW$5



DW$682	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
	.dwendtag DW$T$176

DW$T$12	.dwtag  DW_TAG_base_type, DW_AT_name("long")
	.dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$12, DW_AT_byte_size(0x02)

DW$T$211	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$211, DW_AT_language(DW_LANG_C)
DW$683	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$117)
DW$684	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$84)
DW$685	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$686	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$687	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$210)
	.dwendtag DW$T$211


DW$T$213	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$213, DW_AT_language(DW_LANG_C)
DW$688	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$59)
DW$689	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$59)
	.dwendtag DW$T$213


DW$T$215	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$215, DW_AT_language(DW_LANG_C)
DW$690	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$117)
DW$691	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
	.dwendtag DW$T$215

DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$T$23	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$23, DW_AT_address_class(0x16)
DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$86, DW_AT_language(DW_LANG_C)

DW$T$216	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$216, DW_AT_language(DW_LANG_C)
DW$692	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$89)
DW$693	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$93)
	.dwendtag DW$T$216


DW$T$218	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$218, DW_AT_language(DW_LANG_C)
DW$694	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$218

DW$T$59	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$59, DW_AT_address_class(0x16)
DW$T$146	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$145)
	.dwattr DW$T$146, DW_AT_address_class(0x16)

DW$T$223	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$223, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$223, DW_AT_byte_size(0x200)
DW$695	.dwtag  DW_TAG_subrange_type
	.dwattr DW$695, DW_AT_upper_bound(0x1ff)
	.dwendtag DW$T$223

DW$T$117	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$116)
	.dwattr DW$T$117, DW_AT_address_class(0x16)
DW$T$210	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$69)
	.dwattr DW$T$210, DW_AT_address_class(0x16)

DW$T$231	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$210)
	.dwattr DW$T$231, DW_AT_language(DW_LANG_C)
DW$696	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$117)
DW$697	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
DW$698	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
	.dwendtag DW$T$231


DW$T$232	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$210)
	.dwattr DW$T$232, DW_AT_language(DW_LANG_C)
DW$699	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$117)
DW$700	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
DW$701	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$T$232

DW$T$89	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$78)
	.dwattr DW$T$89, DW_AT_address_class(0x16)
DW$T$126	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$126, DW_AT_address_class(0x16)
DW$T$66	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$65)
	.dwattr DW$T$66, DW_AT_address_class(0x16)
DW$T$93	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$92)
	.dwattr DW$T$93, DW_AT_address_class(0x16)
DW$T$152	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$93)
	.dwattr DW$T$152, DW_AT_address_class(0x16)
DW$T$100	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$80)
	.dwattr DW$T$100, DW_AT_address_class(0x16)

DW$T$252	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$100)
	.dwattr DW$T$252, DW_AT_language(DW_LANG_C)
DW$T$149	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
	.dwattr DW$T$149, DW_AT_address_class(0x16)
DW$T$163	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$162)
	.dwattr DW$T$163, DW_AT_address_class(0x16)
DW$T$264	.dwtag  DW_TAG_typedef, DW_AT_name("F_FILESYSTEM"), DW_AT_type(*DW$T$82)
	.dwattr DW$T$264, DW_AT_language(DW_LANG_C)
DW$702	.dwtag  DW_TAG_far_type
DW$T$83	.dwtag  DW_TAG_const_type
	.dwattr DW$T$83, DW_AT_type(*DW$702)
DW$T$19	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$19, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$19, DW_AT_byte_size(0x01)
DW$703	.dwtag  DW_TAG_far_type
	.dwattr DW$703, DW_AT_type(*DW$T$19)
DW$T$145	.dwtag  DW_TAG_const_type
	.dwattr DW$T$145, DW_AT_type(*DW$703)
DW$T$116	.dwtag  DW_TAG_typedef, DW_AT_name("F_MULTI"), DW_AT_type(*DW$T$24)
	.dwattr DW$T$116, DW_AT_language(DW_LANG_C)
DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("F_FILE"), DW_AT_type(*DW$T$25)
	.dwattr DW$T$69, DW_AT_language(DW_LANG_C)
DW$T$78	.dwtag  DW_TAG_typedef, DW_AT_name("F_VOLUME"), DW_AT_type(*DW$T$61)
	.dwattr DW$T$78, DW_AT_language(DW_LANG_C)
DW$T$65	.dwtag  DW_TAG_typedef, DW_AT_name("F_POS"), DW_AT_type(*DW$T$62)
	.dwattr DW$T$65, DW_AT_language(DW_LANG_C)
DW$T$92	.dwtag  DW_TAG_typedef, DW_AT_name("F_DIRENTRY"), DW_AT_type(*DW$T$64)
	.dwattr DW$T$92, DW_AT_language(DW_LANG_C)
DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("F_FILEINT"), DW_AT_type(*DW$T$72)
	.dwattr DW$T$80, DW_AT_language(DW_LANG_C)
DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("F_NAME"), DW_AT_type(*DW$T$75)
	.dwattr DW$T$76, DW_AT_language(DW_LANG_C)
DW$T$162	.dwtag  DW_TAG_typedef, DW_AT_name("F_FIND"), DW_AT_type(*DW$T$77)
	.dwattr DW$T$162, DW_AT_language(DW_LANG_C)

DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$82, DW_AT_byte_size(0xa4a)
DW$704	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
	.dwattr DW$704, DW_AT_name("volumes"), DW_AT_symbol_name("_volumes")
	.dwattr DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$704, DW_AT_accessibility(DW_ACCESS_public)
DW$705	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
	.dwattr DW$705, DW_AT_name("files"), DW_AT_symbol_name("_files")
	.dwattr DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x47c]
	.dwattr DW$705, DW_AT_accessibility(DW_ACCESS_public)
DW$706	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
	.dwattr DW$706, DW_AT_name("sectorbuffer"), DW_AT_symbol_name("_sectorbuffer")
	.dwattr DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x84a]
	.dwattr DW$706, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$82


DW$T$57	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$57, DW_AT_byte_size(0x200)
DW$707	.dwtag  DW_TAG_subrange_type
	.dwattr DW$707, DW_AT_upper_bound(0x1ff)
	.dwendtag DW$T$57


DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$24, DW_AT_byte_size(0x1a)
DW$708	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$708, DW_AT_name("ID"), DW_AT_symbol_name("_ID")
	.dwattr DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$708, DW_AT_accessibility(DW_ACCESS_public)
DW$709	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$709, DW_AT_name("f_curdrive"), DW_AT_symbol_name("_f_curdrive")
	.dwattr DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$709, DW_AT_accessibility(DW_ACCESS_public)
DW$710	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$710, DW_AT_name("f_vols"), DW_AT_symbol_name("_f_vols")
	.dwattr DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$710, DW_AT_accessibility(DW_ACCESS_public)
DW$711	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$711, DW_AT_name("pmutex"), DW_AT_symbol_name("_pmutex")
	.dwattr DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$711, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$24


DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$25, DW_AT_byte_size(0x02)
DW$712	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$712, DW_AT_name("reference"), DW_AT_symbol_name("_reference")
	.dwattr DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$712, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$25


DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$61, DW_AT_byte_size(0x47c)
DW$713	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$713, DW_AT_name("state"), DW_AT_symbol_name("_state")
	.dwattr DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$713, DW_AT_accessibility(DW_ACCESS_public)
DW$714	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
	.dwattr DW$714, DW_AT_name("bootrecord"), DW_AT_symbol_name("_bootrecord")
	.dwattr DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$714, DW_AT_accessibility(DW_ACCESS_public)
DW$715	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$715, DW_AT_name("firstfat"), DW_AT_symbol_name("_firstfat")
	.dwattr DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr DW$715, DW_AT_accessibility(DW_ACCESS_public)
DW$716	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$716, DW_AT_name("root"), DW_AT_symbol_name("_root")
	.dwattr DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr DW$716, DW_AT_accessibility(DW_ACCESS_public)
DW$717	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$717, DW_AT_name("data"), DW_AT_symbol_name("_data")
	.dwattr DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr DW$717, DW_AT_accessibility(DW_ACCESS_public)
DW$718	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
	.dwattr DW$718, DW_AT_name("fat"), DW_AT_symbol_name("_fat")
	.dwattr DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr DW$718, DW_AT_accessibility(DW_ACCESS_public)
DW$719	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$719, DW_AT_name("fatsector"), DW_AT_symbol_name("_fatsector")
	.dwattr DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x256]
	.dwattr DW$719, DW_AT_accessibility(DW_ACCESS_public)
DW$720	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$720, DW_AT_name("fatmodified"), DW_AT_symbol_name("_fatmodified")
	.dwattr DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x258]
	.dwattr DW$720, DW_AT_accessibility(DW_ACCESS_public)
DW$721	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
	.dwattr DW$721, DW_AT_name("direntry"), DW_AT_symbol_name("_direntry")
	.dwattr DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x25a]
	.dwattr DW$721, DW_AT_accessibility(DW_ACCESS_public)
DW$722	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$722, DW_AT_name("direntrysector"), DW_AT_symbol_name("_direntrysector")
	.dwattr DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x45a]
	.dwattr DW$722, DW_AT_accessibility(DW_ACCESS_public)
DW$723	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$723, DW_AT_name("lastalloccluster"), DW_AT_symbol_name("_lastalloccluster")
	.dwattr DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x45c]
	.dwattr DW$723, DW_AT_accessibility(DW_ACCESS_public)
DW$724	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
	.dwattr DW$724, DW_AT_name("func"), DW_AT_symbol_name("_func")
	.dwattr DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x45e]
	.dwattr DW$724, DW_AT_accessibility(DW_ACCESS_public)
DW$725	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$725, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
	.dwattr DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
	.dwattr DW$725, DW_AT_accessibility(DW_ACCESS_public)
DW$726	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$726, DW_AT_name("mediatype"), DW_AT_symbol_name("_mediatype")
	.dwattr DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x470]
	.dwattr DW$726, DW_AT_accessibility(DW_ACCESS_public)
DW$727	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
	.dwattr DW$727, DW_AT_name("clspace"), DW_AT_symbol_name("_clspace")
	.dwattr DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x472]
	.dwattr DW$727, DW_AT_accessibility(DW_ACCESS_public)
DW$728	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$728, DW_AT_name("cspaceok"), DW_AT_symbol_name("_cspaceok")
	.dwattr DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x478]
	.dwattr DW$728, DW_AT_accessibility(DW_ACCESS_public)
DW$729	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$729, DW_AT_name("mutex"), DW_AT_symbol_name("_mutex")
	.dwattr DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x47a]
	.dwattr DW$729, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$61


DW$T$79	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$78)
	.dwattr DW$T$79, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$79, DW_AT_byte_size(0x47c)
DW$730	.dwtag  DW_TAG_subrange_type
	.dwattr DW$730, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$79


DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$62, DW_AT_byte_size(0x0c)
DW$731	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$731, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
	.dwattr DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$731, DW_AT_accessibility(DW_ACCESS_public)
DW$732	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$732, DW_AT_name("prevcluster"), DW_AT_symbol_name("_prevcluster")
	.dwattr DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$732, DW_AT_accessibility(DW_ACCESS_public)
DW$733	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$733, DW_AT_name("sectorbegin"), DW_AT_symbol_name("_sectorbegin")
	.dwattr DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$733, DW_AT_accessibility(DW_ACCESS_public)
DW$734	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$734, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
	.dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
DW$735	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$735, DW_AT_name("sectorend"), DW_AT_symbol_name("_sectorend")
	.dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
DW$736	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$736, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$62


DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$64, DW_AT_byte_size(0x20)
DW$737	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$737, DW_AT_name("name"), DW_AT_symbol_name("_name")
	.dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
DW$738	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$738, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
	.dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
DW$739	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$739, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
	.dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
DW$740	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$740, DW_AT_name("ntres"), DW_AT_symbol_name("_ntres")
	.dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
DW$741	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$741, DW_AT_name("crttimetenth"), DW_AT_symbol_name("_crttimetenth")
	.dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
DW$742	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$742, DW_AT_name("crttime"), DW_AT_symbol_name("_crttime")
	.dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
DW$743	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$743, DW_AT_name("crtdate"), DW_AT_symbol_name("_crtdate")
	.dwattr DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$743, DW_AT_accessibility(DW_ACCESS_public)
DW$744	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$744, DW_AT_name("lastaccessdate"), DW_AT_symbol_name("_lastaccessdate")
	.dwattr DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$744, DW_AT_accessibility(DW_ACCESS_public)
DW$745	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$745, DW_AT_name("clusterhi"), DW_AT_symbol_name("_clusterhi")
	.dwattr DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$745, DW_AT_accessibility(DW_ACCESS_public)
DW$746	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$746, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
	.dwattr DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$746, DW_AT_accessibility(DW_ACCESS_public)
DW$747	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$747, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
	.dwattr DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$747, DW_AT_accessibility(DW_ACCESS_public)
DW$748	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$748, DW_AT_name("clusterlo"), DW_AT_symbol_name("_clusterlo")
	.dwattr DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$748, DW_AT_accessibility(DW_ACCESS_public)
DW$749	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
	.dwattr DW$749, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
	.dwattr DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$749, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$64


DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$72, DW_AT_byte_size(0x3ce)
DW$750	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$750, DW_AT_name("file"), DW_AT_symbol_name("_file")
	.dwattr DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$750, DW_AT_accessibility(DW_ACCESS_public)
DW$751	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$751, DW_AT_name("modified"), DW_AT_symbol_name("_modified")
	.dwattr DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$751, DW_AT_accessibility(DW_ACCESS_public)
DW$752	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$752, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
	.dwattr DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$752, DW_AT_accessibility(DW_ACCESS_public)
DW$753	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$753, DW_AT_name("drivenum"), DW_AT_symbol_name("_drivenum")
	.dwattr DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$753, DW_AT_accessibility(DW_ACCESS_public)
DW$754	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$754, DW_AT_name("abspos"), DW_AT_symbol_name("_abspos")
	.dwattr DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$754, DW_AT_accessibility(DW_ACCESS_public)
DW$755	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$755, DW_AT_name("relpos"), DW_AT_symbol_name("_relpos")
	.dwattr DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$755, DW_AT_accessibility(DW_ACCESS_public)
DW$756	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$756, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
	.dwattr DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$756, DW_AT_accessibility(DW_ACCESS_public)
DW$757	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
	.dwattr DW$757, DW_AT_name("data"), DW_AT_symbol_name("_data")
	.dwattr DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$757, DW_AT_accessibility(DW_ACCESS_public)
DW$758	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$758, DW_AT_name("WrDataCache"), DW_AT_symbol_name("_WrDataCache")
	.dwattr DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
	.dwattr DW$758, DW_AT_accessibility(DW_ACCESS_public)
DW$759	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$759, DW_AT_name("startcluster"), DW_AT_symbol_name("_startcluster")
	.dwattr DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x392]
	.dwattr DW$759, DW_AT_accessibility(DW_ACCESS_public)
DW$760	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
	.dwattr DW$760, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x394]
	.dwattr DW$760, DW_AT_accessibility(DW_ACCESS_public)
DW$761	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
	.dwattr DW$761, DW_AT_name("dirpos"), DW_AT_symbol_name("_dirpos")
	.dwattr DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a0]
	.dwattr DW$761, DW_AT_accessibility(DW_ACCESS_public)
DW$762	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
	.dwattr DW$762, DW_AT_name("seekpos"), DW_AT_symbol_name("_seekpos")
	.dwattr DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x3ac]
	.dwattr DW$762, DW_AT_accessibility(DW_ACCESS_public)
DW$763	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
	.dwattr DW$763, DW_AT_name("seekprev"), DW_AT_symbol_name("_seekprev")
	.dwattr DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x3bc]
	.dwattr DW$763, DW_AT_accessibility(DW_ACCESS_public)
DW$764	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$764, DW_AT_name("seekshift"), DW_AT_symbol_name("_seekshift")
	.dwattr DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x3cc]
	.dwattr DW$764, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$72


DW$T$81	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$80)
	.dwattr DW$T$81, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$81, DW_AT_byte_size(0x3ce)
DW$765	.dwtag  DW_TAG_subrange_type
	.dwattr DW$765, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$81


DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$75, DW_AT_byte_size(0x20)
DW$766	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$766, DW_AT_name("drivenum"), DW_AT_symbol_name("_drivenum")
	.dwattr DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$766, DW_AT_accessibility(DW_ACCESS_public)
DW$767	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$767, DW_AT_name("path"), DW_AT_symbol_name("_path")
	.dwattr DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$767, DW_AT_accessibility(DW_ACCESS_public)
DW$768	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
	.dwattr DW$768, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
	.dwattr DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$768, DW_AT_accessibility(DW_ACCESS_public)
DW$769	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
	.dwattr DW$769, DW_AT_name("fileext"), DW_AT_symbol_name("_fileext")
	.dwattr DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$769, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$75


DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$77, DW_AT_byte_size(0x52)
DW$770	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$770, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
	.dwattr DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$770, DW_AT_accessibility(DW_ACCESS_public)
DW$771	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
	.dwattr DW$771, DW_AT_name("name"), DW_AT_symbol_name("_name")
	.dwattr DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$771, DW_AT_accessibility(DW_ACCESS_public)
DW$772	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
	.dwattr DW$772, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
	.dwattr DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$772, DW_AT_accessibility(DW_ACCESS_public)
DW$773	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$773, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
	.dwattr DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$773, DW_AT_accessibility(DW_ACCESS_public)
DW$774	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$774, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
	.dwattr DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$774, DW_AT_accessibility(DW_ACCESS_public)
DW$775	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$775, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
	.dwattr DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$775, DW_AT_accessibility(DW_ACCESS_public)
DW$776	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$776, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
	.dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
DW$777	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$777, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
	.dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
DW$778	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
	.dwattr DW$778, DW_AT_name("findfsname"), DW_AT_symbol_name("_findfsname")
	.dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
DW$779	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
	.dwattr DW$779, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$77


DW$T$26	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$26, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$26, DW_AT_byte_size(0x03)
DW$780	.dwtag  DW_TAG_subrange_type
	.dwattr DW$780, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$26


DW$T$27	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$27, DW_AT_byte_size(0x08)
DW$781	.dwtag  DW_TAG_subrange_type
	.dwattr DW$781, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$27


DW$T$30	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$30, DW_AT_byte_size(0x02)
DW$782	.dwtag  DW_TAG_subrange_type
	.dwattr DW$782, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$30


DW$T$63	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$63, DW_AT_byte_size(0x04)
DW$783	.dwtag  DW_TAG_subrange_type
	.dwattr DW$783, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$63


DW$T$71	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$71, DW_AT_byte_size(0x10)
DW$784	.dwtag  DW_TAG_subrange_type
	.dwattr DW$784, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$71


DW$T$20	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$20, DW_AT_byte_size(0x14)
DW$785	.dwtag  DW_TAG_subrange_type
	.dwattr DW$785, DW_AT_upper_bound(0x13)
	.dwendtag DW$T$20


DW$T$73	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$73, DW_AT_byte_size(0x08)
DW$786	.dwtag  DW_TAG_subrange_type
	.dwattr DW$786, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$73


DW$T$74	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$74, DW_AT_byte_size(0x03)
DW$787	.dwtag  DW_TAG_subrange_type
	.dwattr DW$787, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$74


DW$T$22	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$21)
	.dwattr DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$22, DW_AT_byte_size(0x14)
DW$788	.dwtag  DW_TAG_subrange_type
	.dwattr DW$788, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$22

DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("F_BOOTRECORD"), DW_AT_type(*DW$T$31)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("F_SECTOR"), DW_AT_type(*DW$T$32)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)
DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$53)
	.dwattr DW$T$58, DW_AT_language(DW_LANG_C)
DW$T$60	.dwtag  DW_TAG_typedef, DW_AT_name("F_CLSPACE"), DW_AT_type(*DW$T$54)
	.dwattr DW$T$60, DW_AT_language(DW_LANG_C)
DW$T$70	.dwtag  DW_TAG_typedef, DW_AT_name("t_WrDataCache"), DW_AT_type(*DW$T$68)
	.dwattr DW$T$70, DW_AT_language(DW_LANG_C)

DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$21, DW_AT_byte_size(0x14)
DW$789	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$789, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
	.dwattr DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$789, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$21


DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$31, DW_AT_byte_size(0x48)
DW$790	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$790, DW_AT_name("jump_code"), DW_AT_symbol_name("_jump_code")
	.dwattr DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$790, DW_AT_accessibility(DW_ACCESS_public)
DW$791	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$791, DW_AT_name("OEM_name"), DW_AT_symbol_name("_OEM_name")
	.dwattr DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$791, DW_AT_accessibility(DW_ACCESS_public)
DW$792	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$792, DW_AT_name("bytes_per_sector"), DW_AT_symbol_name("_bytes_per_sector")
	.dwattr DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$792, DW_AT_accessibility(DW_ACCESS_public)
DW$793	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$793, DW_AT_name("sector_per_cluster"), DW_AT_symbol_name("_sector_per_cluster")
	.dwattr DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$793, DW_AT_accessibility(DW_ACCESS_public)
DW$794	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$794, DW_AT_name("reserved_sectors"), DW_AT_symbol_name("_reserved_sectors")
	.dwattr DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$794, DW_AT_accessibility(DW_ACCESS_public)
DW$795	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$795, DW_AT_name("number_of_FATs"), DW_AT_symbol_name("_number_of_FATs")
	.dwattr DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$795, DW_AT_accessibility(DW_ACCESS_public)
DW$796	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$796, DW_AT_name("max_root_entry"), DW_AT_symbol_name("_max_root_entry")
	.dwattr DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$796, DW_AT_accessibility(DW_ACCESS_public)
DW$797	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$797, DW_AT_name("number_of_sectors_less32"), DW_AT_symbol_name("_number_of_sectors_less32")
	.dwattr DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$797, DW_AT_accessibility(DW_ACCESS_public)
DW$798	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$798, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
	.dwattr DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$798, DW_AT_accessibility(DW_ACCESS_public)
DW$799	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$799, DW_AT_name("sector_per_FAT"), DW_AT_symbol_name("_sector_per_FAT")
	.dwattr DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$799, DW_AT_accessibility(DW_ACCESS_public)
DW$800	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$800, DW_AT_name("sector_per_Track"), DW_AT_symbol_name("_sector_per_Track")
	.dwattr DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$800, DW_AT_accessibility(DW_ACCESS_public)
DW$801	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$801, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
	.dwattr DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$801, DW_AT_accessibility(DW_ACCESS_public)
DW$802	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$802, DW_AT_name("number_of_hidden_sectors"), DW_AT_symbol_name("_number_of_hidden_sectors")
	.dwattr DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$802, DW_AT_accessibility(DW_ACCESS_public)
DW$803	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$803, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
	.dwattr DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$803, DW_AT_accessibility(DW_ACCESS_public)
DW$804	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$804, DW_AT_name("sector_per_FAT32"), DW_AT_symbol_name("_sector_per_FAT32")
	.dwattr DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$804, DW_AT_accessibility(DW_ACCESS_public)
DW$805	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$805, DW_AT_name("extflags"), DW_AT_symbol_name("_extflags")
	.dwattr DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$805, DW_AT_accessibility(DW_ACCESS_public)
DW$806	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$806, DW_AT_name("fsversion"), DW_AT_symbol_name("_fsversion")
	.dwattr DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$806, DW_AT_accessibility(DW_ACCESS_public)
DW$807	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$807, DW_AT_name("rootcluster"), DW_AT_symbol_name("_rootcluster")
	.dwattr DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$807, DW_AT_accessibility(DW_ACCESS_public)
DW$808	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$808, DW_AT_name("fsinfo"), DW_AT_symbol_name("_fsinfo")
	.dwattr DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$808, DW_AT_accessibility(DW_ACCESS_public)
DW$809	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$809, DW_AT_name("bkbootsec"), DW_AT_symbol_name("_bkbootsec")
	.dwattr DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$809, DW_AT_accessibility(DW_ACCESS_public)
DW$810	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$810, DW_AT_name("reserved"), DW_AT_symbol_name("_reserved")
	.dwattr DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$810, DW_AT_accessibility(DW_ACCESS_public)
DW$811	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$811, DW_AT_name("logical_drive_num"), DW_AT_symbol_name("_logical_drive_num")
	.dwattr DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$811, DW_AT_accessibility(DW_ACCESS_public)
DW$812	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$812, DW_AT_name("extended_signature"), DW_AT_symbol_name("_extended_signature")
	.dwattr DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
	.dwattr DW$812, DW_AT_accessibility(DW_ACCESS_public)
DW$813	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$813, DW_AT_name("serial_number"), DW_AT_symbol_name("_serial_number")
	.dwattr DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$813, DW_AT_accessibility(DW_ACCESS_public)
DW$814	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$814, DW_AT_name("volume_name"), DW_AT_symbol_name("_volume_name")
	.dwattr DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$814, DW_AT_accessibility(DW_ACCESS_public)
DW$815	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$815, DW_AT_name("FAT_name"), DW_AT_symbol_name("_FAT_name")
	.dwattr DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr DW$815, DW_AT_accessibility(DW_ACCESS_public)
DW$816	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$816, DW_AT_name("executable_marker"), DW_AT_symbol_name("_executable_marker")
	.dwattr DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr DW$816, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$31


DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$32, DW_AT_byte_size(0x04)
DW$817	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$817, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
	.dwattr DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$817, DW_AT_accessibility(DW_ACCESS_public)
DW$818	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$818, DW_AT_name("num"), DW_AT_symbol_name("_num")
	.dwattr DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$818, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$32


DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$53, DW_AT_byte_size(0x10)
DW$819	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$819, DW_AT_name("writesector"), DW_AT_symbol_name("_writesector")
	.dwattr DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$819, DW_AT_accessibility(DW_ACCESS_public)
DW$820	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$820, DW_AT_name("writemultiplesector"), DW_AT_symbol_name("_writemultiplesector")
	.dwattr DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$820, DW_AT_accessibility(DW_ACCESS_public)
DW$821	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
	.dwattr DW$821, DW_AT_name("readsector"), DW_AT_symbol_name("_readsector")
	.dwattr DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$821, DW_AT_accessibility(DW_ACCESS_public)
DW$822	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$822, DW_AT_name("readmultiplesector"), DW_AT_symbol_name("_readmultiplesector")
	.dwattr DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$822, DW_AT_accessibility(DW_ACCESS_public)
DW$823	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
	.dwattr DW$823, DW_AT_name("getphy"), DW_AT_symbol_name("_getphy")
	.dwattr DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$823, DW_AT_accessibility(DW_ACCESS_public)
DW$824	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$824, DW_AT_name("getstatus"), DW_AT_symbol_name("_getstatus")
	.dwattr DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$824, DW_AT_accessibility(DW_ACCESS_public)
DW$825	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$825, DW_AT_name("delfunc"), DW_AT_symbol_name("_delfunc")
	.dwattr DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$825, DW_AT_accessibility(DW_ACCESS_public)
DW$826	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$826, DW_AT_name("user_ptr"), DW_AT_symbol_name("_user_ptr")
	.dwattr DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$826, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$53


DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$54, DW_AT_byte_size(0x06)
DW$827	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$827, DW_AT_name("clfree"), DW_AT_symbol_name("_clfree")
	.dwattr DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$827, DW_AT_accessibility(DW_ACCESS_public)
DW$828	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$828, DW_AT_name("clused"), DW_AT_symbol_name("_clused")
	.dwattr DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$828, DW_AT_accessibility(DW_ACCESS_public)
DW$829	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$829, DW_AT_name("clbad"), DW_AT_symbol_name("_clbad")
	.dwattr DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$829, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$54


DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$68, DW_AT_byte_size(0x186)
DW$830	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$830, DW_AT_name("N"), DW_AT_symbol_name("_N")
	.dwattr DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$830, DW_AT_accessibility(DW_ACCESS_public)
DW$831	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$831, DW_AT_name("ptr"), DW_AT_symbol_name("_ptr")
	.dwattr DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$831, DW_AT_accessibility(DW_ACCESS_public)
DW$832	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$832, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$832, DW_AT_accessibility(DW_ACCESS_public)
DW$833	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
	.dwattr DW$833, DW_AT_name("posbuf"), DW_AT_symbol_name("_posbuf")
	.dwattr DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$833, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$68


DW$T$28	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$28, DW_AT_byte_size(0x0c)
DW$834	.dwtag  DW_TAG_subrange_type
	.dwattr DW$834, DW_AT_upper_bound(0x0b)
	.dwendtag DW$T$28


DW$T$29	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$29, DW_AT_byte_size(0x0b)
DW$835	.dwtag  DW_TAG_subrange_type
	.dwattr DW$835, DW_AT_upper_bound(0x0a)
	.dwendtag DW$T$29

DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("F_WRITESECTOR"), DW_AT_type(*DW$T$35)
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)
DW$T$40	.dwtag  DW_TAG_typedef, DW_AT_name("F_READSECTOR"), DW_AT_type(*DW$T$35)
	.dwattr DW$T$40, DW_AT_language(DW_LANG_C)
DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("F_WRITEMULTIPLESECTOR"), DW_AT_type(*DW$T$38)
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
DW$T$41	.dwtag  DW_TAG_typedef, DW_AT_name("F_READMULTIPLESECTOR"), DW_AT_type(*DW$T$38)
	.dwattr DW$T$41, DW_AT_language(DW_LANG_C)
DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("F_GETPHY"), DW_AT_type(*DW$T$45)
	.dwattr DW$T$46, DW_AT_language(DW_LANG_C)
DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("F_DELFUNC"), DW_AT_type(*DW$T$51)
	.dwattr DW$T$52, DW_AT_language(DW_LANG_C)
DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("F_GETSTATUS"), DW_AT_type(*DW$T$48)
	.dwattr DW$T$49, DW_AT_language(DW_LANG_C)

DW$T$67	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$65)
	.dwattr DW$T$67, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$67, DW_AT_byte_size(0x180)
DW$836	.dwtag  DW_TAG_subrange_type
	.dwattr DW$836, DW_AT_upper_bound(0x1f)
	.dwendtag DW$T$67

DW$T$35	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$35, DW_AT_address_class(0x16)
DW$T$38	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
	.dwattr DW$T$38, DW_AT_address_class(0x16)
DW$T$45	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$44)
	.dwattr DW$T$45, DW_AT_address_class(0x16)
DW$T$51	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
	.dwattr DW$T$51, DW_AT_address_class(0x16)
DW$T$48	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
	.dwattr DW$T$48, DW_AT_address_class(0x16)

DW$T$34	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
DW$837	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$838	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
DW$839	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$34


DW$T$37	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$37, DW_AT_language(DW_LANG_C)
DW$840	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$841	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
DW$842	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$843	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$37


DW$T$44	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$44, DW_AT_language(DW_LANG_C)
DW$844	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
DW$845	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$44


DW$T$50	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
DW$846	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$50


DW$T$47	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
DW$847	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$47

DW$T$43	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
	.dwattr DW$T$43, DW_AT_address_class(0x16)
DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("F_PHY"), DW_AT_type(*DW$T$33)
	.dwattr DW$T$42, DW_AT_language(DW_LANG_C)

DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$33, DW_AT_byte_size(0x08)
DW$848	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$848, DW_AT_name("number_of_cylinders"), DW_AT_symbol_name("_number_of_cylinders")
	.dwattr DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$848, DW_AT_accessibility(DW_ACCESS_public)
DW$849	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$849, DW_AT_name("sector_per_track"), DW_AT_symbol_name("_sector_per_track")
	.dwattr DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$849, DW_AT_accessibility(DW_ACCESS_public)
DW$850	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$850, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
	.dwattr DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$850, DW_AT_accessibility(DW_ACCESS_public)
DW$851	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$851, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
	.dwattr DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$851, DW_AT_accessibility(DW_ACCESS_public)
DW$852	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$852, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
	.dwattr DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$852, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$33


	.dwattr DW$407, DW_AT_external(0x01)
	.dwattr DW$407, DW_AT_type(*DW$T$10)
	.dwattr DW$108, DW_AT_type(*DW$T$12)
	.dwattr DW$144, DW_AT_type(*DW$T$12)
	.dwattr DW$254, DW_AT_external(0x01)
	.dwattr DW$254, DW_AT_type(*DW$T$10)
	.dwattr DW$220, DW_AT_type(*DW$T$10)
	.dwattr DW$289, DW_AT_type(*DW$T$10)
	.dwattr DW$328, DW_AT_type(*DW$T$10)
	.dwattr DW$103, DW_AT_external(0x01)
	.dwattr DW$103, DW_AT_type(*DW$T$10)
	.dwattr DW$403, DW_AT_type(*DW$T$100)
	.dwattr DW$185, DW_AT_type(*DW$T$10)
	.dwattr DW$155, DW_AT_type(*DW$T$10)
	.dwattr DW$106, DW_AT_external(0x01)
	.dwattr DW$106, DW_AT_type(*DW$T$10)
	.dwattr DW$388, DW_AT_external(0x01)
	.dwattr DW$388, DW_AT_type(*DW$T$10)
	.dwattr DW$477, DW_AT_external(0x01)
	.dwattr DW$477, DW_AT_type(*DW$T$10)
	.dwattr DW$460, DW_AT_external(0x01)
	.dwattr DW$460, DW_AT_type(*DW$T$12)
	.dwattr DW$377, DW_AT_external(0x01)
	.dwattr DW$377, DW_AT_type(*DW$T$10)
	.dwattr DW$381, DW_AT_external(0x01)
	.dwattr DW$381, DW_AT_type(*DW$T$10)
	.dwattr DW$480, DW_AT_external(0x01)
	.dwattr DW$480, DW_AT_type(*DW$T$10)
	.dwattr DW$370, DW_AT_external(0x01)
	.dwattr DW$370, DW_AT_type(*DW$T$10)
	.dwattr DW$362, DW_AT_external(0x01)
	.dwattr DW$362, DW_AT_type(*DW$T$10)
	.dwattr DW$501, DW_AT_external(0x01)
	.dwattr DW$501, DW_AT_type(*DW$T$10)
	.dwattr DW$472, DW_AT_external(0x01)
	.dwattr DW$472, DW_AT_type(*DW$T$10)
	.dwattr DW$446, DW_AT_external(0x01)
	.dwattr DW$446, DW_AT_type(*DW$T$10)
	.dwattr DW$463, DW_AT_external(0x01)
	.dwattr DW$463, DW_AT_type(*DW$T$210)
	.dwattr DW$395, DW_AT_external(0x01)
	.dwattr DW$395, DW_AT_type(*DW$T$10)
	.dwattr DW$488, DW_AT_external(0x01)
	.dwattr DW$488, DW_AT_type(*DW$T$10)
	.dwattr DW$484, DW_AT_external(0x01)
	.dwattr DW$484, DW_AT_type(*DW$T$10)
	.dwattr DW$530, DW_AT_external(0x01)
	.dwattr DW$530, DW_AT_type(*DW$T$10)
	.dwattr DW$467, DW_AT_external(0x01)
	.dwattr DW$467, DW_AT_type(*DW$T$10)
	.dwattr DW$559, DW_AT_external(0x01)
	.dwattr DW$559, DW_AT_type(*DW$T$210)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$853	.dwtag  DW_TAG_assign_register, DW_AT_name("AL")
	.dwattr DW$853, DW_AT_location[DW_OP_reg0]
DW$854	.dwtag  DW_TAG_assign_register, DW_AT_name("AH")
	.dwattr DW$854, DW_AT_location[DW_OP_reg1]
DW$855	.dwtag  DW_TAG_assign_register, DW_AT_name("PL")
	.dwattr DW$855, DW_AT_location[DW_OP_reg2]
DW$856	.dwtag  DW_TAG_assign_register, DW_AT_name("PH")
	.dwattr DW$856, DW_AT_location[DW_OP_reg3]
DW$857	.dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
	.dwattr DW$857, DW_AT_location[DW_OP_reg4]
DW$858	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
	.dwattr DW$858, DW_AT_location[DW_OP_reg5]
DW$859	.dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
	.dwattr DW$859, DW_AT_location[DW_OP_reg6]
DW$860	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
	.dwattr DW$860, DW_AT_location[DW_OP_reg7]
DW$861	.dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
	.dwattr DW$861, DW_AT_location[DW_OP_reg8]
DW$862	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
	.dwattr DW$862, DW_AT_location[DW_OP_reg9]
DW$863	.dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
	.dwattr DW$863, DW_AT_location[DW_OP_reg10]
DW$864	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
	.dwattr DW$864, DW_AT_location[DW_OP_reg11]
DW$865	.dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
	.dwattr DW$865, DW_AT_location[DW_OP_reg12]
DW$866	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
	.dwattr DW$866, DW_AT_location[DW_OP_reg13]
DW$867	.dwtag  DW_TAG_assign_register, DW_AT_name("AR5")
	.dwattr DW$867, DW_AT_location[DW_OP_reg14]
