;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Thu Aug 18 12:16:15 2016                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("fat_m.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
	.dwattr DW$1, DW_AT_type(*DW$T$3)
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$3	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$4	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$55)
	.dwendtag DW$1


DW$5	.dwtag  DW_TAG_subprogram, DW_AT_name("fn_getversion"), DW_AT_symbol_name("_fn_getversion")
	.dwattr DW$5, DW_AT_type(*DW$T$95)
	.dwattr DW$5, DW_AT_declaration(0x01)
	.dwattr DW$5, DW_AT_external(0x01)

DW$6	.dwtag  DW_TAG_subprogram, DW_AT_name("fn_initvolume"), DW_AT_symbol_name("_fn_initvolume")
	.dwattr DW$6, DW_AT_type(*DW$T$10)
	.dwattr DW$6, DW_AT_declaration(0x01)
	.dwattr DW$6, DW_AT_external(0x01)

DW$T$168	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$168, DW_AT_language(DW_LANG_C)
DW$375	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$63)
DW$376	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$377	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$378	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$379	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$119)
	.dwendtag DW$T$168


DW$T$170	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$170, DW_AT_language(DW_LANG_C)
DW$380	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$63)
DW$381	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$60)
DW$382	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$383	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$384	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$119)
	.dwendtag DW$T$170


DW$T$172	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$172, DW_AT_language(DW_LANG_C)
DW$385	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$119)
	.dwendtag DW$T$172


DW$T$174	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$174, DW_AT_language(DW_LANG_C)
DW$386	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
	.dwendtag DW$T$174


DW$T$175	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$175, DW_AT_language(DW_LANG_C)
DW$387	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$388	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$389	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$390	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$119)
	.dwendtag DW$T$175


DW$T$176	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$176, DW_AT_language(DW_LANG_C)
DW$391	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$60)
DW$392	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$393	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
DW$394	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$119)
	.dwendtag DW$T$176

DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
DW$T$95	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$95, DW_AT_address_class(0x16)

DW$T$179	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$95)
	.dwattr DW$T$179, DW_AT_language(DW_LANG_C)
DW$T$107	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$106)
	.dwattr DW$T$107, DW_AT_address_class(0x16)
DW$T$63	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$62)
	.dwattr DW$T$63, DW_AT_address_class(0x16)
DW$T$140	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
	.dwattr DW$T$140, DW_AT_address_class(0x16)

DW$T$182	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$62)
	.dwattr DW$T$182, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$182, DW_AT_byte_size(0x1a)
DW$395	.dwtag  DW_TAG_subrange_type
	.dwattr DW$395, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$182

DW$T$103	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$102)
	.dwattr DW$T$103, DW_AT_address_class(0x16)
DW$T$111	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$110)
	.dwattr DW$T$111, DW_AT_address_class(0x16)
DW$T$119	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$118)
	.dwattr DW$T$119, DW_AT_address_class(0x16)

DW$T$192	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$119)
	.dwattr DW$T$192, DW_AT_language(DW_LANG_C)
DW$396	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$63)
DW$397	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
DW$398	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
	.dwendtag DW$T$192


DW$T$193	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$119)
	.dwattr DW$T$193, DW_AT_language(DW_LANG_C)
DW$399	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$63)
DW$400	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
DW$401	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$T$193


DW$T$194	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$119)
	.dwattr DW$T$194, DW_AT_language(DW_LANG_C)
DW$402	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
DW$403	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
	.dwendtag DW$T$194


DW$T$195	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$119)
	.dwattr DW$T$195, DW_AT_language(DW_LANG_C)
DW$404	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
DW$405	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$T$195

DW$406	.dwtag  DW_TAG_far_type
DW$T$59	.dwtag  DW_TAG_const_type
	.dwattr DW$T$59, DW_AT_type(*DW$406)
DW$T$79	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$78)
	.dwattr DW$T$79, DW_AT_address_class(0x16)
DW$T$19	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$19, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$19, DW_AT_byte_size(0x01)
DW$407	.dwtag  DW_TAG_far_type
	.dwattr DW$407, DW_AT_type(*DW$T$19)
DW$T$106	.dwtag  DW_TAG_const_type
	.dwattr DW$T$106, DW_AT_type(*DW$407)
DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("F_MULTI"), DW_AT_type(*DW$T$24)
	.dwattr DW$T$62, DW_AT_language(DW_LANG_C)
DW$T$102	.dwtag  DW_TAG_typedef, DW_AT_name("F_SPACE"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$102, DW_AT_language(DW_LANG_C)
DW$T$110	.dwtag  DW_TAG_typedef, DW_AT_name("F_FIND"), DW_AT_type(*DW$T$53)
	.dwattr DW$T$110, DW_AT_language(DW_LANG_C)
DW$T$118	.dwtag  DW_TAG_typedef, DW_AT_name("F_FILE"), DW_AT_type(*DW$T$54)
	.dwattr DW$T$118, DW_AT_language(DW_LANG_C)

DW$T$78	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$78, DW_AT_language(DW_LANG_C)
DW$408	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$77)
DW$409	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$78


DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$24, DW_AT_byte_size(0x1a)
DW$410	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$410, DW_AT_name("ID"), DW_AT_symbol_name("_ID")
	.dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
DW$411	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$411, DW_AT_name("f_curdrive"), DW_AT_symbol_name("_f_curdrive")
	.dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
DW$412	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$412, DW_AT_name("f_vols"), DW_AT_symbol_name("_f_vols")
	.dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
DW$413	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$413, DW_AT_name("pmutex"), DW_AT_symbol_name("_pmutex")
	.dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$24

DW$T$77	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
	.dwattr DW$T$77, DW_AT_address_class(0x16)

DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$46, DW_AT_byte_size(0x10)
DW$414	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$414, DW_AT_name("total"), DW_AT_symbol_name("_total")
	.dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
DW$415	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$415, DW_AT_name("free"), DW_AT_symbol_name("_free")
	.dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
DW$416	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$416, DW_AT_name("used"), DW_AT_symbol_name("_used")
	.dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
DW$417	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$417, DW_AT_name("bad"), DW_AT_symbol_name("_bad")
	.dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
DW$418	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$418, DW_AT_name("total_high"), DW_AT_symbol_name("_total_high")
	.dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
DW$419	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$419, DW_AT_name("free_high"), DW_AT_symbol_name("_free_high")
	.dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
DW$420	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$420, DW_AT_name("used_high"), DW_AT_symbol_name("_used_high")
	.dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
DW$421	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$421, DW_AT_name("bad_high"), DW_AT_symbol_name("_bad_high")
	.dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$46


DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$53, DW_AT_byte_size(0x52)
DW$422	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$422, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
	.dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
DW$423	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$423, DW_AT_name("name"), DW_AT_symbol_name("_name")
	.dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
DW$424	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$424, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
	.dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
DW$425	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$425, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
	.dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
DW$426	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$426, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
	.dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
DW$427	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$427, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
	.dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
DW$428	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$428, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
	.dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
DW$429	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$429, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
	.dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
DW$430	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$430, DW_AT_name("findfsname"), DW_AT_symbol_name("_findfsname")
	.dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
DW$431	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$431, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$53


DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$54, DW_AT_byte_size(0x02)
DW$432	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$432, DW_AT_name("reference"), DW_AT_symbol_name("_reference")
	.dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$54

DW$T$23	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$23, DW_AT_address_class(0x16)

DW$T$20	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$20, DW_AT_byte_size(0x14)
DW$433	.dwtag  DW_TAG_subrange_type
	.dwattr DW$433, DW_AT_upper_bound(0x13)
	.dwendtag DW$T$20


DW$T$47	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$47, DW_AT_byte_size(0x08)
DW$434	.dwtag  DW_TAG_subrange_type
	.dwattr DW$434, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$47


DW$T$48	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$48, DW_AT_byte_size(0x03)
DW$435	.dwtag  DW_TAG_subrange_type
	.dwattr DW$435, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$48


DW$T$22	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$21)
	.dwattr DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$22, DW_AT_byte_size(0x14)
DW$436	.dwtag  DW_TAG_subrange_type
	.dwattr DW$436, DW_AT_upper_bound(0x00)
	.dwendtag DW$T$22

DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$45)
	.dwattr DW$T$76, DW_AT_language(DW_LANG_C)
DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("F_NAME"), DW_AT_type(*DW$T$49)
	.dwattr DW$T$51, DW_AT_language(DW_LANG_C)
DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("F_POS"), DW_AT_type(*DW$T$50)
	.dwattr DW$T$52, DW_AT_language(DW_LANG_C)

DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$21, DW_AT_byte_size(0x14)
DW$437	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$437, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
	.dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$21


DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$45, DW_AT_byte_size(0x10)
DW$438	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$438, DW_AT_name("writesector"), DW_AT_symbol_name("_writesector")
	.dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
DW$439	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$439, DW_AT_name("writemultiplesector"), DW_AT_symbol_name("_writemultiplesector")
	.dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
DW$440	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$440, DW_AT_name("readsector"), DW_AT_symbol_name("_readsector")
	.dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
DW$441	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$441, DW_AT_name("readmultiplesector"), DW_AT_symbol_name("_readmultiplesector")
	.dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
DW$442	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$442, DW_AT_name("getphy"), DW_AT_symbol_name("_getphy")
	.dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
DW$443	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$443, DW_AT_name("getstatus"), DW_AT_symbol_name("_getstatus")
	.dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
DW$444	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$444, DW_AT_name("delfunc"), DW_AT_symbol_name("_delfunc")
	.dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
DW$445	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$445, DW_AT_name("user_ptr"), DW_AT_symbol_name("_user_ptr")
	.dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$45


DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$49, DW_AT_byte_size(0x20)
DW$446	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$446, DW_AT_name("drivenum"), DW_AT_symbol_name("_drivenum")
	.dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
DW$447	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$447, DW_AT_name("path"), DW_AT_symbol_name("_path")
	.dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
DW$448	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$448, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
	.dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
DW$449	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$449, DW_AT_name("fileext"), DW_AT_symbol_name("_fileext")
	.dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$49


DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$50, DW_AT_byte_size(0x0c)
DW$450	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$450, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
	.dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
DW$451	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$451, DW_AT_name("prevcluster"), DW_AT_symbol_name("_prevcluster")
	.dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
DW$452	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$452, DW_AT_name("sectorbegin"), DW_AT_symbol_name("_sectorbegin")
	.dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
DW$453	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$453, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
	.dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
DW$454	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$454, DW_AT_name("sectorend"), DW_AT_symbol_name("_sectorend")
	.dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
DW$455	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$455, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$50

DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("F_WRITESECTOR"), DW_AT_type(*DW$T$27)
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)
DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("F_READSECTOR"), DW_AT_type(*DW$T$27)
	.dwattr DW$T$32, DW_AT_language(DW_LANG_C)
DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("F_WRITEMULTIPLESECTOR"), DW_AT_type(*DW$T$30)
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)
DW$T$33	.dwtag  DW_TAG_typedef, DW_AT_name("F_READMULTIPLESECTOR"), DW_AT_type(*DW$T$30)
	.dwattr DW$T$33, DW_AT_language(DW_LANG_C)
DW$T$38	.dwtag  DW_TAG_typedef, DW_AT_name("F_GETPHY"), DW_AT_type(*DW$T$37)
	.dwattr DW$T$38, DW_AT_language(DW_LANG_C)
DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("F_DELFUNC"), DW_AT_type(*DW$T$43)
	.dwattr DW$T$44, DW_AT_language(DW_LANG_C)
DW$T$41	.dwtag  DW_TAG_typedef, DW_AT_name("F_GETSTATUS"), DW_AT_type(*DW$T$40)
	.dwattr DW$T$41, DW_AT_language(DW_LANG_C)
DW$T$27	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$27, DW_AT_address_class(0x16)
DW$T$30	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
	.dwattr DW$T$30, DW_AT_address_class(0x16)
DW$T$37	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
	.dwattr DW$T$37, DW_AT_address_class(0x16)
DW$T$43	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
	.dwattr DW$T$43, DW_AT_address_class(0x16)
DW$T$40	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$39)
	.dwattr DW$T$40, DW_AT_address_class(0x16)

DW$T$26	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$26, DW_AT_language(DW_LANG_C)
DW$456	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$457	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
DW$458	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$26


DW$T$29	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)
DW$459	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$460	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
DW$461	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$462	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$29


DW$T$36	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)
DW$463	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
DW$464	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$36


DW$T$42	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$42, DW_AT_language(DW_LANG_C)
DW$465	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$42


DW$T$39	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
DW$466	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$39

DW$T$35	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$35, DW_AT_address_class(0x16)
DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("F_PHY"), DW_AT_type(*DW$T$25)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)

DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$25, DW_AT_byte_size(0x08)
DW$467	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$467, DW_AT_name("number_of_cylinders"), DW_AT_symbol_name("_number_of_cylinders")
	.dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
DW$468	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$468, DW_AT_name("sector_per_track"), DW_AT_symbol_name("_sector_per_track")
	.dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
DW$469	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$469, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
	.dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
DW$470	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$470, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
	.dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
DW$471	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$471, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
	.dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$25


	.dwattr DW$187, DW_AT_external(0x01)
	.dwattr DW$187, DW_AT_type(*DW$T$10)
	.dwattr DW$181, DW_AT_external(0x01)
	.dwattr DW$181, DW_AT_type(*DW$T$10)
	.dwattr DW$161, DW_AT_external(0x01)
	.dwattr DW$161, DW_AT_type(*DW$T$10)
	.dwattr DW$203, DW_AT_external(0x01)
	.dwattr DW$203, DW_AT_type(*DW$T$10)
	.dwattr DW$243, DW_AT_external(0x01)
	.dwattr DW$243, DW_AT_type(*DW$T$10)
	.dwattr DW$163, DW_AT_external(0x01)
	.dwattr DW$163, DW_AT_type(*DW$T$10)
	.dwattr DW$233, DW_AT_external(0x01)
	.dwattr DW$233, DW_AT_type(*DW$T$10)
	.dwattr DW$201, DW_AT_external(0x01)
	.dwattr DW$201, DW_AT_type(*DW$T$12)
	.dwattr DW$193, DW_AT_external(0x01)
	.dwattr DW$193, DW_AT_type(*DW$T$10)
	.dwattr DW$196, DW_AT_external(0x01)
	.dwattr DW$196, DW_AT_type(*DW$T$10)
	.dwattr DW$205, DW_AT_external(0x01)
	.dwattr DW$205, DW_AT_type(*DW$T$10)
	.dwattr DW$171, DW_AT_external(0x01)
	.dwattr DW$171, DW_AT_type(*DW$T$10)
	.dwattr DW$261, DW_AT_external(0x01)
	.dwattr DW$261, DW_AT_type(*DW$T$10)
	.dwattr DW$165, DW_AT_external(0x01)
	.dwattr DW$165, DW_AT_type(*DW$T$10)
	.dwattr DW$166, DW_AT_external(0x01)
	.dwattr DW$166, DW_AT_type(*DW$T$10)
	.dwattr DW$245, DW_AT_external(0x01)
	.dwattr DW$245, DW_AT_type(*DW$T$10)
	.dwattr DW$226, DW_AT_external(0x01)
	.dwattr DW$226, DW_AT_type(*DW$T$10)
	.dwattr DW$174, DW_AT_external(0x01)
	.dwattr DW$174, DW_AT_type(*DW$T$10)
	.dwattr DW$177, DW_AT_external(0x01)
	.dwattr DW$177, DW_AT_type(*DW$T$10)
	.dwattr DW$183, DW_AT_external(0x01)
	.dwattr DW$183, DW_AT_type(*DW$T$10)
	.dwattr DW$184, DW_AT_external(0x01)
	.dwattr DW$184, DW_AT_type(*DW$T$10)
	.dwattr DW$251, DW_AT_external(0x01)
	.dwattr DW$251, DW_AT_type(*DW$T$10)
	.dwattr DW$235, DW_AT_external(0x01)
	.dwattr DW$235, DW_AT_type(*DW$T$10)
	.dwattr DW$156, DW_AT_external(0x01)
	.dwattr DW$156, DW_AT_type(*DW$T$95)
	.dwattr DW$168, DW_AT_external(0x01)
	.dwattr DW$168, DW_AT_type(*DW$T$10)
	.dwattr DW$157, DW_AT_external(0x01)
	.dwattr DW$157, DW_AT_type(*DW$T$10)
	.dwattr DW$189, DW_AT_external(0x01)
	.dwattr DW$189, DW_AT_type(*DW$T$10)
	.dwattr DW$207, DW_AT_external(0x01)
	.dwattr DW$207, DW_AT_type(*DW$T$119)
	.dwattr DW$228, DW_AT_external(0x01)
	.dwattr DW$228, DW_AT_type(*DW$T$10)
	.dwattr DW$210, DW_AT_external(0x01)
	.dwattr DW$210, DW_AT_type(*DW$T$12)
	.dwattr DW$198, DW_AT_external(0x01)
	.dwattr DW$198, DW_AT_type(*DW$T$10)
	.dwattr DW$231, DW_AT_external(0x01)
	.dwattr DW$231, DW_AT_type(*DW$T$10)
	.dwattr DW$191, DW_AT_external(0x01)
	.dwattr DW$191, DW_AT_type(*DW$T$10)
	.dwattr DW$220, DW_AT_external(0x01)
	.dwattr DW$220, DW_AT_type(*DW$T$10)
	.dwattr DW$248, DW_AT_external(0x01)
	.dwattr DW$248, DW_AT_type(*DW$T$10)
	.dwattr DW$265, DW_AT_external(0x01)
	.dwattr DW$265, DW_AT_type(*DW$T$10)
	.dwattr DW$255, DW_AT_external(0x01)
	.dwattr DW$255, DW_AT_type(*DW$T$10)
	.dwattr DW$239, DW_AT_external(0x01)
	.dwattr DW$239, DW_AT_type(*DW$T$10)
	.dwattr DW$224, DW_AT_external(0x01)
	.dwattr DW$224, DW_AT_type(*DW$T$12)
	.dwattr DW$258, DW_AT_external(0x01)
	.dwattr DW$258, DW_AT_type(*DW$T$119)
	.dwattr DW$215, DW_AT_external(0x01)
	.dwattr DW$215, DW_AT_type(*DW$T$12)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$472	.dwtag  DW_TAG_assign_register, DW_AT_name("AL")
	.dwattr DW$472, DW_AT_location[DW_OP_reg0]
DW$473	.dwtag  DW_TAG_assign_register, DW_AT_name("AH")
	.dwattr DW$473, DW_AT_location[DW_OP_reg1]
DW$474	.dwtag  DW_TAG_assign_register, DW_AT_name("PL")
	.dwattr DW$474, DW_AT_location[DW_OP_reg2]
DW$475	.dwtag  DW_TAG_assign_register, DW_AT_name("PH")
	.dwattr DW$475, DW_AT_location[DW_OP_reg3]
