;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Wed Sep 14 09:00:56 2016                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("man.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_iSensorInRepalceMode+0,32
	.field  	0,16			; _iSensorInRepalceMode @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_iSensorInResetMode+0,32
	.field  	0,16			; _iSensorInResetMode @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_iSensorInRepalceTimer+0,32
	.field  	0,16			; _iSensorInRepalceTimer @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_iSensorInRepalce+0,32
	.field  	100,16			; _iSensorInRepalce @ 0

	.sect	".cinit"
	.align	1
	.field  	-2,16
	.field  	_wFiveRevTime+0,32
	.field  	0,32			; _wFiveRevTime @ 0

	.sect	".cinit"

DW$T$138	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
	.dwattr DW$T$138, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$138, DW_AT_byte_size(0x38)
DW$627	.dwtag  DW_TAG_subrange_type
	.dwattr DW$627, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$138

DW$T$17	.dwtag  DW_TAG_base_type, DW_AT_name("double")
	.dwattr DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr DW$T$17, DW_AT_byte_size(0x02)

DW$T$143	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$17)
	.dwattr DW$T$143, DW_AT_language(DW_LANG_C)
DW$628	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$17)
	.dwendtag DW$T$143

DW$T$145	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$144)
	.dwattr DW$T$145, DW_AT_address_class(0x16)

DW$T$146	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$145)
	.dwattr DW$T$146, DW_AT_language(DW_LANG_C)
DW$629	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$146


DW$T$147	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$144)
	.dwattr DW$T$147, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$147, DW_AT_byte_size(0x1c)
DW$630	.dwtag  DW_TAG_subrange_type
	.dwattr DW$630, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$147


DW$T$153	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$152)
	.dwattr DW$T$153, DW_AT_language(DW_LANG_C)
DW$631	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$153


DW$T$158	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$157)
	.dwattr DW$T$158, DW_AT_language(DW_LANG_C)
DW$632	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$158

DW$T$161	.dwtag  DW_TAG_typedef, DW_AT_name("cppsettingsstruct"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$161, DW_AT_language(DW_LANG_C)
DW$T$162	.dwtag  DW_TAG_typedef, DW_AT_name("cppstruct"), DW_AT_type(*DW$T$23)
	.dwattr DW$T$162, DW_AT_language(DW_LANG_C)
DW$T$163	.dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$25)
	.dwattr DW$T$163, DW_AT_language(DW_LANG_C)
DW$T$164	.dwtag  DW_TAG_typedef, DW_AT_name("motionstruct"), DW_AT_type(*DW$T$27)
	.dwattr DW$T$164, DW_AT_language(DW_LANG_C)
DW$633	.dwtag  DW_TAG_far_type
	.dwattr DW$633, DW_AT_type(*DW$T$165)
DW$T$166	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$166, DW_AT_type(*DW$633)
DW$T$168	.dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$32)
	.dwattr DW$T$168, DW_AT_language(DW_LANG_C)

DW$T$172	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$171)
	.dwattr DW$T$172, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$172, DW_AT_byte_size(0x38)
DW$634	.dwtag  DW_TAG_subrange_type
	.dwattr DW$634, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$172

DW$T$175	.dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$42)
	.dwattr DW$T$175, DW_AT_language(DW_LANG_C)
DW$T$176	.dwtag  DW_TAG_typedef, DW_AT_name("calibrationstruct"), DW_AT_type(*DW$T$52)
	.dwattr DW$T$176, DW_AT_language(DW_LANG_C)
DW$T$178	.dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$53)
	.dwattr DW$T$178, DW_AT_language(DW_LANG_C)
DW$T$180	.dwtag  DW_TAG_typedef, DW_AT_name("alarmsstruct"), DW_AT_type(*DW$T$54)
	.dwattr DW$T$180, DW_AT_language(DW_LANG_C)
DW$T$104	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
	.dwattr DW$T$104, DW_AT_address_class(0x16)
DW$635	.dwtag  DW_TAG_far_type
	.dwattr DW$635, DW_AT_type(*DW$T$183)
DW$T$184	.dwtag  DW_TAG_const_type
	.dwattr DW$T$184, DW_AT_type(*DW$635)
DW$T$187	.dwtag  DW_TAG_typedef, DW_AT_name("slavecmdstruct"), DW_AT_type(*DW$T$59)
	.dwattr DW$T$187, DW_AT_language(DW_LANG_C)
DW$T$188	.dwtag  DW_TAG_typedef, DW_AT_name("mbupdatestruct"), DW_AT_type(*DW$T$60)
	.dwattr DW$T$188, DW_AT_language(DW_LANG_C)

DW$T$190	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$189)
	.dwattr DW$T$190, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$190, DW_AT_byte_size(0x1f8)
DW$636	.dwtag  DW_TAG_subrange_type
	.dwattr DW$636, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$190

DW$T$193	.dwtag  DW_TAG_typedef, DW_AT_name("functionstruct"), DW_AT_type(*DW$T$65)
	.dwattr DW$T$193, DW_AT_language(DW_LANG_C)
DW$T$194	.dwtag  DW_TAG_typedef, DW_AT_name("prewarnstruct"), DW_AT_type(*DW$T$66)
	.dwattr DW$T$194, DW_AT_language(DW_LANG_C)
DW$T$196	.dwtag  DW_TAG_typedef, DW_AT_name("enginestruct"), DW_AT_type(*DW$T$67)
	.dwattr DW$T$196, DW_AT_language(DW_LANG_C)
DW$T$198	.dwtag  DW_TAG_typedef, DW_AT_name("offsetstruct"), DW_AT_type(*DW$T$68)
	.dwattr DW$T$198, DW_AT_language(DW_LANG_C)

DW$T$201	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$200)
	.dwattr DW$T$201, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$201, DW_AT_byte_size(0x1c)
DW$637	.dwtag  DW_TAG_subrange_type
	.dwattr DW$637, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$201


DW$T$205	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$204)
	.dwattr DW$T$205, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$205, DW_AT_byte_size(0x118)
DW$638	.dwtag  DW_TAG_subrange_type
	.dwattr DW$638, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$205

DW$T$208	.dwtag  DW_TAG_typedef, DW_AT_name("damagemonstruct"), DW_AT_type(*DW$T$71)
	.dwattr DW$T$208, DW_AT_language(DW_LANG_C)
DW$T$210	.dwtag  DW_TAG_typedef, DW_AT_name("dynamicalarmsstruct"), DW_AT_type(*DW$T$72)
	.dwattr DW$T$210, DW_AT_language(DW_LANG_C)
DW$T$211	.dwtag  DW_TAG_typedef, DW_AT_name("damalarmsstruct"), DW_AT_type(*DW$T$73)
	.dwattr DW$T$211, DW_AT_language(DW_LANG_C)
DW$T$94	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$94, DW_AT_address_class(0x16)
DW$T$144	.dwtag  DW_TAG_typedef, DW_AT_name("status3struct"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$144, DW_AT_language(DW_LANG_C)
DW$T$152	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
	.dwattr DW$T$152, DW_AT_address_class(0x16)
DW$T$157	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$62)
	.dwattr DW$T$157, DW_AT_address_class(0x16)

DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_name("tag_cppsettingsstruct")
	.dwattr DW$T$22, DW_AT_byte_size(0x10)
DW$639	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$639, DW_AT_name("iCppEnable"), DW_AT_symbol_name("_iCppEnable")
	.dwattr DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$639, DW_AT_accessibility(DW_ACCESS_public)
DW$640	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$640, DW_AT_name("iCppLowLimit"), DW_AT_symbol_name("_iCppLowLimit")
	.dwattr DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$640, DW_AT_accessibility(DW_ACCESS_public)
DW$641	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$641, DW_AT_name("iCppHighLimit"), DW_AT_symbol_name("_iCppHighLimit")
	.dwattr DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$641, DW_AT_accessibility(DW_ACCESS_public)
DW$642	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$642, DW_AT_name("cppkvalue"), DW_AT_symbol_name("_cppkvalue")
	.dwattr DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$642, DW_AT_accessibility(DW_ACCESS_public)
DW$643	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$643, DW_AT_name("gammavalue"), DW_AT_symbol_name("_gammavalue")
	.dwattr DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$643, DW_AT_accessibility(DW_ACCESS_public)
DW$644	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$644, DW_AT_name("cpplevelx"), DW_AT_symbol_name("_cpplevelx")
	.dwattr DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$644, DW_AT_accessibility(DW_ACCESS_public)
DW$645	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$645, DW_AT_name("delatRpmPauseDelay"), DW_AT_symbol_name("_delatRpmPauseDelay")
	.dwattr DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$645, DW_AT_accessibility(DW_ACCESS_public)
DW$646	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$646, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
	.dwattr DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$646, DW_AT_accessibility(DW_ACCESS_public)
DW$647	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$647, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$647, DW_AT_accessibility(DW_ACCESS_public)
DW$648	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$648, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$648, DW_AT_accessibility(DW_ACCESS_public)
DW$649	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$649, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$649, DW_AT_accessibility(DW_ACCESS_public)
DW$650	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$650, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$650, DW_AT_accessibility(DW_ACCESS_public)
DW$651	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$651, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$651, DW_AT_accessibility(DW_ACCESS_public)
DW$652	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$652, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$652, DW_AT_accessibility(DW_ACCESS_public)
DW$653	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$653, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$653, DW_AT_accessibility(DW_ACCESS_public)
DW$654	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$654, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22


DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$23, DW_AT_name("tag_cppstruct")
	.dwattr DW$T$23, DW_AT_byte_size(0x06)
DW$655	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$655, DW_AT_name("iAtodValue"), DW_AT_symbol_name("_iAtodValue")
	.dwattr DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$655, DW_AT_accessibility(DW_ACCESS_public)
DW$656	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$656, DW_AT_name("fmAinput"), DW_AT_symbol_name("_fmAinput")
	.dwattr DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$656, DW_AT_accessibility(DW_ACCESS_public)
DW$657	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$657, DW_AT_name("fLoadPercent"), DW_AT_symbol_name("_fLoadPercent")
	.dwattr DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$23


DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$25, DW_AT_name("tag_settingsstruct")
	.dwattr DW$T$25, DW_AT_byte_size(0x24)
DW$658	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$658, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
	.dwattr DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$658, DW_AT_accessibility(DW_ACCESS_public)
DW$659	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$659, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
	.dwattr DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$659, DW_AT_accessibility(DW_ACCESS_public)
DW$660	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$660, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
	.dwattr DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$660, DW_AT_accessibility(DW_ACCESS_public)
DW$661	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$661, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
	.dwattr DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$661, DW_AT_accessibility(DW_ACCESS_public)
DW$662	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$662, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
	.dwattr DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$662, DW_AT_accessibility(DW_ACCESS_public)
DW$663	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$663, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
	.dwattr DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$663, DW_AT_accessibility(DW_ACCESS_public)
DW$664	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$664, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
	.dwattr DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$664, DW_AT_accessibility(DW_ACCESS_public)
DW$665	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$665, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
	.dwattr DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$665, DW_AT_accessibility(DW_ACCESS_public)
DW$666	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$666, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
	.dwattr DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$666, DW_AT_accessibility(DW_ACCESS_public)
DW$667	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$667, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
	.dwattr DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$667, DW_AT_accessibility(DW_ACCESS_public)
DW$668	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$668, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
	.dwattr DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$668, DW_AT_accessibility(DW_ACCESS_public)
DW$669	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$669, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
	.dwattr DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$669, DW_AT_accessibility(DW_ACCESS_public)
DW$670	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$670, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
	.dwattr DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$670, DW_AT_accessibility(DW_ACCESS_public)
DW$671	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$671, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$671, DW_AT_accessibility(DW_ACCESS_public)
DW$672	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$672, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
	.dwattr DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$672, DW_AT_accessibility(DW_ACCESS_public)
DW$673	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$673, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
	.dwattr DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$673, DW_AT_accessibility(DW_ACCESS_public)
DW$674	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$674, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
	.dwattr DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$674, DW_AT_accessibility(DW_ACCESS_public)
DW$675	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$675, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
	.dwattr DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$675, DW_AT_accessibility(DW_ACCESS_public)
DW$676	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$676, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
	.dwattr DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$676, DW_AT_accessibility(DW_ACCESS_public)
DW$677	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$677, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$677, DW_AT_accessibility(DW_ACCESS_public)
DW$678	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$678, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
	.dwattr DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$678, DW_AT_accessibility(DW_ACCESS_public)
DW$679	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$679, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$679, DW_AT_accessibility(DW_ACCESS_public)
DW$680	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$680, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
	.dwattr DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$680, DW_AT_accessibility(DW_ACCESS_public)
DW$681	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$681, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
	.dwattr DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$681, DW_AT_accessibility(DW_ACCESS_public)
DW$682	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$682, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$682, DW_AT_accessibility(DW_ACCESS_public)
DW$683	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$683, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$683, DW_AT_accessibility(DW_ACCESS_public)
DW$684	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$684, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$684, DW_AT_accessibility(DW_ACCESS_public)
DW$685	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$685, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$685, DW_AT_accessibility(DW_ACCESS_public)
DW$686	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$686, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$686, DW_AT_accessibility(DW_ACCESS_public)
DW$687	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$687, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
	.dwattr DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$687, DW_AT_accessibility(DW_ACCESS_public)
DW$688	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$688, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
	.dwattr DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$688, DW_AT_accessibility(DW_ACCESS_public)
DW$689	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$689, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
	.dwattr DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$689, DW_AT_accessibility(DW_ACCESS_public)
DW$690	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$690, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
	.dwattr DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$690, DW_AT_accessibility(DW_ACCESS_public)
DW$691	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$691, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
	.dwattr DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$691, DW_AT_accessibility(DW_ACCESS_public)
DW$692	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$692, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$692, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$25


DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$27, DW_AT_name("tag_motionstruct")
	.dwattr DW$T$27, DW_AT_byte_size(0x09)
DW$693	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$693, DW_AT_name("counter"), DW_AT_symbol_name("_counter")
	.dwattr DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$693, DW_AT_accessibility(DW_ACCESS_public)
DW$694	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$694, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
	.dwattr DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$694, DW_AT_accessibility(DW_ACCESS_public)
DW$695	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$695, DW_AT_name("order"), DW_AT_symbol_name("_order")
	.dwattr DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$695, DW_AT_accessibility(DW_ACCESS_public)
DW$696	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$696, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$696, DW_AT_accessibility(DW_ACCESS_public)
DW$697	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$697, DW_AT_name("forwardasternflagprev"), DW_AT_symbol_name("_forwardasternflagprev")
	.dwattr DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$697, DW_AT_accessibility(DW_ACCESS_public)
DW$698	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$698, DW_AT_name("recalnow"), DW_AT_symbol_name("_recalnow")
	.dwattr DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$698, DW_AT_accessibility(DW_ACCESS_public)
DW$699	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$699, DW_AT_name("calerror"), DW_AT_symbol_name("_calerror")
	.dwattr DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$699, DW_AT_accessibility(DW_ACCESS_public)
DW$700	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$700, DW_AT_name("recheckdir"), DW_AT_symbol_name("_recheckdir")
	.dwattr DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$700, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$27

DW$T$165	.dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$29)
	.dwattr DW$T$165, DW_AT_language(DW_LANG_C)

DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$32, DW_AT_name("tag_allsensorstruct")
	.dwattr DW$T$32, DW_AT_byte_size(0x2d)
DW$701	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$701, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
	.dwattr DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$701, DW_AT_accessibility(DW_ACCESS_public)
DW$702	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$702, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
	.dwattr DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$702, DW_AT_accessibility(DW_ACCESS_public)
DW$703	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$703, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
	.dwattr DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$703, DW_AT_accessibility(DW_ACCESS_public)
DW$704	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$704, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
	.dwattr DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$704, DW_AT_accessibility(DW_ACCESS_public)
DW$705	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$705, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
	.dwattr DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$705, DW_AT_accessibility(DW_ACCESS_public)
DW$706	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$706, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
	.dwattr DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$706, DW_AT_accessibility(DW_ACCESS_public)
DW$707	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$707, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
	.dwattr DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$707, DW_AT_accessibility(DW_ACCESS_public)
DW$708	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$708, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
	.dwattr DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$708, DW_AT_accessibility(DW_ACCESS_public)
DW$709	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$709, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
	.dwattr DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$709, DW_AT_accessibility(DW_ACCESS_public)
DW$710	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$710, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$710, DW_AT_accessibility(DW_ACCESS_public)
DW$711	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$711, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$711, DW_AT_accessibility(DW_ACCESS_public)
DW$712	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$712, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
	.dwattr DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$712, DW_AT_accessibility(DW_ACCESS_public)
DW$713	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$713, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
	.dwattr DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$713, DW_AT_accessibility(DW_ACCESS_public)
DW$714	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$714, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$714, DW_AT_accessibility(DW_ACCESS_public)
DW$715	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$715, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$715, DW_AT_accessibility(DW_ACCESS_public)
DW$716	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$716, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$716, DW_AT_accessibility(DW_ACCESS_public)
DW$717	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$717, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
	.dwattr DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$717, DW_AT_accessibility(DW_ACCESS_public)
DW$718	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$718, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
	.dwattr DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$718, DW_AT_accessibility(DW_ACCESS_public)
DW$719	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$719, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
	.dwattr DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$719, DW_AT_accessibility(DW_ACCESS_public)
DW$720	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$720, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
	.dwattr DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$720, DW_AT_accessibility(DW_ACCESS_public)
DW$721	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$721, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
	.dwattr DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$721, DW_AT_accessibility(DW_ACCESS_public)
DW$722	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$722, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
	.dwattr DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$722, DW_AT_accessibility(DW_ACCESS_public)
DW$723	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$723, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
	.dwattr DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$723, DW_AT_accessibility(DW_ACCESS_public)
DW$724	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$724, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
	.dwattr DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$724, DW_AT_accessibility(DW_ACCESS_public)
DW$725	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$725, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
	.dwattr DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr DW$725, DW_AT_accessibility(DW_ACCESS_public)
DW$726	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$726, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
	.dwattr DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$726, DW_AT_accessibility(DW_ACCESS_public)
DW$727	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$727, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
	.dwattr DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$727, DW_AT_accessibility(DW_ACCESS_public)
DW$728	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$728, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
	.dwattr DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$728, DW_AT_accessibility(DW_ACCESS_public)
DW$729	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$729, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
	.dwattr DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$729, DW_AT_accessibility(DW_ACCESS_public)
DW$730	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$730, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$730, DW_AT_accessibility(DW_ACCESS_public)
DW$731	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$731, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow")
	.dwattr DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$731, DW_AT_accessibility(DW_ACCESS_public)
DW$732	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$732, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHigh")
	.dwattr DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$732, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$32

DW$T$171	.dwtag  DW_TAG_typedef, DW_AT_name("cylinderstruct"), DW_AT_type(*DW$T$35)
	.dwattr DW$T$171, DW_AT_language(DW_LANG_C)

DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$42, DW_AT_name("tag_configstruct")
	.dwattr DW$T$42, DW_AT_byte_size(0x18)
DW$733	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$733, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
	.dwattr DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$733, DW_AT_accessibility(DW_ACCESS_public)
DW$734	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$734, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
	.dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
DW$735	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$735, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
	.dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
DW$736	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$736, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
	.dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
DW$737	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
	.dwattr DW$737, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
	.dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
DW$738	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$738, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
	.dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$42


DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$52, DW_AT_name("tag_calibrationstruct")
	.dwattr DW$T$52, DW_AT_byte_size(0x31a)
DW$739	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$739, DW_AT_name("rpmpoints"), DW_AT_symbol_name("_rpmpoints")
	.dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
DW$740	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$740, DW_AT_name("speedcalpoints"), DW_AT_symbol_name("_speedcalpoints")
	.dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
DW$741	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$741, DW_AT_name("roughnumpoints"), DW_AT_symbol_name("_roughnumpoints")
	.dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
DW$742	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
	.dwattr DW$742, DW_AT_name("numpoints"), DW_AT_symbol_name("_numpoints")
	.dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
DW$743	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$743, DW_AT_name("averagespeedacc"), DW_AT_symbol_name("_averagespeedacc")
	.dwattr DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr DW$743, DW_AT_accessibility(DW_ACCESS_public)
DW$744	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$744, DW_AT_name("averagevalacc"), DW_AT_symbol_name("_averagevalacc")
	.dwattr DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e2]
	.dwattr DW$744, DW_AT_accessibility(DW_ACCESS_public)
DW$745	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$745, DW_AT_name("validpoints"), DW_AT_symbol_name("_validpoints")
	.dwattr DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x28a]
	.dwattr DW$745, DW_AT_accessibility(DW_ACCESS_public)
DW$746	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$746, DW_AT_name("rpmatcal"), DW_AT_symbol_name("_rpmatcal")
	.dwattr DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x28b]
	.dwattr DW$746, DW_AT_accessibility(DW_ACCESS_public)
DW$747	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$747, DW_AT_name("manroughcalpts"), DW_AT_symbol_name("_manroughcalpts")
	.dwattr DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x28e]
	.dwattr DW$747, DW_AT_accessibility(DW_ACCESS_public)
DW$748	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$748, DW_AT_name("manroughmin"), DW_AT_symbol_name("_manroughmin")
	.dwattr DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e2]
	.dwattr DW$748, DW_AT_accessibility(DW_ACCESS_public)
DW$749	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$749, DW_AT_name("manroughmax"), DW_AT_symbol_name("_manroughmax")
	.dwattr DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2fe]
	.dwattr DW$749, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$52


DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$53, DW_AT_name("tag_speedcompstruct")
	.dwattr DW$T$53, DW_AT_byte_size(0x19)
DW$750	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$750, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
	.dwattr DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$750, DW_AT_accessibility(DW_ACCESS_public)
DW$751	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$751, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$751, DW_AT_accessibility(DW_ACCESS_public)
DW$752	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$752, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
	.dwattr DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$752, DW_AT_accessibility(DW_ACCESS_public)
DW$753	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$753, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
	.dwattr DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$753, DW_AT_accessibility(DW_ACCESS_public)
DW$754	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$754, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
	.dwattr DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$754, DW_AT_accessibility(DW_ACCESS_public)
DW$755	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$755, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
	.dwattr DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$755, DW_AT_accessibility(DW_ACCESS_public)
DW$756	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$756, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
	.dwattr DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$756, DW_AT_accessibility(DW_ACCESS_public)
DW$757	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$757, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
	.dwattr DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$757, DW_AT_accessibility(DW_ACCESS_public)
DW$758	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$758, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
	.dwattr DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$758, DW_AT_accessibility(DW_ACCESS_public)
DW$759	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$759, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
	.dwattr DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$759, DW_AT_accessibility(DW_ACCESS_public)
DW$760	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$760, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
	.dwattr DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$760, DW_AT_accessibility(DW_ACCESS_public)
DW$761	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$761, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$761, DW_AT_accessibility(DW_ACCESS_public)
DW$762	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$762, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$762, DW_AT_accessibility(DW_ACCESS_public)
DW$763	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$763, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$763, DW_AT_accessibility(DW_ACCESS_public)
DW$764	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$764, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$764, DW_AT_accessibility(DW_ACCESS_public)
DW$765	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$765, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$765, DW_AT_accessibility(DW_ACCESS_public)
DW$766	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$766, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$766, DW_AT_accessibility(DW_ACCESS_public)
DW$767	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$767, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$767, DW_AT_accessibility(DW_ACCESS_public)
DW$768	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$768, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$768, DW_AT_accessibility(DW_ACCESS_public)
DW$769	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$769, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$769, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$53


DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$54, DW_AT_name("tag_alarmsstruct")
	.dwattr DW$T$54, DW_AT_byte_size(0x01)
DW$770	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$770, DW_AT_name("slavefailure"), DW_AT_symbol_name("_slavefailure")
	.dwattr DW$770, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$770, DW_AT_accessibility(DW_ACCESS_public)
DW$771	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$771, DW_AT_name("slavefailurelatched"), DW_AT_symbol_name("_slavefailurelatched")
	.dwattr DW$771, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$771, DW_AT_accessibility(DW_ACCESS_public)
DW$772	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$772, DW_AT_name("framfailure"), DW_AT_symbol_name("_framfailure")
	.dwattr DW$772, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$772, DW_AT_accessibility(DW_ACCESS_public)
DW$773	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$773, DW_AT_name("framfailurelatched"), DW_AT_symbol_name("_framfailurelatched")
	.dwattr DW$773, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$773, DW_AT_accessibility(DW_ACCESS_public)
DW$774	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$774, DW_AT_name("pccommsfailure"), DW_AT_symbol_name("_pccommsfailure")
	.dwattr DW$774, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$774, DW_AT_accessibility(DW_ACCESS_public)
DW$775	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$775, DW_AT_name("pccommsfailurelatched"), DW_AT_symbol_name("_pccommsfailurelatched")
	.dwattr DW$775, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$775, DW_AT_accessibility(DW_ACCESS_public)
DW$776	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$776, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$776, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
DW$777	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$777, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$777, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
DW$778	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$778, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$778, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
DW$779	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$779, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
	.dwattr DW$779, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
DW$780	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$780, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
	.dwattr DW$780, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$780, DW_AT_accessibility(DW_ACCESS_public)
DW$781	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$781, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
	.dwattr DW$781, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$781, DW_AT_accessibility(DW_ACCESS_public)
DW$782	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$782, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$782, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$782, DW_AT_accessibility(DW_ACCESS_public)
DW$783	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$783, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$783, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$783, DW_AT_accessibility(DW_ACCESS_public)
DW$784	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$784, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$784, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$784, DW_AT_accessibility(DW_ACCESS_public)
DW$785	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$785, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$785, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$785, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$54

DW$786	.dwtag  DW_TAG_far_type
	.dwattr DW$786, DW_AT_type(*DW$T$55)
DW$T$103	.dwtag  DW_TAG_const_type
	.dwattr DW$T$103, DW_AT_type(*DW$786)
DW$T$183	.dwtag  DW_TAG_typedef, DW_AT_name("sdcarddirstruct"), DW_AT_type(*DW$T$57)
	.dwattr DW$T$183, DW_AT_language(DW_LANG_C)

DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$59, DW_AT_name("tag_slavecmdstruct")
	.dwattr DW$T$59, DW_AT_byte_size(0x48)
DW$787	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$787, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
	.dwattr DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$787, DW_AT_accessibility(DW_ACCESS_public)
DW$788	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$788, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
	.dwattr DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$788, DW_AT_accessibility(DW_ACCESS_public)
DW$789	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$789, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
	.dwattr DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$789, DW_AT_accessibility(DW_ACCESS_public)
DW$790	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$790, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
	.dwattr DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$790, DW_AT_accessibility(DW_ACCESS_public)
DW$791	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$791, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
	.dwattr DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$791, DW_AT_accessibility(DW_ACCESS_public)
DW$792	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
	.dwattr DW$792, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
	.dwattr DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$792, DW_AT_accessibility(DW_ACCESS_public)
DW$793	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$793, DW_AT_name("txmode"), DW_AT_symbol_name("_txmode")
	.dwattr DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr DW$793, DW_AT_accessibility(DW_ACCESS_public)
DW$794	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$794, DW_AT_name("slavelost"), DW_AT_symbol_name("_slavelost")
	.dwattr DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$794, DW_AT_accessibility(DW_ACCESS_public)
DW$795	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$795, DW_AT_name("slavenotready"), DW_AT_symbol_name("_slavenotready")
	.dwattr DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr DW$795, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$59


DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$60, DW_AT_name("tag_mbupdatestruct")
	.dwattr DW$T$60, DW_AT_byte_size(0x01)
DW$796	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$796, DW_AT_name("status1"), DW_AT_symbol_name("_status1")
	.dwattr DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$796, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$60

DW$T$189	.dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$63)
	.dwattr DW$T$189, DW_AT_language(DW_LANG_C)

DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$65, DW_AT_name("tag_functionstruct")
	.dwattr DW$T$65, DW_AT_byte_size(0x08)
DW$797	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$797, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$797, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$65


DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$66, DW_AT_name("tag_prewarnstruct")
	.dwattr DW$T$66, DW_AT_byte_size(0xaa)
DW$798	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$798, DW_AT_name("prelevel"), DW_AT_symbol_name("_prelevel")
	.dwattr DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$798, DW_AT_accessibility(DW_ACCESS_public)
DW$799	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$799, DW_AT_name("average"), DW_AT_symbol_name("_average")
	.dwattr DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$799, DW_AT_accessibility(DW_ACCESS_public)
DW$800	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$800, DW_AT_name("calcacc"), DW_AT_symbol_name("_calcacc")
	.dwattr DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$800, DW_AT_accessibility(DW_ACCESS_public)
DW$801	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$801, DW_AT_name("points"), DW_AT_symbol_name("_points")
	.dwattr DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr DW$801, DW_AT_accessibility(DW_ACCESS_public)
DW$802	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$802, DW_AT_name("prewarncompleteflag"), DW_AT_symbol_name("_prewarncompleteflag")
	.dwattr DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr DW$802, DW_AT_accessibility(DW_ACCESS_public)
DW$803	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$803, DW_AT_name("init"), DW_AT_symbol_name("_init")
	.dwattr DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xa9]
	.dwattr DW$803, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$66


DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$67, DW_AT_name("tag_engingestruct")
	.dwattr DW$T$67, DW_AT_byte_size(0x02)
DW$804	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$804, DW_AT_name("runtime"), DW_AT_symbol_name("_runtime")
	.dwattr DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$804, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$67


DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$68, DW_AT_name("tag_offsetstruct")
	.dwattr DW$T$68, DW_AT_byte_size(0x1c)
DW$805	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$805, DW_AT_name("val"), DW_AT_symbol_name("_val")
	.dwattr DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$68

DW$T$200	.dwtag  DW_TAG_typedef, DW_AT_name("manrefsumstruct"), DW_AT_type(*DW$T$69)
	.dwattr DW$T$200, DW_AT_language(DW_LANG_C)
DW$T$204	.dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$70)
	.dwattr DW$T$204, DW_AT_language(DW_LANG_C)

DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$71, DW_AT_name("tag_damagemonstruct")
	.dwattr DW$T$71, DW_AT_byte_size(0x10)
DW$806	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$806, DW_AT_name("ccsplit"), DW_AT_symbol_name("_ccsplit")
	.dwattr DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$806, DW_AT_accessibility(DW_ACCESS_public)
DW$807	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$807, DW_AT_name("kvalue"), DW_AT_symbol_name("_kvalue")
	.dwattr DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$807, DW_AT_accessibility(DW_ACCESS_public)
DW$808	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$808, DW_AT_name("betavalue"), DW_AT_symbol_name("_betavalue")
	.dwattr DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$808, DW_AT_accessibility(DW_ACCESS_public)
DW$809	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$809, DW_AT_name("rpmlevelx"), DW_AT_symbol_name("_rpmlevelx")
	.dwattr DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$809, DW_AT_accessibility(DW_ACCESS_public)
DW$810	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$810, DW_AT_name("reflevelx"), DW_AT_symbol_name("_reflevelx")
	.dwattr DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$810, DW_AT_accessibility(DW_ACCESS_public)
DW$811	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$811, DW_AT_name("presentstatex"), DW_AT_symbol_name("_presentstatex")
	.dwattr DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$811, DW_AT_accessibility(DW_ACCESS_public)
DW$812	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$812, DW_AT_name("alarmlevelsingle"), DW_AT_symbol_name("_alarmlevelsingle")
	.dwattr DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$812, DW_AT_accessibility(DW_ACCESS_public)
DW$813	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$813, DW_AT_name("alarmlevelcyl"), DW_AT_symbol_name("_alarmlevelcyl")
	.dwattr DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$813, DW_AT_accessibility(DW_ACCESS_public)
DW$814	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$814, DW_AT_name("alarmlevelmbsum"), DW_AT_symbol_name("_alarmlevelmbsum")
	.dwattr DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$814, DW_AT_accessibility(DW_ACCESS_public)
DW$815	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$815, DW_AT_name("cylneighbour"), DW_AT_symbol_name("_cylneighbour")
	.dwattr DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$815, DW_AT_accessibility(DW_ACCESS_public)
DW$816	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$816, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
	.dwattr DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$816, DW_AT_accessibility(DW_ACCESS_public)
DW$817	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$817, DW_AT_name("cylneighbouralarms"), DW_AT_symbol_name("_cylneighbouralarms")
	.dwattr DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$817, DW_AT_accessibility(DW_ACCESS_public)
DW$818	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$818, DW_AT_name("mbneighbouralarms"), DW_AT_symbol_name("_mbneighbouralarms")
	.dwattr DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$818, DW_AT_accessibility(DW_ACCESS_public)
DW$819	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$819, DW_AT_name("deltarpmlimit"), DW_AT_symbol_name("_deltarpmlimit")
	.dwattr DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$819, DW_AT_accessibility(DW_ACCESS_public)
DW$820	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$820, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
	.dwattr DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$820, DW_AT_accessibility(DW_ACCESS_public)
DW$821	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$821, DW_AT_name("damagemonenb"), DW_AT_symbol_name("_damagemonenb")
	.dwattr DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$821, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$71


DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$72, DW_AT_name("tag_dynamicalarmsstruct")
	.dwattr DW$T$72, DW_AT_byte_size(0x24)
DW$822	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$822, DW_AT_name("rpmav"), DW_AT_symbol_name("_rpmav")
	.dwattr DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$822, DW_AT_accessibility(DW_ACCESS_public)
DW$823	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$823, DW_AT_name("single1"), DW_AT_symbol_name("_single1")
	.dwattr DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$823, DW_AT_accessibility(DW_ACCESS_public)
DW$824	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$824, DW_AT_name("cyl1"), DW_AT_symbol_name("_cyl1")
	.dwattr DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$824, DW_AT_accessibility(DW_ACCESS_public)
DW$825	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$825, DW_AT_name("mbsum1"), DW_AT_symbol_name("_mbsum1")
	.dwattr DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$825, DW_AT_accessibility(DW_ACCESS_public)
DW$826	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$826, DW_AT_name("single2"), DW_AT_symbol_name("_single2")
	.dwattr DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$826, DW_AT_accessibility(DW_ACCESS_public)
DW$827	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$827, DW_AT_name("cyl2"), DW_AT_symbol_name("_cyl2")
	.dwattr DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$827, DW_AT_accessibility(DW_ACCESS_public)
DW$828	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$828, DW_AT_name("mbsum2"), DW_AT_symbol_name("_mbsum2")
	.dwattr DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$828, DW_AT_accessibility(DW_ACCESS_public)
DW$829	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$829, DW_AT_name("deltarpmprev"), DW_AT_symbol_name("_deltarpmprev")
	.dwattr DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$829, DW_AT_accessibility(DW_ACCESS_public)
DW$830	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$830, DW_AT_name("deltarpm"), DW_AT_symbol_name("_deltarpm")
	.dwattr DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$830, DW_AT_accessibility(DW_ACCESS_public)
DW$831	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$831, DW_AT_name("deltarpm_int"), DW_AT_symbol_name("_deltarpm_int")
	.dwattr DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$831, DW_AT_accessibility(DW_ACCESS_public)
DW$832	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$832, DW_AT_name("rpmav_int"), DW_AT_symbol_name("_rpmav_int")
	.dwattr DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$832, DW_AT_accessibility(DW_ACCESS_public)
DW$833	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$833, DW_AT_name("deltarpmprev_int"), DW_AT_symbol_name("_deltarpmprev_int")
	.dwattr DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$833, DW_AT_accessibility(DW_ACCESS_public)
DW$834	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$834, DW_AT_name("single"), DW_AT_symbol_name("_single")
	.dwattr DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$834, DW_AT_accessibility(DW_ACCESS_public)
DW$835	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$835, DW_AT_name("cyl"), DW_AT_symbol_name("_cyl")
	.dwattr DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$835, DW_AT_accessibility(DW_ACCESS_public)
DW$836	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$836, DW_AT_name("mbsum"), DW_AT_symbol_name("_mbsum")
	.dwattr DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$836, DW_AT_accessibility(DW_ACCESS_public)
DW$837	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$837, DW_AT_name("singleprev"), DW_AT_symbol_name("_singleprev")
	.dwattr DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$837, DW_AT_accessibility(DW_ACCESS_public)
DW$838	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$838, DW_AT_name("cylprev"), DW_AT_symbol_name("_cylprev")
	.dwattr DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$838, DW_AT_accessibility(DW_ACCESS_public)
DW$839	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$839, DW_AT_name("mbsumprev"), DW_AT_symbol_name("_mbsumprev")
	.dwattr DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$839, DW_AT_accessibility(DW_ACCESS_public)
DW$840	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$840, DW_AT_name("single1_int"), DW_AT_symbol_name("_single1_int")
	.dwattr DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$840, DW_AT_accessibility(DW_ACCESS_public)
DW$841	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$841, DW_AT_name("cyl1_int"), DW_AT_symbol_name("_cyl1_int")
	.dwattr DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$841, DW_AT_accessibility(DW_ACCESS_public)
DW$842	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$842, DW_AT_name("mbsum1_int"), DW_AT_symbol_name("_mbsum1_int")
	.dwattr DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$842, DW_AT_accessibility(DW_ACCESS_public)
DW$843	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$843, DW_AT_name("single2_int"), DW_AT_symbol_name("_single2_int")
	.dwattr DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$843, DW_AT_accessibility(DW_ACCESS_public)
DW$844	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$844, DW_AT_name("cyl2_int"), DW_AT_symbol_name("_cyl2_int")
	.dwattr DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$844, DW_AT_accessibility(DW_ACCESS_public)
DW$845	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$845, DW_AT_name("mbsum2_int"), DW_AT_symbol_name("_mbsum2_int")
	.dwattr DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$845, DW_AT_accessibility(DW_ACCESS_public)
DW$846	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$846, DW_AT_name("hits"), DW_AT_symbol_name("_hits")
	.dwattr DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$846, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$72


DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$73, DW_AT_name("tag_damalarmsstruct")
	.dwattr DW$T$73, DW_AT_byte_size(0x04)
DW$847	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
	.dwattr DW$847, DW_AT_name("single"), DW_AT_symbol_name("_single")
	.dwattr DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$847, DW_AT_accessibility(DW_ACCESS_public)
DW$848	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$848, DW_AT_name("cylinder"), DW_AT_symbol_name("_cylinder")
	.dwattr DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$848, DW_AT_accessibility(DW_ACCESS_public)
DW$849	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$849, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
	.dwattr DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$849, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$73


DW$T$26	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$26, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$26, DW_AT_byte_size(0x02)
DW$850	.dwtag  DW_TAG_subrange_type
	.dwattr DW$850, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$26


DW$T$51	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$51, DW_AT_byte_size(0x54)
DW$851	.dwtag  DW_TAG_subrange_type
	.dwattr DW$851, DW_AT_upper_bound(0x02)
DW$852	.dwtag  DW_TAG_subrange_type
	.dwattr DW$852, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$51


DW$T$28	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$28, DW_AT_byte_size(0x0e)
DW$853	.dwtag  DW_TAG_subrange_type
	.dwattr DW$853, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$28


DW$T$43	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$43, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$43, DW_AT_byte_size(0x02)
DW$854	.dwtag  DW_TAG_subrange_type
	.dwattr DW$854, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$43


DW$T$44	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$44, DW_AT_byte_size(0x06)
DW$855	.dwtag  DW_TAG_subrange_type
	.dwattr DW$855, DW_AT_upper_bound(0x02)
DW$856	.dwtag  DW_TAG_subrange_type
	.dwattr DW$856, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$44


DW$T$49	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$49, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$49, DW_AT_byte_size(0x03)
DW$857	.dwtag  DW_TAG_subrange_type
	.dwattr DW$857, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$49


DW$T$58	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$58, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$58, DW_AT_byte_size(0x40)
DW$858	.dwtag  DW_TAG_subrange_type
	.dwattr DW$858, DW_AT_upper_bound(0x3f)
	.dwendtag DW$T$58


DW$T$47	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$47, DW_AT_byte_size(0x38)
DW$859	.dwtag  DW_TAG_subrange_type
	.dwattr DW$859, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$47


DW$T$48	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$48, DW_AT_byte_size(0xa8)
DW$860	.dwtag  DW_TAG_subrange_type
	.dwattr DW$860, DW_AT_upper_bound(0x02)
DW$861	.dwtag  DW_TAG_subrange_type
	.dwattr DW$861, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$48


DW$T$45	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$45, DW_AT_byte_size(0x06)
DW$862	.dwtag  DW_TAG_subrange_type
	.dwattr DW$862, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$45


DW$T$46	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$46, DW_AT_byte_size(0x12c)
DW$863	.dwtag  DW_TAG_subrange_type
	.dwattr DW$863, DW_AT_upper_bound(0x95)
	.dwendtag DW$T$46


DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$19, DW_AT_name("tag_status3struct")
	.dwattr DW$T$19, DW_AT_byte_size(0x01)
DW$864	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$864, DW_AT_name("nopulse"), DW_AT_symbol_name("_nopulse")
	.dwattr DW$864, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$864, DW_AT_accessibility(DW_ACCESS_public)
DW$865	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$865, DW_AT_name("low"), DW_AT_symbol_name("_low")
	.dwattr DW$865, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$865, DW_AT_accessibility(DW_ACCESS_public)
DW$866	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$866, DW_AT_name("high"), DW_AT_symbol_name("_high")
	.dwattr DW$866, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$866, DW_AT_accessibility(DW_ACCESS_public)
DW$867	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$867, DW_AT_name("rpmoor"), DW_AT_symbol_name("_rpmoor")
	.dwattr DW$867, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$867, DW_AT_accessibility(DW_ACCESS_public)
DW$868	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$868, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$868, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$868, DW_AT_accessibility(DW_ACCESS_public)
DW$869	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$869, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$869, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$869, DW_AT_accessibility(DW_ACCESS_public)
DW$870	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$870, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$870, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$870, DW_AT_accessibility(DW_ACCESS_public)
DW$871	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$871, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$871, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$871, DW_AT_accessibility(DW_ACCESS_public)
DW$872	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$872, DW_AT_name("nopulselatched"), DW_AT_symbol_name("_nopulselatched")
	.dwattr DW$872, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$872, DW_AT_accessibility(DW_ACCESS_public)
DW$873	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$873, DW_AT_name("lowlatched"), DW_AT_symbol_name("_lowlatched")
	.dwattr DW$873, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$873, DW_AT_accessibility(DW_ACCESS_public)
DW$874	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$874, DW_AT_name("highlatched"), DW_AT_symbol_name("_highlatched")
	.dwattr DW$874, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$874, DW_AT_accessibility(DW_ACCESS_public)
DW$875	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$875, DW_AT_name("rpmoorlatched"), DW_AT_symbol_name("_rpmoorlatched")
	.dwattr DW$875, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$875, DW_AT_accessibility(DW_ACCESS_public)
DW$876	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$876, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$876, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$876, DW_AT_accessibility(DW_ACCESS_public)
DW$877	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$877, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$877, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$877, DW_AT_accessibility(DW_ACCESS_public)
DW$878	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$878, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$878, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$878, DW_AT_accessibility(DW_ACCESS_public)
DW$879	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$879, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$879, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$879, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$19

DW$T$61	.dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$61, DW_AT_language(DW_LANG_C)
DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("sensoralarmstruct"), DW_AT_type(*DW$T$21)
	.dwattr DW$T$62, DW_AT_language(DW_LANG_C)

DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$24, DW_AT_byte_size(0x02)
DW$880	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$880, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
	.dwattr DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$880, DW_AT_accessibility(DW_ACCESS_public)
DW$881	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$881, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
	.dwattr DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$881, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$24


DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$29, DW_AT_name("tag_timers")
	.dwattr DW$T$29, DW_AT_byte_size(0x4c)
DW$882	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$882, DW_AT_name("update"), DW_AT_symbol_name("_update")
	.dwattr DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$882, DW_AT_accessibility(DW_ACCESS_public)
DW$883	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$883, DW_AT_name("general"), DW_AT_symbol_name("_general")
	.dwattr DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$883, DW_AT_accessibility(DW_ACCESS_public)
DW$884	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$884, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
	.dwattr DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$884, DW_AT_accessibility(DW_ACCESS_public)
DW$885	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$885, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
	.dwattr DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$885, DW_AT_accessibility(DW_ACCESS_public)
DW$886	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$886, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
	.dwattr DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$886, DW_AT_accessibility(DW_ACCESS_public)
DW$887	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$887, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
	.dwattr DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$887, DW_AT_accessibility(DW_ACCESS_public)
DW$888	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$888, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
	.dwattr DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$888, DW_AT_accessibility(DW_ACCESS_public)
DW$889	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$889, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
	.dwattr DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$889, DW_AT_accessibility(DW_ACCESS_public)
DW$890	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$890, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
	.dwattr DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$890, DW_AT_accessibility(DW_ACCESS_public)
DW$891	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$891, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
	.dwattr DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$891, DW_AT_accessibility(DW_ACCESS_public)
DW$892	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$892, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
	.dwattr DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$892, DW_AT_accessibility(DW_ACCESS_public)
DW$893	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$893, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
	.dwattr DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$893, DW_AT_accessibility(DW_ACCESS_public)
DW$894	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$894, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
	.dwattr DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$894, DW_AT_accessibility(DW_ACCESS_public)
DW$895	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$895, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
	.dwattr DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$895, DW_AT_accessibility(DW_ACCESS_public)
DW$896	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$896, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
	.dwattr DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$896, DW_AT_accessibility(DW_ACCESS_public)
DW$897	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$897, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$897, DW_AT_accessibility(DW_ACCESS_public)
DW$898	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$898, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
	.dwattr DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$898, DW_AT_accessibility(DW_ACCESS_public)
DW$899	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$899, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
	.dwattr DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$899, DW_AT_accessibility(DW_ACCESS_public)
DW$900	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$900, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$900, DW_AT_accessibility(DW_ACCESS_public)
DW$901	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$901, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
	.dwattr DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$901, DW_AT_accessibility(DW_ACCESS_public)
DW$902	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$902, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
	.dwattr DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$902, DW_AT_accessibility(DW_ACCESS_public)
DW$903	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$903, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
	.dwattr DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$903, DW_AT_accessibility(DW_ACCESS_public)
DW$904	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$904, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
	.dwattr DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr DW$904, DW_AT_accessibility(DW_ACCESS_public)
DW$905	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$905, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
	.dwattr DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$905, DW_AT_accessibility(DW_ACCESS_public)
DW$906	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$906, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
	.dwattr DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr DW$906, DW_AT_accessibility(DW_ACCESS_public)
DW$907	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$907, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
	.dwattr DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$907, DW_AT_accessibility(DW_ACCESS_public)
DW$908	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$908, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
	.dwattr DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr DW$908, DW_AT_accessibility(DW_ACCESS_public)
DW$909	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$909, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
	.dwattr DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$909, DW_AT_accessibility(DW_ACCESS_public)
DW$910	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$910, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
	.dwattr DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr DW$910, DW_AT_accessibility(DW_ACCESS_public)
DW$911	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$911, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
	.dwattr DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$911, DW_AT_accessibility(DW_ACCESS_public)
DW$912	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$912, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
	.dwattr DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$912, DW_AT_accessibility(DW_ACCESS_public)
DW$913	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$913, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
	.dwattr DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$913, DW_AT_accessibility(DW_ACCESS_public)
DW$914	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$914, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
	.dwattr DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr DW$914, DW_AT_accessibility(DW_ACCESS_public)
DW$915	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$915, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
	.dwattr DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$915, DW_AT_accessibility(DW_ACCESS_public)
DW$916	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$916, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr DW$916, DW_AT_accessibility(DW_ACCESS_public)
DW$917	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$917, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
	.dwattr DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr DW$917, DW_AT_accessibility(DW_ACCESS_public)
DW$918	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$918, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
	.dwattr DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr DW$918, DW_AT_accessibility(DW_ACCESS_public)
DW$919	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$919, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
	.dwattr DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$919, DW_AT_accessibility(DW_ACCESS_public)
DW$920	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$920, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
	.dwattr DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr DW$920, DW_AT_accessibility(DW_ACCESS_public)
DW$921	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$921, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
	.dwattr DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$921, DW_AT_accessibility(DW_ACCESS_public)
DW$922	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$922, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
	.dwattr DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr DW$922, DW_AT_accessibility(DW_ACCESS_public)
DW$923	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$923, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
	.dwattr DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$923, DW_AT_accessibility(DW_ACCESS_public)
DW$924	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$924, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
	.dwattr DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr DW$924, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$29


DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$30, DW_AT_byte_size(0x01)
DW$925	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$925, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
	.dwattr DW$925, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$925, DW_AT_accessibility(DW_ACCESS_public)
DW$926	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$926, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
	.dwattr DW$926, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$926, DW_AT_accessibility(DW_ACCESS_public)
DW$927	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$927, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
	.dwattr DW$927, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$927, DW_AT_accessibility(DW_ACCESS_public)
DW$928	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$928, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
	.dwattr DW$928, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$928, DW_AT_accessibility(DW_ACCESS_public)
DW$929	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$929, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
	.dwattr DW$929, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$929, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$30


DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$31, DW_AT_byte_size(0x01)
DW$930	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$930, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
	.dwattr DW$930, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$930, DW_AT_accessibility(DW_ACCESS_public)
DW$931	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$931, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
	.dwattr DW$931, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
	.dwattr DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$931, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$31


DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$35, DW_AT_name("tag_cylinderstruct")
	.dwattr DW$T$35, DW_AT_byte_size(0x04)
DW$932	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$932, DW_AT_name("status1"), DW_AT_symbol_name("_status1")
	.dwattr DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$932, DW_AT_accessibility(DW_ACCESS_public)
DW$933	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$933, DW_AT_name("status2"), DW_AT_symbol_name("_status2")
	.dwattr DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$933, DW_AT_accessibility(DW_ACCESS_public)
DW$934	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$934, DW_AT_name("average"), DW_AT_symbol_name("_average")
	.dwattr DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$934, DW_AT_accessibility(DW_ACCESS_public)
DW$935	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$935, DW_AT_name("deviation"), DW_AT_symbol_name("_deviation")
	.dwattr DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$935, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$35


DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$36, DW_AT_byte_size(0x01)
DW$936	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$936, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
	.dwattr DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$936, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$36


DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$37, DW_AT_byte_size(0x01)
DW$937	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$937, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
	.dwattr DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$937, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$37


DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$38, DW_AT_byte_size(0x01)
DW$938	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$938, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
	.dwattr DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$938, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$38


DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$39, DW_AT_byte_size(0x03)
DW$939	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$939, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
	.dwattr DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$939, DW_AT_accessibility(DW_ACCESS_public)
DW$940	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$940, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
	.dwattr DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$940, DW_AT_accessibility(DW_ACCESS_public)
DW$941	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$941, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
	.dwattr DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$941, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$39


DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$40, DW_AT_byte_size(0x02)
DW$942	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$942, DW_AT_name("shortlrate"), DW_AT_symbol_name("_shortlrate")
	.dwattr DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$942, DW_AT_accessibility(DW_ACCESS_public)
DW$943	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$943, DW_AT_name("longlrate"), DW_AT_symbol_name("_longlrate")
	.dwattr DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$943, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$40


DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$41, DW_AT_byte_size(0x10)
DW$944	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$944, DW_AT_name("wiorequest"), DW_AT_symbol_name("_wiorequest")
	.dwattr DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$944, DW_AT_accessibility(DW_ACCESS_public)
DW$945	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$945, DW_AT_name("wiocancelled"), DW_AT_symbol_name("_wiocancelled")
	.dwattr DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$945, DW_AT_accessibility(DW_ACCESS_public)
DW$946	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$946, DW_AT_name("wioreceived"), DW_AT_symbol_name("_wioreceived")
	.dwattr DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$946, DW_AT_accessibility(DW_ACCESS_public)
DW$947	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$947, DW_AT_name("slaverequest"), DW_AT_symbol_name("_slaverequest")
	.dwattr DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$947, DW_AT_accessibility(DW_ACCESS_public)
DW$948	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$948, DW_AT_name("slavereceived"), DW_AT_symbol_name("_slavereceived")
	.dwattr DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$948, DW_AT_accessibility(DW_ACCESS_public)
DW$949	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$949, DW_AT_name("slaveretry"), DW_AT_symbol_name("_slaveretry")
	.dwattr DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$949, DW_AT_accessibility(DW_ACCESS_public)
DW$950	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$950, DW_AT_name("pcrequest"), DW_AT_symbol_name("_pcrequest")
	.dwattr DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$950, DW_AT_accessibility(DW_ACCESS_public)
DW$951	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$951, DW_AT_name("pcreqtimeout"), DW_AT_symbol_name("_pcreqtimeout")
	.dwattr DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$951, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$41

DW$T$55	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$55, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$55, DW_AT_byte_size(0x01)

DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$57, DW_AT_name("tag_sdcarddirstruct")
	.dwattr DW$T$57, DW_AT_byte_size(0x36)
DW$952	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$952, DW_AT_name("firstcaldir"), DW_AT_symbol_name("_firstcaldir")
	.dwattr DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$952, DW_AT_accessibility(DW_ACCESS_public)
DW$953	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$953, DW_AT_name("roughcaldir"), DW_AT_symbol_name("_roughcaldir")
	.dwattr DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$953, DW_AT_accessibility(DW_ACCESS_public)
DW$954	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$954, DW_AT_name("finecaldir"), DW_AT_symbol_name("_finecaldir")
	.dwattr DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$954, DW_AT_accessibility(DW_ACCESS_public)
DW$955	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$955, DW_AT_name("configdir"), DW_AT_symbol_name("_configdir")
	.dwattr DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$955, DW_AT_accessibility(DW_ACCESS_public)
DW$956	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$956, DW_AT_name("sterm"), DW_AT_symbol_name("_sterm")
	.dwattr DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$956, DW_AT_accessibility(DW_ACCESS_public)
DW$957	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$957, DW_AT_name("lterm"), DW_AT_symbol_name("_lterm")
	.dwattr DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr DW$957, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$57


DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$63, DW_AT_name("tag_sensorstruct")
	.dwattr DW$T$63, DW_AT_byte_size(0x12)
DW$958	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
	.dwattr DW$958, DW_AT_name("status1"), DW_AT_symbol_name("_status1")
	.dwattr DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$958, DW_AT_accessibility(DW_ACCESS_public)
DW$959	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
	.dwattr DW$959, DW_AT_name("status2"), DW_AT_symbol_name("_status2")
	.dwattr DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$959, DW_AT_accessibility(DW_ACCESS_public)
DW$960	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$960, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
	.dwattr DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$960, DW_AT_accessibility(DW_ACCESS_public)
DW$961	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$961, DW_AT_name("val"), DW_AT_symbol_name("_val")
	.dwattr DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$961, DW_AT_accessibility(DW_ACCESS_public)
DW$962	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$962, DW_AT_name("immediateval"), DW_AT_symbol_name("_immediateval")
	.dwattr DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$962, DW_AT_accessibility(DW_ACCESS_public)
DW$963	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$963, DW_AT_name("initialval"), DW_AT_symbol_name("_initialval")
	.dwattr DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$963, DW_AT_accessibility(DW_ACCESS_public)
DW$964	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$964, DW_AT_name("precomp"), DW_AT_symbol_name("_precomp")
	.dwattr DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$964, DW_AT_accessibility(DW_ACCESS_public)
DW$965	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$965, DW_AT_name("postcomp"), DW_AT_symbol_name("_postcomp")
	.dwattr DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$965, DW_AT_accessibility(DW_ACCESS_public)
DW$966	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$966, DW_AT_name("postfilter"), DW_AT_symbol_name("_postfilter")
	.dwattr DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$966, DW_AT_accessibility(DW_ACCESS_public)
DW$967	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$967, DW_AT_name("endresult"), DW_AT_symbol_name("_endresult")
	.dwattr DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$967, DW_AT_accessibility(DW_ACCESS_public)
DW$968	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$968, DW_AT_name("deviation"), DW_AT_symbol_name("_deviation")
	.dwattr DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$968, DW_AT_accessibility(DW_ACCESS_public)
DW$969	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$969, DW_AT_name("min"), DW_AT_symbol_name("_min")
	.dwattr DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$969, DW_AT_accessibility(DW_ACCESS_public)
DW$970	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$970, DW_AT_name("max"), DW_AT_symbol_name("_max")
	.dwattr DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$970, DW_AT_accessibility(DW_ACCESS_public)
DW$971	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$971, DW_AT_name("devmin"), DW_AT_symbol_name("_devmin")
	.dwattr DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$971, DW_AT_accessibility(DW_ACCESS_public)
DW$972	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$972, DW_AT_name("devmax"), DW_AT_symbol_name("_devmax")
	.dwattr DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$972, DW_AT_accessibility(DW_ACCESS_public)
DW$973	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$973, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$973, DW_AT_accessibility(DW_ACCESS_public)
DW$974	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$974, DW_AT_name("prt"), DW_AT_symbol_name("_prt")
	.dwattr DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$974, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$63


DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$64, DW_AT_byte_size(0x08)
DW$975	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
