;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Thu Aug 18 12:16:20 2016                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("mancal.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_bReadyToSampling+0,32
	.field  	0,16			; _bReadyToSampling @ 0

	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_bSamplingFinished+0,32
	.field  	0,16			; _bSamplingFinished @ 0


DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("sprintf"), DW_AT_symbol_name("_sprintf")
	.dwattr DW$1, DW_AT_type(*DW$T$10)
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$59)
DW$3	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$83)
DW$4	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$1



DW$T$62	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$62, DW_AT_address_class(0x16)

DW$T$109	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$109, DW_AT_language(DW_LANG_C)
DW$350	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$109


DW$T$111	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$111, DW_AT_language(DW_LANG_C)
DW$351	.dwtag  DW_TAG_far_type
	.dwattr DW$351, DW_AT_type(*DW$T$11)
DW$T$113	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$113, DW_AT_type(*DW$351)

DW$T$117	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$116)
	.dwattr DW$T$117, DW_AT_language(DW_LANG_C)
DW$352	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
DW$353	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$117

DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x02)
DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)

DW$T$119	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$118)
	.dwattr DW$T$119, DW_AT_language(DW_LANG_C)
DW$354	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$119

DW$355	.dwtag  DW_TAG_far_type
	.dwattr DW$355, DW_AT_type(*DW$T$13)
DW$T$120	.dwtag  DW_TAG_const_type
	.dwattr DW$T$120, DW_AT_type(*DW$355)
DW$T$16	.dwtag  DW_TAG_base_type, DW_AT_name("float")
	.dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr DW$T$16, DW_AT_byte_size(0x02)

DW$T$122	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
	.dwattr DW$T$122, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$122, DW_AT_byte_size(0x38)
DW$356	.dwtag  DW_TAG_subrange_type
	.dwattr DW$356, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$122

DW$T$127	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
	.dwattr DW$T$127, DW_AT_address_class(0x16)

DW$T$128	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$127)
	.dwattr DW$T$128, DW_AT_language(DW_LANG_C)
DW$357	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$128

DW$T$132	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
	.dwattr DW$T$132, DW_AT_address_class(0x16)

DW$T$133	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$132)
	.dwattr DW$T$133, DW_AT_language(DW_LANG_C)
DW$358	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$133

DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$137, DW_AT_language(DW_LANG_C)
DW$T$138	.dwtag  DW_TAG_typedef, DW_AT_name("motionstruct"), DW_AT_type(*DW$T$24)
	.dwattr DW$T$138, DW_AT_language(DW_LANG_C)
DW$359	.dwtag  DW_TAG_far_type
	.dwattr DW$359, DW_AT_type(*DW$T$139)
DW$T$140	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$140, DW_AT_type(*DW$359)
DW$T$142	.dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$29)
	.dwattr DW$T$142, DW_AT_language(DW_LANG_C)

DW$T$145	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$144)
	.dwattr DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$145, DW_AT_byte_size(0x1f8)
DW$360	.dwtag  DW_TAG_subrange_type
	.dwattr DW$360, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$145

DW$T$148	.dwtag  DW_TAG_typedef, DW_AT_name("functionstruct"), DW_AT_type(*DW$T$34)
	.dwattr DW$T$148, DW_AT_language(DW_LANG_C)

DW$T$150	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$149)
	.dwattr DW$T$150, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$150, DW_AT_byte_size(0x118)
DW$361	.dwtag  DW_TAG_subrange_type
	.dwattr DW$361, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$150


DW$T$154	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
	.dwattr DW$T$154, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$154, DW_AT_byte_size(0x1c)
DW$362	.dwtag  DW_TAG_subrange_type
	.dwattr DW$362, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$154

DW$T$157	.dwtag  DW_TAG_typedef, DW_AT_name("dynamicalarmsstruct"), DW_AT_type(*DW$T$37)
	.dwattr DW$T$157, DW_AT_language(DW_LANG_C)
DW$T$59	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
	.dwattr DW$T$59, DW_AT_address_class(0x16)
DW$T$83	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$82)
	.dwattr DW$T$83, DW_AT_address_class(0x16)

DW$T$158	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$38)
	.dwattr DW$T$158, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$158, DW_AT_byte_size(0x64)
DW$363	.dwtag  DW_TAG_subrange_type
	.dwattr DW$363, DW_AT_upper_bound(0x63)
	.dwendtag DW$T$158

DW$364	.dwtag  DW_TAG_far_type
	.dwattr DW$364, DW_AT_type(*DW$T$160)
DW$T$161	.dwtag  DW_TAG_const_type
	.dwattr DW$T$161, DW_AT_type(*DW$364)
DW$T$164	.dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$42)
	.dwattr DW$T$164, DW_AT_language(DW_LANG_C)
DW$T$165	.dwtag  DW_TAG_typedef, DW_AT_name("sensorMovingstruct"), DW_AT_type(*DW$T$43)
	.dwattr DW$T$165, DW_AT_language(DW_LANG_C)
DW$T$166	.dwtag  DW_TAG_typedef, DW_AT_name("calibrationstruct"), DW_AT_type(*DW$T$53)
	.dwattr DW$T$166, DW_AT_language(DW_LANG_C)
DW$T$168	.dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$54)
	.dwattr DW$T$168, DW_AT_language(DW_LANG_C)
DW$T$170	.dwtag  DW_TAG_typedef, DW_AT_name("mancalstruct"), DW_AT_type(*DW$T$55)
	.dwattr DW$T$170, DW_AT_language(DW_LANG_C)
DW$T$116	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$116, DW_AT_address_class(0x16)
DW$T$118	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$118, DW_AT_address_class(0x16)
DW$T$30	.dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$30, DW_AT_language(DW_LANG_C)
DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("sensoralarmstruct"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)

DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_name("tag_settingsstruct")
	.dwattr DW$T$22, DW_AT_byte_size(0x24)
DW$365	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$365, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
	.dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
DW$366	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$366, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
	.dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
DW$367	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$367, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
	.dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
DW$368	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$368, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
	.dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
DW$369	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$369, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
	.dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
DW$370	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$370, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
	.dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
DW$371	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$371, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
	.dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
DW$372	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$372, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
	.dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
DW$373	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$373, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
	.dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
DW$374	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$374, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
	.dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
DW$375	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$375, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
	.dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
DW$376	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$376, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
	.dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
DW$377	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$377, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
	.dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
DW$378	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$378, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
DW$379	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$379, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
	.dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
DW$380	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$380, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
	.dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
DW$381	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$381, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
	.dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
DW$382	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$382, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
	.dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
DW$383	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$383, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
	.dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
DW$384	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$384, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
DW$385	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$385, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
	.dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
DW$386	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$386, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
DW$387	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$387, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
	.dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
DW$388	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$388, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
	.dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
DW$389	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$389, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
DW$390	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$390, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
DW$391	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$391, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
DW$392	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$392, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
DW$393	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$393, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
DW$394	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$394, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
	.dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
DW$395	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$395, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
	.dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
DW$396	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$396, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
	.dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
DW$397	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$397, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
	.dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
DW$398	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$398, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
	.dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
DW$399	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$399, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22


DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$24, DW_AT_name("tag_motionstruct")
	.dwattr DW$T$24, DW_AT_byte_size(0x09)
DW$400	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$400, DW_AT_name("counter"), DW_AT_symbol_name("_counter")
	.dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
DW$401	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$401, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
	.dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
DW$402	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$402, DW_AT_name("order"), DW_AT_symbol_name("_order")
	.dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
DW$403	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$403, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
DW$404	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$404, DW_AT_name("forwardasternflagprev"), DW_AT_symbol_name("_forwardasternflagprev")
	.dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
DW$405	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$405, DW_AT_name("recalnow"), DW_AT_symbol_name("_recalnow")
	.dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
DW$406	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$406, DW_AT_name("calerror"), DW_AT_symbol_name("_calerror")
	.dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
DW$407	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$407, DW_AT_name("recheckdir"), DW_AT_symbol_name("_recheckdir")
	.dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$24

DW$T$139	.dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$139, DW_AT_language(DW_LANG_C)

DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$29, DW_AT_name("tag_allsensorstruct")
	.dwattr DW$T$29, DW_AT_byte_size(0x2d)
DW$408	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$408, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
	.dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
DW$409	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$409, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
	.dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
DW$410	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$410, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
	.dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
DW$411	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$411, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
	.dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
DW$412	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$412, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
	.dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
DW$413	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$413, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
	.dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
DW$414	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$414, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
	.dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
DW$415	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$415, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
	.dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
DW$416	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$416, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
	.dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
DW$417	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$417, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
DW$418	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$418, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
DW$419	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$419, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
	.dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
DW$420	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$420, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
	.dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
DW$421	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$421, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
DW$422	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$422, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
DW$423	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$423, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
DW$424	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$424, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
	.dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
DW$425	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$425, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
	.dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
DW$426	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$426, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
	.dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
DW$427	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$427, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
	.dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
DW$428	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$428, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
	.dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
DW$429	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$429, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
	.dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
DW$430	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$430, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
	.dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
DW$431	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$431, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
	.dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
DW$432	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$432, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
	.dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
DW$433	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$433, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
	.dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
DW$434	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$434, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
	.dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
DW$435	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$435, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
	.dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
DW$436	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$436, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
	.dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
DW$437	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$437, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
DW$438	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$438, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow")
	.dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
DW$439	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$439, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHigh")
	.dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$29

DW$T$144	.dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$32)
	.dwattr DW$T$144, DW_AT_language(DW_LANG_C)

DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$34, DW_AT_name("tag_functionstruct")
	.dwattr DW$T$34, DW_AT_byte_size(0x08)
DW$440	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$440, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$34

DW$T$149	.dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$35)
	.dwattr DW$T$149, DW_AT_language(DW_LANG_C)
DW$T$153	.dwtag  DW_TAG_typedef, DW_AT_name("manrefsumstruct"), DW_AT_type(*DW$T$36)
	.dwattr DW$T$153, DW_AT_language(DW_LANG_C)

DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$37, DW_AT_name("tag_dynamicalarmsstruct")
	.dwattr DW$T$37, DW_AT_byte_size(0x24)
DW$441	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$441, DW_AT_name("rpmav"), DW_AT_symbol_name("_rpmav")
	.dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
DW$442	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$442, DW_AT_name("single1"), DW_AT_symbol_name("_single1")
	.dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
DW$443	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$443, DW_AT_name("cyl1"), DW_AT_symbol_name("_cyl1")
	.dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
DW$444	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$444, DW_AT_name("mbsum1"), DW_AT_symbol_name("_mbsum1")
	.dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
DW$445	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$445, DW_AT_name("single2"), DW_AT_symbol_name("_single2")
	.dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
DW$446	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$446, DW_AT_name("cyl2"), DW_AT_symbol_name("_cyl2")
	.dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
DW$447	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$447, DW_AT_name("mbsum2"), DW_AT_symbol_name("_mbsum2")
	.dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
DW$448	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$448, DW_AT_name("deltarpmprev"), DW_AT_symbol_name("_deltarpmprev")
	.dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
DW$449	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$449, DW_AT_name("deltarpm"), DW_AT_symbol_name("_deltarpm")
	.dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
DW$450	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$450, DW_AT_name("deltarpm_int"), DW_AT_symbol_name("_deltarpm_int")
	.dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
DW$451	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$451, DW_AT_name("rpmav_int"), DW_AT_symbol_name("_rpmav_int")
	.dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
DW$452	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$452, DW_AT_name("deltarpmprev_int"), DW_AT_symbol_name("_deltarpmprev_int")
	.dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
DW$453	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$453, DW_AT_name("single"), DW_AT_symbol_name("_single")
	.dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
DW$454	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$454, DW_AT_name("cyl"), DW_AT_symbol_name("_cyl")
	.dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
DW$455	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$455, DW_AT_name("mbsum"), DW_AT_symbol_name("_mbsum")
	.dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
DW$456	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$456, DW_AT_name("singleprev"), DW_AT_symbol_name("_singleprev")
	.dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
DW$457	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$457, DW_AT_name("cylprev"), DW_AT_symbol_name("_cylprev")
	.dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
DW$458	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$458, DW_AT_name("mbsumprev"), DW_AT_symbol_name("_mbsumprev")
	.dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
DW$459	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$459, DW_AT_name("single1_int"), DW_AT_symbol_name("_single1_int")
	.dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
DW$460	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$460, DW_AT_name("cyl1_int"), DW_AT_symbol_name("_cyl1_int")
	.dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
DW$461	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$461, DW_AT_name("mbsum1_int"), DW_AT_symbol_name("_mbsum1_int")
	.dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
DW$462	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$462, DW_AT_name("single2_int"), DW_AT_symbol_name("_single2_int")
	.dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
DW$463	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$463, DW_AT_name("cyl2_int"), DW_AT_symbol_name("_cyl2_int")
	.dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
DW$464	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$464, DW_AT_name("mbsum2_int"), DW_AT_symbol_name("_mbsum2_int")
	.dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
DW$465	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$465, DW_AT_name("hits"), DW_AT_symbol_name("_hits")
	.dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$37

DW$T$38	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$38, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$38, DW_AT_byte_size(0x01)
DW$466	.dwtag  DW_TAG_far_type
	.dwattr DW$466, DW_AT_type(*DW$T$38)
DW$T$82	.dwtag  DW_TAG_const_type
	.dwattr DW$T$82, DW_AT_type(*DW$466)
DW$T$160	.dwtag  DW_TAG_typedef, DW_AT_name("sdcarddirstruct"), DW_AT_type(*DW$T$40)
	.dwattr DW$T$160, DW_AT_language(DW_LANG_C)

DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$42, DW_AT_name("tag_sdsettingsstruct")
	.dwattr DW$T$42, DW_AT_byte_size(0x04)
DW$467	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$467, DW_AT_name("present"), DW_AT_symbol_name("_present")
	.dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
DW$468	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$468, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
	.dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
DW$469	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$469, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
	.dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
DW$470	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$470, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
	.dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$42


DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$43, DW_AT_name("tag_sensorMoving")
	.dwattr DW$T$43, DW_AT_byte_size(0x02)
DW$471	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$471, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
	.dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
DW$472	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$472, DW_AT_name("unusedByte"), DW_AT_symbol_name("_unusedByte")
	.dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$43


DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$53, DW_AT_name("tag_calibrationstruct")
	.dwattr DW$T$53, DW_AT_byte_size(0x31a)
DW$473	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$473, DW_AT_name("rpmpoints"), DW_AT_symbol_name("_rpmpoints")
	.dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
DW$474	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$474, DW_AT_name("speedcalpoints"), DW_AT_symbol_name("_speedcalpoints")
	.dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
DW$475	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
	.dwattr DW$475, DW_AT_name("roughnumpoints"), DW_AT_symbol_name("_roughnumpoints")
	.dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
DW$476	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$476, DW_AT_name("numpoints"), DW_AT_symbol_name("_numpoints")
	.dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
DW$477	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$477, DW_AT_name("averagespeedacc"), DW_AT_symbol_name("_averagespeedacc")
	.dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
DW$478	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
	.dwattr DW$478, DW_AT_name("averagevalacc"), DW_AT_symbol_name("_averagevalacc")
	.dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e2]
	.dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
DW$479	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$479, DW_AT_name("validpoints"), DW_AT_symbol_name("_validpoints")
	.dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x28a]
	.dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
DW$480	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$480, DW_AT_name("rpmatcal"), DW_AT_symbol_name("_rpmatcal")
	.dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x28b]
	.dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
DW$481	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$481, DW_AT_name("manroughcalpts"), DW_AT_symbol_name("_manroughcalpts")
	.dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x28e]
	.dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
DW$482	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$482, DW_AT_name("manroughmin"), DW_AT_symbol_name("_manroughmin")
	.dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e2]
	.dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
DW$483	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$483, DW_AT_name("manroughmax"), DW_AT_symbol_name("_manroughmax")
	.dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2fe]
	.dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$53


DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$54, DW_AT_name("tag_speedcompstruct")
	.dwattr DW$T$54, DW_AT_byte_size(0x19)
DW$484	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$484, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
	.dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
DW$485	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$485, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
DW$486	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$486, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
	.dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
DW$487	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$487, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
	.dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
DW$488	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$488, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
	.dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
DW$489	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$489, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
	.dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
DW$490	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$490, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
	.dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
DW$491	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$491, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
	.dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
DW$492	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$492, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
	.dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
DW$493	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$493, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
	.dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
DW$494	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$494, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
	.dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
DW$495	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$495, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
DW$496	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$496, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
DW$497	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$497, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
DW$498	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$498, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
DW$499	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$499, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
DW$500	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$500, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
DW$501	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$501, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
DW$502	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$502, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
DW$503	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$503, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$54


DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$55, DW_AT_name("tag_mancalstruct")
	.dwattr DW$T$55, DW_AT_byte_size(0x04)
DW$504	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$504, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
	.dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
DW$505	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$505, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
	.dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
DW$506	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$506, DW_AT_name("percentleft"), DW_AT_symbol_name("_percentleft")
	.dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
DW$507	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$507, DW_AT_name("manupdateflag"), DW_AT_symbol_name("_manupdateflag")
	.dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$55


DW$T$23	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$23, DW_AT_byte_size(0x02)
DW$508	.dwtag  DW_TAG_subrange_type
	.dwattr DW$508, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$23


DW$T$52	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$52, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$52, DW_AT_byte_size(0x54)
DW$509	.dwtag  DW_TAG_subrange_type
	.dwattr DW$509, DW_AT_upper_bound(0x02)
DW$510	.dwtag  DW_TAG_subrange_type
	.dwattr DW$510, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$52


DW$T$25	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$25, DW_AT_byte_size(0x0e)
DW$511	.dwtag  DW_TAG_subrange_type
	.dwattr DW$511, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$25


DW$T$45	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$45, DW_AT_byte_size(0x06)
DW$512	.dwtag  DW_TAG_subrange_type
	.dwattr DW$512, DW_AT_upper_bound(0x02)
DW$513	.dwtag  DW_TAG_subrange_type
	.dwattr DW$513, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$45


DW$T$50	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$50, DW_AT_byte_size(0x03)
DW$514	.dwtag  DW_TAG_subrange_type
	.dwattr DW$514, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$50

DW$T$12	.dwtag  DW_TAG_base_type, DW_AT_name("long")
	.dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$12, DW_AT_byte_size(0x02)

DW$T$49	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$49, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$49, DW_AT_byte_size(0xa8)
DW$515	.dwtag  DW_TAG_subrange_type
	.dwattr DW$515, DW_AT_upper_bound(0x02)
DW$516	.dwtag  DW_TAG_subrange_type
	.dwattr DW$516, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$49


DW$T$46	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$46, DW_AT_byte_size(0x06)
DW$517	.dwtag  DW_TAG_subrange_type
	.dwattr DW$517, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$46


DW$T$47	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$47, DW_AT_byte_size(0x12c)
DW$518	.dwtag  DW_TAG_subrange_type
	.dwattr DW$518, DW_AT_upper_bound(0x95)
	.dwendtag DW$T$47


DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$19, DW_AT_name("tag_status1struct")
	.dwattr DW$T$19, DW_AT_byte_size(0x01)
DW$519	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$519, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$519, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$519, DW_AT_accessibility(DW_ACCESS_public)
DW$520	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$520, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
	.dwattr DW$520, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
DW$521	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$521, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
	.dwattr DW$521, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
DW$522	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$522, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$522, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
DW$523	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$523, DW_AT_name("replaced"), DW_AT_symbol_name("_replaced")
	.dwattr DW$523, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
DW$524	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$524, DW_AT_name("excludeslowroll"), DW_AT_symbol_name("_excludeslowroll")
	.dwattr DW$524, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
DW$525	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$525, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$525, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
DW$526	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$526, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$526, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
DW$527	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$527, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$527, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$527, DW_AT_accessibility(DW_ACCESS_public)
DW$528	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$528, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
	.dwattr DW$528, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$528, DW_AT_accessibility(DW_ACCESS_public)
DW$529	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$529, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
	.dwattr DW$529, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$529, DW_AT_accessibility(DW_ACCESS_public)
DW$530	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$530, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
	.dwattr DW$530, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$530, DW_AT_accessibility(DW_ACCESS_public)
DW$531	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$531, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$531, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$531, DW_AT_accessibility(DW_ACCESS_public)
DW$532	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$532, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$532, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$532, DW_AT_accessibility(DW_ACCESS_public)
DW$533	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$533, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$533, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$533, DW_AT_accessibility(DW_ACCESS_public)
DW$534	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$534, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$534, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$19


DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_name("tag_sensoralarmstruct")
	.dwattr DW$T$20, DW_AT_byte_size(0x01)
DW$535	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$535, DW_AT_name("failure"), DW_AT_symbol_name("_failure")
	.dwattr DW$535, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$535, DW_AT_accessibility(DW_ACCESS_public)
DW$536	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$536, DW_AT_name("failurelatched"), DW_AT_symbol_name("_failurelatched")
	.dwattr DW$536, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$536, DW_AT_accessibility(DW_ACCESS_public)
DW$537	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$537, DW_AT_name("slowdown"), DW_AT_symbol_name("_slowdown")
	.dwattr DW$537, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$537, DW_AT_accessibility(DW_ACCESS_public)
DW$538	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$538, DW_AT_name("slowdownlatched"), DW_AT_symbol_name("_slowdownlatched")
	.dwattr DW$538, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$538, DW_AT_accessibility(DW_ACCESS_public)
DW$539	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$539, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
	.dwattr DW$539, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$539, DW_AT_accessibility(DW_ACCESS_public)
DW$540	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$540, DW_AT_name("alarmlatched"), DW_AT_symbol_name("_alarmlatched")
	.dwattr DW$540, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$540, DW_AT_accessibility(DW_ACCESS_public)
DW$541	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$541, DW_AT_name("devalarm"), DW_AT_symbol_name("_devalarm")
	.dwattr DW$541, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$541, DW_AT_accessibility(DW_ACCESS_public)
DW$542	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$542, DW_AT_name("devalarmlatched"), DW_AT_symbol_name("_devalarmlatched")
	.dwattr DW$542, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$542, DW_AT_accessibility(DW_ACCESS_public)
DW$543	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$543, DW_AT_name("devslow"), DW_AT_symbol_name("_devslow")
	.dwattr DW$543, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$543, DW_AT_accessibility(DW_ACCESS_public)
DW$544	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$544, DW_AT_name("devslowlatched"), DW_AT_symbol_name("_devslowlatched")
	.dwattr DW$544, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$544, DW_AT_accessibility(DW_ACCESS_public)
DW$545	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$545, DW_AT_name("calibration"), DW_AT_symbol_name("_calibration")
	.dwattr DW$545, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$545, DW_AT_accessibility(DW_ACCESS_public)
DW$546	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$546, DW_AT_name("calibrationlatched"), DW_AT_symbol_name("_calibrationlatched")
	.dwattr DW$546, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$546, DW_AT_accessibility(DW_ACCESS_public)
DW$547	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$547, DW_AT_name("prewarning"), DW_AT_symbol_name("_prewarning")
	.dwattr DW$547, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$547, DW_AT_accessibility(DW_ACCESS_public)
DW$548	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$548, DW_AT_name("prewarninglatched"), DW_AT_symbol_name("_prewarninglatched")
	.dwattr DW$548, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$548, DW_AT_accessibility(DW_ACCESS_public)
DW$549	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$549, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$549, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$549, DW_AT_accessibility(DW_ACCESS_public)
DW$550	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$550, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$550, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20


DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$21, DW_AT_byte_size(0x02)
DW$551	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$551, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
	.dwattr DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$551, DW_AT_accessibility(DW_ACCESS_public)
DW$552	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$552, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
	.dwattr DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$21


DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$26, DW_AT_name("tag_timers")
	.dwattr DW$T$26, DW_AT_byte_size(0x4c)
DW$553	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$553, DW_AT_name("update"), DW_AT_symbol_name("_update")
	.dwattr DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$553, DW_AT_accessibility(DW_ACCESS_public)
DW$554	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$554, DW_AT_name("general"), DW_AT_symbol_name("_general")
	.dwattr DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$554, DW_AT_accessibility(DW_ACCESS_public)
DW$555	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$555, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
	.dwattr DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$555, DW_AT_accessibility(DW_ACCESS_public)
DW$556	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$556, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
	.dwattr DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$556, DW_AT_accessibility(DW_ACCESS_public)
DW$557	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$557, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
	.dwattr DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$557, DW_AT_accessibility(DW_ACCESS_public)
DW$558	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$558, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
	.dwattr DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$558, DW_AT_accessibility(DW_ACCESS_public)
DW$559	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$559, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
	.dwattr DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$559, DW_AT_accessibility(DW_ACCESS_public)
DW$560	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$560, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
	.dwattr DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$560, DW_AT_accessibility(DW_ACCESS_public)
DW$561	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$561, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
	.dwattr DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$561, DW_AT_accessibility(DW_ACCESS_public)
DW$562	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$562, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
	.dwattr DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$562, DW_AT_accessibility(DW_ACCESS_public)
DW$563	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$563, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
	.dwattr DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$563, DW_AT_accessibility(DW_ACCESS_public)
DW$564	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$564, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
	.dwattr DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$564, DW_AT_accessibility(DW_ACCESS_public)
DW$565	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$565, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
	.dwattr DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$565, DW_AT_accessibility(DW_ACCESS_public)
DW$566	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$566, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
	.dwattr DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$566, DW_AT_accessibility(DW_ACCESS_public)
DW$567	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$567, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
	.dwattr DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$567, DW_AT_accessibility(DW_ACCESS_public)
DW$568	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$568, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$568, DW_AT_accessibility(DW_ACCESS_public)
DW$569	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$569, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
	.dwattr DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$569, DW_AT_accessibility(DW_ACCESS_public)
DW$570	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$570, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
	.dwattr DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$570, DW_AT_accessibility(DW_ACCESS_public)
DW$571	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$571, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$571, DW_AT_accessibility(DW_ACCESS_public)
DW$572	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$572, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
	.dwattr DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$572, DW_AT_accessibility(DW_ACCESS_public)
DW$573	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$573, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
	.dwattr DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$573, DW_AT_accessibility(DW_ACCESS_public)
DW$574	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$574, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
	.dwattr DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$574, DW_AT_accessibility(DW_ACCESS_public)
DW$575	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$575, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
	.dwattr DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr DW$575, DW_AT_accessibility(DW_ACCESS_public)
DW$576	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$576, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
	.dwattr DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$576, DW_AT_accessibility(DW_ACCESS_public)
DW$577	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$577, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
	.dwattr DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr DW$577, DW_AT_accessibility(DW_ACCESS_public)
DW$578	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$578, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
	.dwattr DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$578, DW_AT_accessibility(DW_ACCESS_public)
DW$579	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$579, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
	.dwattr DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr DW$579, DW_AT_accessibility(DW_ACCESS_public)
DW$580	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$580, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
	.dwattr DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$580, DW_AT_accessibility(DW_ACCESS_public)
DW$581	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$581, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
	.dwattr DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr DW$581, DW_AT_accessibility(DW_ACCESS_public)
DW$582	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$582, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
	.dwattr DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$582, DW_AT_accessibility(DW_ACCESS_public)
DW$583	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$583, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
	.dwattr DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$583, DW_AT_accessibility(DW_ACCESS_public)
DW$584	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$584, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
	.dwattr DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$584, DW_AT_accessibility(DW_ACCESS_public)
DW$585	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$585, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
	.dwattr DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr DW$585, DW_AT_accessibility(DW_ACCESS_public)
DW$586	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$586, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
	.dwattr DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$586, DW_AT_accessibility(DW_ACCESS_public)
DW$587	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$587, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr DW$587, DW_AT_accessibility(DW_ACCESS_public)
DW$588	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$588, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
	.dwattr DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr DW$588, DW_AT_accessibility(DW_ACCESS_public)
DW$589	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$589, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
	.dwattr DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr DW$589, DW_AT_accessibility(DW_ACCESS_public)
DW$590	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$590, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
	.dwattr DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$590, DW_AT_accessibility(DW_ACCESS_public)
DW$591	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$591, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
	.dwattr DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr DW$591, DW_AT_accessibility(DW_ACCESS_public)
DW$592	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$592, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
	.dwattr DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$592, DW_AT_accessibility(DW_ACCESS_public)
DW$593	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$593, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
	.dwattr DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr DW$593, DW_AT_accessibility(DW_ACCESS_public)
DW$594	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$594, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
	.dwattr DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$594, DW_AT_accessibility(DW_ACCESS_public)
DW$595	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$595, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
	.dwattr DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$26


DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$27, DW_AT_byte_size(0x01)
DW$596	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$596, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
	.dwattr DW$596, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$596, DW_AT_accessibility(DW_ACCESS_public)
DW$597	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$597, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
	.dwattr DW$597, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$597, DW_AT_accessibility(DW_ACCESS_public)
DW$598	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$598, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
	.dwattr DW$598, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$598, DW_AT_accessibility(DW_ACCESS_public)
DW$599	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$599, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
	.dwattr DW$599, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$599, DW_AT_accessibility(DW_ACCESS_public)
DW$600	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$600, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
	.dwattr DW$600, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$27


DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$28, DW_AT_byte_size(0x01)
DW$601	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$601, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
	.dwattr DW$601, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$601, DW_AT_accessibility(DW_ACCESS_public)
DW$602	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$602, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
	.dwattr DW$602, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
	.dwattr DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$28


DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$32, DW_AT_name("tag_sensorstruct")
	.dwattr DW$T$32, DW_AT_byte_size(0x12)
DW$603	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$603, DW_AT_name("status1"), DW_AT_symbol_name("_status1")
	.dwattr DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$603, DW_AT_accessibility(DW_ACCESS_public)
DW$604	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$604, DW_AT_name("status2"), DW_AT_symbol_name("_status2")
	.dwattr DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$604, DW_AT_accessibility(DW_ACCESS_public)
DW$605	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$605, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
	.dwattr DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$605, DW_AT_accessibility(DW_ACCESS_public)
DW$606	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$606, DW_AT_name("val"), DW_AT_symbol_name("_val")
	.dwattr DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$606, DW_AT_accessibility(DW_ACCESS_public)
DW$607	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$607, DW_AT_name("immediateval"), DW_AT_symbol_name("_immediateval")
	.dwattr DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$607, DW_AT_accessibility(DW_ACCESS_public)
DW$608	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$608, DW_AT_name("initialval"), DW_AT_symbol_name("_initialval")
	.dwattr DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$608, DW_AT_accessibility(DW_ACCESS_public)
DW$609	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$609, DW_AT_name("precomp"), DW_AT_symbol_name("_precomp")
	.dwattr DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$609, DW_AT_accessibility(DW_ACCESS_public)
DW$610	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$610, DW_AT_name("postcomp"), DW_AT_symbol_name("_postcomp")
	.dwattr DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$610, DW_AT_accessibility(DW_ACCESS_public)
DW$611	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$611, DW_AT_name("postfilter"), DW_AT_symbol_name("_postfilter")
	.dwattr DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$611, DW_AT_accessibility(DW_ACCESS_public)
DW$612	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$612, DW_AT_name("endresult"), DW_AT_symbol_name("_endresult")
	.dwattr DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$612, DW_AT_accessibility(DW_ACCESS_public)
DW$613	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$613, DW_AT_name("deviation"), DW_AT_symbol_name("_deviation")
	.dwattr DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$613, DW_AT_accessibility(DW_ACCESS_public)
DW$614	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$614, DW_AT_name("min"), DW_AT_symbol_name("_min")
	.dwattr DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$614, DW_AT_accessibility(DW_ACCESS_public)
DW$615	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$615, DW_AT_name("max"), DW_AT_symbol_name("_max")
	.dwattr DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$615, DW_AT_accessibility(DW_ACCESS_public)
DW$616	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$616, DW_AT_name("devmin"), DW_AT_symbol_name("_devmin")
	.dwattr DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$616, DW_AT_accessibility(DW_ACCESS_public)
DW$617	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$617, DW_AT_name("devmax"), DW_AT_symbol_name("_devmax")
	.dwattr DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$617, DW_AT_accessibility(DW_ACCESS_public)
DW$618	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$618, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$618, DW_AT_accessibility(DW_ACCESS_public)
DW$619	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$619, DW_AT_name("prt"), DW_AT_symbol_name("_prt")
	.dwattr DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$32


DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$33, DW_AT_byte_size(0x08)
DW$620	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$620, DW_AT_name("applyoffset"), DW_AT_symbol_name("_applyoffset")
	.dwattr DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$620, DW_AT_accessibility(DW_ACCESS_public)
DW$621	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$621, DW_AT_name("sensorcompensation"), DW_AT_symbol_name("_sensorcompensation")
	.dwattr DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$621, DW_AT_accessibility(DW_ACCESS_public)
DW$622	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$622, DW_AT_name("sensornoiseremoval"), DW_AT_symbol_name("_sensornoiseremoval")
	.dwattr DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$622, DW_AT_accessibility(DW_ACCESS_public)
DW$623	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$623, DW_AT_name("sensordeviation"), DW_AT_symbol_name("_sensordeviation")
	.dwattr DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$623, DW_AT_accessibility(DW_ACCESS_public)
DW$624	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$624, DW_AT_name("cylinderaverage"), DW_AT_symbol_name("_cylinderaverage")
	.dwattr DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$624, DW_AT_accessibility(DW_ACCESS_public)
DW$625	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$625, DW_AT_name("cylinderdeviation"), DW_AT_symbol_name("_cylinderdeviation")
	.dwattr DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$625, DW_AT_accessibility(DW_ACCESS_public)
DW$626	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$626, DW_AT_name("useroughcal"), DW_AT_symbol_name("_useroughcal")
	.dwattr DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$626, DW_AT_accessibility(DW_ACCESS_public)
DW$627	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$627, DW_AT_name("vincheckenabled"), DW_AT_symbol_name("_vincheckenabled")
	.dwattr DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$627, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$33


DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$35, DW_AT_name("tag_manrefstruct")
	.dwattr DW$T$35, DW_AT_byte_size(0x0a)
DW$628	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$628, DW_AT_name("reflevel"), DW_AT_symbol_name("_reflevel")
	.dwattr DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$628, DW_AT_accessibility(DW_ACCESS_public)
DW$629	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$629, DW_AT_name("presentstate"), DW_AT_symbol_name("_presentstate")
	.dwattr DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$629, DW_AT_accessibility(DW_ACCESS_public)
DW$630	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$630, DW_AT_name("refvalue"), DW_AT_symbol_name("_refvalue")
	.dwattr DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$630, DW_AT_accessibility(DW_ACCESS_public)
DW$631	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$631, DW_AT_name("reflevel_int"), DW_AT_symbol_name("_reflevel_int")
	.dwattr DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$631, DW_AT_accessibility(DW_ACCESS_public)
DW$632	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$632, DW_AT_name("presentstate_int"), DW_AT_symbol_name("_presentstate_int")
	.dwattr DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$632, DW_AT_accessibility(DW_ACCESS_public)
DW$633	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$633, DW_AT_name("refvalue_int"), DW_AT_symbol_name("_refvalue_int")
	.dwattr DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$35


DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$36, DW_AT_name("tag_manrefsumstruct")
	.dwattr DW$T$36, DW_AT_byte_size(0x02)
DW$634	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$634, DW_AT_name("cylsum"), DW_AT_symbol_name("_cylsum")
	.dwattr DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$634, DW_AT_accessibility(DW_ACCESS_public)
DW$635	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$635, DW_AT_name("mbnsum"), DW_AT_symbol_name("_mbnsum")
	.dwattr DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$36


DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$40, DW_AT_name("tag_sdcarddirstruct")
	.dwattr DW$T$40, DW_AT_byte_size(0x36)
DW$636	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$636, DW_AT_name("firstcaldir"), DW_AT_symbol_name("_firstcaldir")
	.dwattr DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$636, DW_AT_accessibility(DW_ACCESS_public)
DW$637	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$637, DW_AT_name("roughcaldir"), DW_AT_symbol_name("_roughcaldir")
	.dwattr DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$637, DW_AT_accessibility(DW_ACCESS_public)
DW$638	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$638, DW_AT_name("finecaldir"), DW_AT_symbol_name("_finecaldir")
	.dwattr DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$638, DW_AT_accessibility(DW_ACCESS_public)
DW$639	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$639, DW_AT_name("configdir"), DW_AT_symbol_name("_configdir")
	.dwattr DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$639, DW_AT_accessibility(DW_ACCESS_public)
DW$640	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$640, DW_AT_name("sterm"), DW_AT_symbol_name("_sterm")
	.dwattr DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$640, DW_AT_accessibility(DW_ACCESS_public)
DW$641	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$641, DW_AT_name("lterm"), DW_AT_symbol_name("_lterm")
	.dwattr DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$40


DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$41, DW_AT_byte_size(0x01)
DW$642	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$642, DW_AT_name("settings"), DW_AT_symbol_name("_settings")
	.dwattr DW$642, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$642, DW_AT_accessibility(DW_ACCESS_public)
DW$643	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$643, DW_AT_name("sensorstatus"), DW_AT_symbol_name("_sensorstatus")
	.dwattr DW$643, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$643, DW_AT_accessibility(DW_ACCESS_public)
DW$644	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$644, DW_AT_name("offsets"), DW_AT_symbol_name("_offsets")
	.dwattr DW$644, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$644, DW_AT_accessibility(DW_ACCESS_public)
DW$645	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$645, DW_AT_name("mantable"), DW_AT_symbol_name("_mantable")
	.dwattr DW$645, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$645, DW_AT_accessibility(DW_ACCESS_public)
DW$646	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$646, DW_AT_name("calibtd"), DW_AT_symbol_name("_calibtd")
	.dwattr DW$646, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$646, DW_AT_accessibility(DW_ACCESS_public)
DW$647	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$647, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$647, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$647, DW_AT_accessibility(DW_ACCESS_public)
DW$648	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$648, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$648, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$648, DW_AT_accessibility(DW_ACCESS_public)
DW$649	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$649, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$649, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$649, DW_AT_accessibility(DW_ACCESS_public)
DW$650	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$650, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$650, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$650, DW_AT_accessibility(DW_ACCESS_public)
DW$651	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$651, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
	.dwattr DW$651, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$651, DW_AT_accessibility(DW_ACCESS_public)
DW$652	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$652, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
	.dwattr DW$652, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$652, DW_AT_accessibility(DW_ACCESS_public)
DW$653	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$653, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
	.dwattr DW$653, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$653, DW_AT_accessibility(DW_ACCESS_public)
DW$654	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$654, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$654, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$654, DW_AT_accessibility(DW_ACCESS_public)
DW$655	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$655, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$655, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$655, DW_AT_accessibility(DW_ACCESS_public)
DW$656	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$656, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$656, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$656, DW_AT_accessibility(DW_ACCESS_public)
DW$657	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$657, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$657, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$41


DW$T$39	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$38)
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$39, DW_AT_byte_size(0x09)
DW$658	.dwtag  DW_TAG_subrange_type
	.dwattr DW$658, DW_AT_upper_bound(0x08)
	.dwendtag DW$T$39


	.dwattr DW$141, DW_AT_external(0x01)
	.dwattr DW$87, DW_AT_external(0x01)
	.dwattr DW$156, DW_AT_external(0x01)
	.dwattr DW$207, DW_AT_external(0x01)
	.dwattr DW$256, DW_AT_external(0x01)
	.dwattr DW$259, DW_AT_external(0x01)
	.dwattr DW$194, DW_AT_external(0x01)
	.dwattr DW$237, DW_AT_external(0x01)
	.dwattr DW$262, DW_AT_external(0x01)
	.dwattr DW$161, DW_AT_external(0x01)
	.dwattr DW$118, DW_AT_external(0x01)
	.dwattr DW$118, DW_AT_type(*DW$T$11)
	.dwattr DW$117, DW_AT_external(0x01)
	.dwattr DW$117, DW_AT_type(*DW$T$11)
	.dwattr DW$116, DW_AT_external(0x01)
	.dwattr DW$116, DW_AT_type(*DW$T$11)
	.dwattr DW$123, DW_AT_external(0x01)
	.dwattr DW$186, DW_AT_external(0x01)
	.dwattr DW$251, DW_AT_external(0x01)
	.dwattr DW$140, DW_AT_external(0x01)
	.dwattr DW$119, DW_AT_external(0x01)
	.dwattr DW$90, DW_AT_external(0x01)
	.dwattr DW$91, DW_AT_external(0x01)
	.dwattr DW$91, DW_AT_type(*DW$T$116)
	.dwattr DW$103, DW_AT_external(0x01)
	.dwattr DW$94, DW_AT_external(0x01)
	.dwattr DW$94, DW_AT_type(*DW$T$116)
	.dwattr DW$113, DW_AT_external(0x01)
	.dwattr DW$109, DW_AT_external(0x01)
	.dwattr DW$109, DW_AT_type(*DW$T$10)
	.dwattr DW$115, DW_AT_external(0x01)
	.dwattr DW$97, DW_AT_external(0x01)
	.dwattr DW$97, DW_AT_type(*DW$T$118)
	.dwattr DW$100, DW_AT_external(0x01)
	.dwattr DW$152, DW_AT_external(0x01)
	.dwattr DW$155, DW_AT_external(0x01)
	.dwattr DW$168, DW_AT_external(0x01)
	.dwattr DW$122, DW_AT_external(0x01)
	.dwattr DW$177, DW_AT_external(0x01)
	.dwattr DW$101, DW_AT_external(0x01)
	.dwattr DW$112, DW_AT_external(0x01)
	.dwattr DW$105, DW_AT_external(0x01)
	.dwattr DW$114, DW_AT_external(0x01)
	.dwattr DW$99, DW_AT_external(0x01)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$659	.dwtag  DW_TAG_assign_register, DW_AT_name("AL")
	.dwattr DW$659, DW_AT_location[DW_OP_reg0]
DW$660	.dwtag  DW_TAG_assign_register, DW_AT_name("AH")
	.dwattr DW$660, DW_AT_location[DW_OP_reg1]
DW$661	.dwtag  DW_TAG_assign_register, DW_AT_name("PL")
	.dwattr DW$661, DW_AT_location[DW_OP_reg2]
DW$662	.dwtag  DW_TAG_assign_register, DW_AT_name("PH")
	.dwattr DW$662, DW_AT_location[DW_OP_reg3]
DW$663	.dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
	.dwattr DW$663, DW_AT_location[DW_OP_reg4]
DW$664	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
	.dwattr DW$664, DW_AT_location[DW_OP_reg5]
DW$665	.dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
	.dwattr DW$665, DW_AT_location[DW_OP_reg6]
DW$666	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
	.dwattr DW$666, DW_AT_location[DW_OP_reg7]
DW$667	.dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
	.dwattr DW$667, DW_AT_location[DW_OP_reg8]
DW$668	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
	.dwattr DW$668, DW_AT_location[DW_OP_reg9]
DW$669	.dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
	.dwattr DW$669, DW_AT_location[DW_OP_reg10]
DW$670	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
	.dwattr DW$670, DW_AT_location[DW_OP_reg11]
DW$671	.dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
	.dwattr DW$671, DW_AT_location[DW_OP_reg12]
DW$672	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
	.dwattr DW$672, DW_AT_location[DW_OP_reg13]
DW$673	.dwtag  DW_TAG_assign_register, DW_AT_name("AR5")
	.dwattr DW$673, DW_AT_location[DW_OP_reg14]
DW$674	.dwtag  DW_TAG_assign_register, DW_AT_name("XAR5")
	.dwattr DW$674, DW_AT_location[DW_OP_reg15]
