;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Thu Aug 18 12:16:24 2016                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("PCModBus.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("sprintf"), DW_AT_symbol_name("_sprintf")
	.dwattr DW$1, DW_AT_type(*DW$T$10)
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$119)
DW$3	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
DW$4	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$1


DW$5	.dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
	.dwattr DW$5, DW_AT_type(*DW$T$3)
	.dwattr DW$5, DW_AT_declaration(0x01)
	.dwattr DW$5, DW_AT_external(0x01)
DW$6	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$7	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$8	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$115)
	.dwendtag DW$5



DW$T$226	.dwtag  DW_TAG_typedef, DW_AT_name("safestruct2struct"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$226, DW_AT_language(DW_LANG_C)
DW$T$227	.dwtag  DW_TAG_typedef, DW_AT_name("clockstruct"), DW_AT_type(*DW$T$47)
	.dwattr DW$T$227, DW_AT_language(DW_LANG_C)
DW$881	.dwtag  DW_TAG_far_type
	.dwattr DW$881, DW_AT_type(*DW$T$228)
DW$T$229	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$229, DW_AT_type(*DW$881)
DW$T$231	.dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$52)
	.dwattr DW$T$231, DW_AT_language(DW_LANG_C)
DW$T$233	.dwtag  DW_TAG_typedef, DW_AT_name("enginestruct"), DW_AT_type(*DW$T$53)
	.dwattr DW$T$233, DW_AT_language(DW_LANG_C)

DW$T$235	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$234)
	.dwattr DW$T$235, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$235, DW_AT_byte_size(0x38)
DW$882	.dwtag  DW_TAG_subrange_type
	.dwattr DW$882, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$235

DW$T$238	.dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$63)
	.dwattr DW$T$238, DW_AT_language(DW_LANG_C)
DW$T$239	.dwtag  DW_TAG_typedef, DW_AT_name("eventlogstruct"), DW_AT_type(*DW$T$68)
	.dwattr DW$T$239, DW_AT_language(DW_LANG_C)
DW$T$240	.dwtag  DW_TAG_typedef, DW_AT_name("digoutstruct"), DW_AT_type(*DW$T$69)
	.dwattr DW$T$240, DW_AT_language(DW_LANG_C)
DW$T$241	.dwtag  DW_TAG_typedef, DW_AT_name("prewarnstruct"), DW_AT_type(*DW$T$72)
	.dwattr DW$T$241, DW_AT_language(DW_LANG_C)
DW$T$243	.dwtag  DW_TAG_typedef, DW_AT_name("offsetstruct"), DW_AT_type(*DW$T$73)
	.dwattr DW$T$243, DW_AT_language(DW_LANG_C)

DW$T$246	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$245)
	.dwattr DW$T$246, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$246, DW_AT_byte_size(0x1f8)
DW$883	.dwtag  DW_TAG_subrange_type
	.dwattr DW$883, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$246

DW$T$249	.dwtag  DW_TAG_typedef, DW_AT_name("functionstruct"), DW_AT_type(*DW$T$78)
	.dwattr DW$T$249, DW_AT_language(DW_LANG_C)

DW$T$252	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$251)
	.dwattr DW$T$252, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$252, DW_AT_byte_size(0x118)
DW$884	.dwtag  DW_TAG_subrange_type
	.dwattr DW$884, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$252


DW$T$256	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$255)
	.dwattr DW$T$256, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$256, DW_AT_byte_size(0x1c)
DW$885	.dwtag  DW_TAG_subrange_type
	.dwattr DW$885, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$256

DW$T$259	.dwtag  DW_TAG_typedef, DW_AT_name("dynamicalarmsstruct"), DW_AT_type(*DW$T$81)
	.dwattr DW$T$259, DW_AT_language(DW_LANG_C)
DW$T$260	.dwtag  DW_TAG_typedef, DW_AT_name("damalarmsstruct"), DW_AT_type(*DW$T$83)
	.dwattr DW$T$260, DW_AT_language(DW_LANG_C)
DW$T$262	.dwtag  DW_TAG_typedef, DW_AT_name("mancalstruct"), DW_AT_type(*DW$T$84)
	.dwattr DW$T$262, DW_AT_language(DW_LANG_C)
DW$T$263	.dwtag  DW_TAG_typedef, DW_AT_name("calibrationstruct"), DW_AT_type(*DW$T$91)
	.dwattr DW$T$263, DW_AT_language(DW_LANG_C)
DW$T$265	.dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$92)
	.dwattr DW$T$265, DW_AT_language(DW_LANG_C)
DW$T$96	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$96, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$96, DW_AT_byte_size(0x01)
DW$T$119	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$96)
	.dwattr DW$T$119, DW_AT_address_class(0x16)
DW$T$146	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$145)
	.dwattr DW$T$146, DW_AT_address_class(0x16)

DW$T$266	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$96)
	.dwattr DW$T$266, DW_AT_language(DW_LANG_C)

DW$T$267	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$96)
	.dwattr DW$T$267, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$267, DW_AT_byte_size(0x64)
DW$886	.dwtag  DW_TAG_subrange_type
	.dwattr DW$886, DW_AT_upper_bound(0x63)
	.dwendtag DW$T$267

DW$T$270	.dwtag  DW_TAG_typedef, DW_AT_name("sdfilestruct"), DW_AT_type(*DW$T$99)
	.dwattr DW$T$270, DW_AT_language(DW_LANG_C)
DW$T$272	.dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$101)
	.dwattr DW$T$272, DW_AT_language(DW_LANG_C)
DW$T$273	.dwtag  DW_TAG_typedef, DW_AT_name("waterinoilstruct"), DW_AT_type(*DW$T$104)
	.dwattr DW$T$273, DW_AT_language(DW_LANG_C)
DW$T$275	.dwtag  DW_TAG_typedef, DW_AT_name("bearingstatusstruct"), DW_AT_type(*DW$T$106)
	.dwattr DW$T$275, DW_AT_language(DW_LANG_C)
DW$T$277	.dwtag  DW_TAG_typedef, DW_AT_name("slemstruct"), DW_AT_type(*DW$T$108)
	.dwattr DW$T$277, DW_AT_language(DW_LANG_C)
DW$T$279	.dwtag  DW_TAG_typedef, DW_AT_name("rtcbatstruct"), DW_AT_type(*DW$T$110)
	.dwattr DW$T$279, DW_AT_language(DW_LANG_C)
DW$T$281	.dwtag  DW_TAG_typedef, DW_AT_name("cppstruct"), DW_AT_type(*DW$T$111)
	.dwattr DW$T$281, DW_AT_language(DW_LANG_C)
DW$T$282	.dwtag  DW_TAG_typedef, DW_AT_name("PCCmdStruct"), DW_AT_type(*DW$T$113)
	.dwattr DW$T$282, DW_AT_language(DW_LANG_C)
DW$T$284	.dwtag  DW_TAG_typedef, DW_AT_name("modbusupdatestruct"), DW_AT_type(*DW$T$114)
	.dwattr DW$T$284, DW_AT_language(DW_LANG_C)
DW$T$136	.dwtag  DW_TAG_typedef, DW_AT_name("PtrTypeEnum"), DW_AT_type(*DW$T$135)
	.dwattr DW$T$136, DW_AT_language(DW_LANG_C)
DW$T$74	.dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$74, DW_AT_language(DW_LANG_C)
DW$T$75	.dwtag  DW_TAG_typedef, DW_AT_name("sensoralarmstruct"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$75, DW_AT_language(DW_LANG_C)
DW$T$204	.dwtag  DW_TAG_typedef, DW_AT_name("status3struct"), DW_AT_type(*DW$T$21)
	.dwattr DW$T$204, DW_AT_language(DW_LANG_C)
DW$T$210	.dwtag  DW_TAG_typedef, DW_AT_name("alarmsstruct"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$210, DW_AT_language(DW_LANG_C)
DW$T$216	.dwtag  DW_TAG_typedef, DW_AT_name("gpfport"), DW_AT_type(*DW$T$25)
	.dwattr DW$T$216, DW_AT_language(DW_LANG_C)

DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$27, DW_AT_name("tag_settingsstruct")
	.dwattr DW$T$27, DW_AT_byte_size(0x24)
DW$887	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$887, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
	.dwattr DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$887, DW_AT_accessibility(DW_ACCESS_public)
DW$888	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$888, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
	.dwattr DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$888, DW_AT_accessibility(DW_ACCESS_public)
DW$889	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$889, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
	.dwattr DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$889, DW_AT_accessibility(DW_ACCESS_public)
DW$890	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$890, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
	.dwattr DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$890, DW_AT_accessibility(DW_ACCESS_public)
DW$891	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$891, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
	.dwattr DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$891, DW_AT_accessibility(DW_ACCESS_public)
DW$892	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$892, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
	.dwattr DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$892, DW_AT_accessibility(DW_ACCESS_public)
DW$893	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$893, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
	.dwattr DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$893, DW_AT_accessibility(DW_ACCESS_public)
DW$894	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$894, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
	.dwattr DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$894, DW_AT_accessibility(DW_ACCESS_public)
DW$895	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$895, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
	.dwattr DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$895, DW_AT_accessibility(DW_ACCESS_public)
DW$896	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$896, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
	.dwattr DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$896, DW_AT_accessibility(DW_ACCESS_public)
DW$897	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$897, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
	.dwattr DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$897, DW_AT_accessibility(DW_ACCESS_public)
DW$898	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$898, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
	.dwattr DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$898, DW_AT_accessibility(DW_ACCESS_public)
DW$899	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$899, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
	.dwattr DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$899, DW_AT_accessibility(DW_ACCESS_public)
DW$900	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$900, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$900, DW_AT_accessibility(DW_ACCESS_public)
DW$901	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$901, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
	.dwattr DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$901, DW_AT_accessibility(DW_ACCESS_public)
DW$902	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$902, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
	.dwattr DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$902, DW_AT_accessibility(DW_ACCESS_public)
DW$903	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$903, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
	.dwattr DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$903, DW_AT_accessibility(DW_ACCESS_public)
DW$904	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$904, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
	.dwattr DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$904, DW_AT_accessibility(DW_ACCESS_public)
DW$905	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$905, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
	.dwattr DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$905, DW_AT_accessibility(DW_ACCESS_public)
DW$906	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$906, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$906, DW_AT_accessibility(DW_ACCESS_public)
DW$907	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$907, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
	.dwattr DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$907, DW_AT_accessibility(DW_ACCESS_public)
DW$908	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$908, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$908, DW_AT_accessibility(DW_ACCESS_public)
DW$909	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$909, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
	.dwattr DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$909, DW_AT_accessibility(DW_ACCESS_public)
DW$910	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$910, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
	.dwattr DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$910, DW_AT_accessibility(DW_ACCESS_public)
DW$911	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$911, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$911, DW_AT_accessibility(DW_ACCESS_public)
DW$912	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$912, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$912, DW_AT_accessibility(DW_ACCESS_public)
DW$913	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$913, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$913, DW_AT_accessibility(DW_ACCESS_public)
DW$914	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$914, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$914, DW_AT_accessibility(DW_ACCESS_public)
DW$915	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$915, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$915, DW_AT_accessibility(DW_ACCESS_public)
DW$916	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$916, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
	.dwattr DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$916, DW_AT_accessibility(DW_ACCESS_public)
DW$917	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$917, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
	.dwattr DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$917, DW_AT_accessibility(DW_ACCESS_public)
DW$918	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$918, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
	.dwattr DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$918, DW_AT_accessibility(DW_ACCESS_public)
DW$919	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$919, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
	.dwattr DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$919, DW_AT_accessibility(DW_ACCESS_public)
DW$920	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$920, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
	.dwattr DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$920, DW_AT_accessibility(DW_ACCESS_public)
DW$921	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$921, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$921, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$27


DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$29, DW_AT_name("tag_motionstruct")
	.dwattr DW$T$29, DW_AT_byte_size(0x09)
DW$922	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$922, DW_AT_name("counter"), DW_AT_symbol_name("_counter")
	.dwattr DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$922, DW_AT_accessibility(DW_ACCESS_public)
DW$923	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$923, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
	.dwattr DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$923, DW_AT_accessibility(DW_ACCESS_public)
DW$924	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$924, DW_AT_name("order"), DW_AT_symbol_name("_order")
	.dwattr DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$924, DW_AT_accessibility(DW_ACCESS_public)
DW$925	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$925, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$925, DW_AT_accessibility(DW_ACCESS_public)
DW$926	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$926, DW_AT_name("forwardasternflagprev"), DW_AT_symbol_name("_forwardasternflagprev")
	.dwattr DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$926, DW_AT_accessibility(DW_ACCESS_public)
DW$927	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$927, DW_AT_name("recalnow"), DW_AT_symbol_name("_recalnow")
	.dwattr DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$927, DW_AT_accessibility(DW_ACCESS_public)
DW$928	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$928, DW_AT_name("calerror"), DW_AT_symbol_name("_calerror")
	.dwattr DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$928, DW_AT_accessibility(DW_ACCESS_public)
DW$929	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$929, DW_AT_name("recheckdir"), DW_AT_symbol_name("_recheckdir")
	.dwattr DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$929, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$29


DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$30, DW_AT_name("tag_livestruct")
	.dwattr DW$T$30, DW_AT_byte_size(0x03)
DW$930	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$930, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
	.dwattr DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$930, DW_AT_accessibility(DW_ACCESS_public)
DW$931	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$931, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
	.dwattr DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$931, DW_AT_accessibility(DW_ACCESS_public)
DW$932	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$932, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
	.dwattr DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$932, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$30


DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$33, DW_AT_name("tag_calibrationdatetimestruct")
	.dwattr DW$T$33, DW_AT_byte_size(0x07)
DW$933	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$933, DW_AT_name("calcomplete"), DW_AT_symbol_name("_calcomplete")
	.dwattr DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$933, DW_AT_accessibility(DW_ACCESS_public)
DW$934	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$934, DW_AT_name("verification"), DW_AT_symbol_name("_verification")
	.dwattr DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$934, DW_AT_accessibility(DW_ACCESS_public)
DW$935	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$935, DW_AT_name("chksum"), DW_AT_symbol_name("_chksum")
	.dwattr DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$935, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$33


DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$46, DW_AT_name("tag_safestruct2struct")
	.dwattr DW$T$46, DW_AT_byte_size(0x1e)
DW$936	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
	.dwattr DW$936, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
	.dwattr DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$936, DW_AT_accessibility(DW_ACCESS_public)
DW$937	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$937, DW_AT_name("log"), DW_AT_symbol_name("_log")
	.dwattr DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$937, DW_AT_accessibility(DW_ACCESS_public)
DW$938	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$938, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
	.dwattr DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$938, DW_AT_accessibility(DW_ACCESS_public)
DW$939	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$939, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
	.dwattr DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$939, DW_AT_accessibility(DW_ACCESS_public)
DW$940	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$940, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
	.dwattr DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$940, DW_AT_accessibility(DW_ACCESS_public)
DW$941	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
	.dwattr DW$941, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
	.dwattr DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$941, DW_AT_accessibility(DW_ACCESS_public)
DW$942	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$942, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
	.dwattr DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$942, DW_AT_accessibility(DW_ACCESS_public)
DW$943	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
	.dwattr DW$943, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
	.dwattr DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$943, DW_AT_accessibility(DW_ACCESS_public)
DW$944	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
	.dwattr DW$944, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
	.dwattr DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$944, DW_AT_accessibility(DW_ACCESS_public)
DW$945	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$945, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
	.dwattr DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$945, DW_AT_accessibility(DW_ACCESS_public)
DW$946	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$946, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
	.dwattr DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$946, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$46


DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$47, DW_AT_name("tag_clockstruct")
	.dwattr DW$T$47, DW_AT_byte_size(0x0e)
DW$947	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$947, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
	.dwattr DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$947, DW_AT_accessibility(DW_ACCESS_public)
DW$948	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$948, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
	.dwattr DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$948, DW_AT_accessibility(DW_ACCESS_public)
DW$949	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$949, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
	.dwattr DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$949, DW_AT_accessibility(DW_ACCESS_public)
DW$950	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$950, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
	.dwattr DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$950, DW_AT_accessibility(DW_ACCESS_public)
DW$951	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$951, DW_AT_name("day"), DW_AT_symbol_name("_day")
	.dwattr DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$951, DW_AT_accessibility(DW_ACCESS_public)
DW$952	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$952, DW_AT_name("date"), DW_AT_symbol_name("_date")
	.dwattr DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$952, DW_AT_accessibility(DW_ACCESS_public)
DW$953	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$953, DW_AT_name("month"), DW_AT_symbol_name("_month")
	.dwattr DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$953, DW_AT_accessibility(DW_ACCESS_public)
DW$954	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$954, DW_AT_name("year"), DW_AT_symbol_name("_year")
	.dwattr DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$954, DW_AT_accessibility(DW_ACCESS_public)
DW$955	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$955, DW_AT_name("control"), DW_AT_symbol_name("_control")
	.dwattr DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$955, DW_AT_accessibility(DW_ACCESS_public)
DW$956	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$956, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
	.dwattr DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$956, DW_AT_accessibility(DW_ACCESS_public)
DW$957	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$957, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
	.dwattr DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$957, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$47

DW$T$228	.dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$49)
	.dwattr DW$T$228, DW_AT_language(DW_LANG_C)

DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$52, DW_AT_name("tag_allsensorstruct")
	.dwattr DW$T$52, DW_AT_byte_size(0x2d)
DW$958	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$958, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
	.dwattr DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$958, DW_AT_accessibility(DW_ACCESS_public)
DW$959	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$959, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
	.dwattr DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$959, DW_AT_accessibility(DW_ACCESS_public)
DW$960	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$960, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
	.dwattr DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$960, DW_AT_accessibility(DW_ACCESS_public)
DW$961	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$961, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
	.dwattr DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$961, DW_AT_accessibility(DW_ACCESS_public)
DW$962	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$962, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
	.dwattr DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$962, DW_AT_accessibility(DW_ACCESS_public)
DW$963	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$963, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
	.dwattr DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$963, DW_AT_accessibility(DW_ACCESS_public)
DW$964	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$964, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
	.dwattr DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$964, DW_AT_accessibility(DW_ACCESS_public)
DW$965	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$965, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
	.dwattr DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$965, DW_AT_accessibility(DW_ACCESS_public)
DW$966	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$966, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
	.dwattr DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$966, DW_AT_accessibility(DW_ACCESS_public)
DW$967	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$967, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$967, DW_AT_accessibility(DW_ACCESS_public)
DW$968	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$968, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$968, DW_AT_accessibility(DW_ACCESS_public)
DW$969	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$969, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
	.dwattr DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$969, DW_AT_accessibility(DW_ACCESS_public)
DW$970	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$970, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
	.dwattr DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$970, DW_AT_accessibility(DW_ACCESS_public)
DW$971	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$971, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$971, DW_AT_accessibility(DW_ACCESS_public)
DW$972	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$972, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$972, DW_AT_accessibility(DW_ACCESS_public)
DW$973	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$973, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$973, DW_AT_accessibility(DW_ACCESS_public)
DW$974	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$974, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
	.dwattr DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$974, DW_AT_accessibility(DW_ACCESS_public)
DW$975	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$975, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
	.dwattr DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$975, DW_AT_accessibility(DW_ACCESS_public)
DW$976	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$976, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
	.dwattr DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$976, DW_AT_accessibility(DW_ACCESS_public)
DW$977	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$977, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
	.dwattr DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$977, DW_AT_accessibility(DW_ACCESS_public)
DW$978	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$978, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
	.dwattr DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$978, DW_AT_accessibility(DW_ACCESS_public)
DW$979	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$979, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
	.dwattr DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$979, DW_AT_accessibility(DW_ACCESS_public)
DW$980	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$980, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
	.dwattr DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$980, DW_AT_accessibility(DW_ACCESS_public)
DW$981	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$981, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
	.dwattr DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$981, DW_AT_accessibility(DW_ACCESS_public)
DW$982	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$982, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
	.dwattr DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr DW$982, DW_AT_accessibility(DW_ACCESS_public)
DW$983	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$983, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
	.dwattr DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$983, DW_AT_accessibility(DW_ACCESS_public)
DW$984	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$984, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
	.dwattr DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$984, DW_AT_accessibility(DW_ACCESS_public)
DW$985	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$985, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
	.dwattr DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$985, DW_AT_accessibility(DW_ACCESS_public)
DW$986	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$986, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
	.dwattr DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$986, DW_AT_accessibility(DW_ACCESS_public)
DW$987	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$987, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$987, DW_AT_accessibility(DW_ACCESS_public)
DW$988	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$988, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow")
	.dwattr DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$988, DW_AT_accessibility(DW_ACCESS_public)
DW$989	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$989, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHigh")
	.dwattr DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$989, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$52


DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$53, DW_AT_name("tag_engingestruct")
	.dwattr DW$T$53, DW_AT_byte_size(0x02)
DW$990	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$990, DW_AT_name("runtime"), DW_AT_symbol_name("_runtime")
	.dwattr DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$990, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$53

DW$T$234	.dwtag  DW_TAG_typedef, DW_AT_name("cylinderstruct"), DW_AT_type(*DW$T$56)
	.dwattr DW$T$234, DW_AT_language(DW_LANG_C)

DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$63, DW_AT_name("tag_configstruct")
	.dwattr DW$T$63, DW_AT_byte_size(0x18)
DW$991	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
	.dwattr DW$991, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
	.dwattr DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$991, DW_AT_accessibility(DW_ACCESS_public)
DW$992	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
	.dwattr DW$992, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
	.dwattr DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$992, DW_AT_accessibility(DW_ACCESS_public)
DW$993	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$993, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
	.dwattr DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$993, DW_AT_accessibility(DW_ACCESS_public)
DW$994	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
	.dwattr DW$994, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
	.dwattr DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$994, DW_AT_accessibility(DW_ACCESS_public)
DW$995	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
	.dwattr DW$995, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
	.dwattr DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$995, DW_AT_accessibility(DW_ACCESS_public)
DW$996	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
	.dwattr DW$996, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
	.dwattr DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$996, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$63


DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$68, DW_AT_name("tag_eventlogstruct")
	.dwattr DW$T$68, DW_AT_byte_size(0x44)
DW$997	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$997, DW_AT_name("eventid"), DW_AT_symbol_name("_eventid")
	.dwattr DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$997, DW_AT_accessibility(DW_ACCESS_public)
DW$998	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$998, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
	.dwattr DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$998, DW_AT_accessibility(DW_ACCESS_public)
DW$999	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
	.dwattr DW$999, DW_AT_name("msgstring"), DW_AT_symbol_name("_msgstring")
	.dwattr DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$999, DW_AT_accessibility(DW_ACCESS_public)
DW$1000	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$1000, DW_AT_name("msgstring2"), DW_AT_symbol_name("_msgstring2")
	.dwattr DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$1000, DW_AT_accessibility(DW_ACCESS_public)
DW$1001	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$1001, DW_AT_name("ackdatetime"), DW_AT_symbol_name("_ackdatetime")
	.dwattr DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr DW$1001, DW_AT_accessibility(DW_ACCESS_public)
DW$1002	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
	.dwattr DW$1002, DW_AT_name("ackstring"), DW_AT_symbol_name("_ackstring")
	.dwattr DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$1002, DW_AT_accessibility(DW_ACCESS_public)
DW$1003	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1003, DW_AT_name("newalarmeventflag"), DW_AT_symbol_name("_newalarmeventflag")
	.dwattr DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr DW$1003, DW_AT_accessibility(DW_ACCESS_public)
DW$1004	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1004, DW_AT_name("eventcodestatus"), DW_AT_symbol_name("_eventcodestatus")
	.dwattr DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$1004, DW_AT_accessibility(DW_ACCESS_public)
DW$1005	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1005, DW_AT_name("eventcode"), DW_AT_symbol_name("_eventcode")
	.dwattr DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr DW$1005, DW_AT_accessibility(DW_ACCESS_public)
DW$1006	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1006, DW_AT_name("currentindex"), DW_AT_symbol_name("_currentindex")
	.dwattr DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr DW$1006, DW_AT_accessibility(DW_ACCESS_public)
DW$1007	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1007, DW_AT_name("txalarmevents"), DW_AT_symbol_name("_txalarmevents")
	.dwattr DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr DW$1007, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$68


DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$69, DW_AT_byte_size(0x07)
DW$1008	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1008, DW_AT_name("outputtestmode"), DW_AT_symbol_name("_outputtestmode")
	.dwattr DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1008, DW_AT_accessibility(DW_ACCESS_public)
DW$1009	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1009, DW_AT_name("previousstatus"), DW_AT_symbol_name("_previousstatus")
	.dwattr DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1009, DW_AT_accessibility(DW_ACCESS_public)
DW$1010	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1010, DW_AT_name("previousslowdown"), DW_AT_symbol_name("_previousslowdown")
	.dwattr DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1010, DW_AT_accessibility(DW_ACCESS_public)
DW$1011	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1011, DW_AT_name("previousalarm"), DW_AT_symbol_name("_previousalarm")
	.dwattr DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$1011, DW_AT_accessibility(DW_ACCESS_public)
DW$1012	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1012, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
	.dwattr DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1012, DW_AT_accessibility(DW_ACCESS_public)
DW$1013	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1013, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
	.dwattr DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$1013, DW_AT_accessibility(DW_ACCESS_public)
DW$1014	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1014, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
	.dwattr DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$1014, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$69


DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$72, DW_AT_name("tag_prewarnstruct")
	.dwattr DW$T$72, DW_AT_byte_size(0xaa)
DW$1015	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$1015, DW_AT_name("prelevel"), DW_AT_symbol_name("_prelevel")
	.dwattr DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1015, DW_AT_accessibility(DW_ACCESS_public)
DW$1016	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$1016, DW_AT_name("average"), DW_AT_symbol_name("_average")
	.dwattr DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$1016, DW_AT_accessibility(DW_ACCESS_public)
DW$1017	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
	.dwattr DW$1017, DW_AT_name("calcacc"), DW_AT_symbol_name("_calcacc")
	.dwattr DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$1017, DW_AT_accessibility(DW_ACCESS_public)
DW$1018	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
	.dwattr DW$1018, DW_AT_name("points"), DW_AT_symbol_name("_points")
	.dwattr DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr DW$1018, DW_AT_accessibility(DW_ACCESS_public)
DW$1019	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1019, DW_AT_name("prewarncompleteflag"), DW_AT_symbol_name("_prewarncompleteflag")
	.dwattr DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr DW$1019, DW_AT_accessibility(DW_ACCESS_public)
DW$1020	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1020, DW_AT_name("init"), DW_AT_symbol_name("_init")
	.dwattr DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xa9]
	.dwattr DW$1020, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$72


DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$73, DW_AT_name("tag_offsetstruct")
	.dwattr DW$T$73, DW_AT_byte_size(0x1c)
DW$1021	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$1021, DW_AT_name("val"), DW_AT_symbol_name("_val")
	.dwattr DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1021, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$73

DW$T$245	.dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$76)
	.dwattr DW$T$245, DW_AT_language(DW_LANG_C)

DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$78, DW_AT_name("tag_functionstruct")
	.dwattr DW$T$78, DW_AT_byte_size(0x08)
DW$1022	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
	.dwattr DW$1022, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1022, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$78

DW$T$251	.dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$79)
	.dwattr DW$T$251, DW_AT_language(DW_LANG_C)
DW$T$255	.dwtag  DW_TAG_typedef, DW_AT_name("manrefsumstruct"), DW_AT_type(*DW$T$80)
	.dwattr DW$T$255, DW_AT_language(DW_LANG_C)

DW$T$81	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$81, DW_AT_name("tag_dynamicalarmsstruct")
	.dwattr DW$T$81, DW_AT_byte_size(0x24)
DW$1023	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1023, DW_AT_name("rpmav"), DW_AT_symbol_name("_rpmav")
	.dwattr DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1023, DW_AT_accessibility(DW_ACCESS_public)
DW$1024	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1024, DW_AT_name("single1"), DW_AT_symbol_name("_single1")
	.dwattr DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1024, DW_AT_accessibility(DW_ACCESS_public)
DW$1025	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1025, DW_AT_name("cyl1"), DW_AT_symbol_name("_cyl1")
	.dwattr DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1025, DW_AT_accessibility(DW_ACCESS_public)
DW$1026	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1026, DW_AT_name("mbsum1"), DW_AT_symbol_name("_mbsum1")
	.dwattr DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$1026, DW_AT_accessibility(DW_ACCESS_public)
DW$1027	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1027, DW_AT_name("single2"), DW_AT_symbol_name("_single2")
	.dwattr DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$1027, DW_AT_accessibility(DW_ACCESS_public)
DW$1028	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1028, DW_AT_name("cyl2"), DW_AT_symbol_name("_cyl2")
	.dwattr DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$1028, DW_AT_accessibility(DW_ACCESS_public)
DW$1029	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1029, DW_AT_name("mbsum2"), DW_AT_symbol_name("_mbsum2")
	.dwattr DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$1029, DW_AT_accessibility(DW_ACCESS_public)
DW$1030	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1030, DW_AT_name("deltarpmprev"), DW_AT_symbol_name("_deltarpmprev")
	.dwattr DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$1030, DW_AT_accessibility(DW_ACCESS_public)
DW$1031	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1031, DW_AT_name("deltarpm"), DW_AT_symbol_name("_deltarpm")
	.dwattr DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$1031, DW_AT_accessibility(DW_ACCESS_public)
DW$1032	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1032, DW_AT_name("deltarpm_int"), DW_AT_symbol_name("_deltarpm_int")
	.dwattr DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$1032, DW_AT_accessibility(DW_ACCESS_public)
DW$1033	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1033, DW_AT_name("rpmav_int"), DW_AT_symbol_name("_rpmav_int")
	.dwattr DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$1033, DW_AT_accessibility(DW_ACCESS_public)
DW$1034	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1034, DW_AT_name("deltarpmprev_int"), DW_AT_symbol_name("_deltarpmprev_int")
	.dwattr DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$1034, DW_AT_accessibility(DW_ACCESS_public)
DW$1035	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1035, DW_AT_name("single"), DW_AT_symbol_name("_single")
	.dwattr DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$1035, DW_AT_accessibility(DW_ACCESS_public)
DW$1036	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1036, DW_AT_name("cyl"), DW_AT_symbol_name("_cyl")
	.dwattr DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$1036, DW_AT_accessibility(DW_ACCESS_public)
DW$1037	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1037, DW_AT_name("mbsum"), DW_AT_symbol_name("_mbsum")
	.dwattr DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$1037, DW_AT_accessibility(DW_ACCESS_public)
DW$1038	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1038, DW_AT_name("singleprev"), DW_AT_symbol_name("_singleprev")
	.dwattr DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$1038, DW_AT_accessibility(DW_ACCESS_public)
DW$1039	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1039, DW_AT_name("cylprev"), DW_AT_symbol_name("_cylprev")
	.dwattr DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$1039, DW_AT_accessibility(DW_ACCESS_public)
DW$1040	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1040, DW_AT_name("mbsumprev"), DW_AT_symbol_name("_mbsumprev")
	.dwattr DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$1040, DW_AT_accessibility(DW_ACCESS_public)
DW$1041	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1041, DW_AT_name("single1_int"), DW_AT_symbol_name("_single1_int")
	.dwattr DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$1041, DW_AT_accessibility(DW_ACCESS_public)
DW$1042	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1042, DW_AT_name("cyl1_int"), DW_AT_symbol_name("_cyl1_int")
	.dwattr DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$1042, DW_AT_accessibility(DW_ACCESS_public)
DW$1043	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1043, DW_AT_name("mbsum1_int"), DW_AT_symbol_name("_mbsum1_int")
	.dwattr DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$1043, DW_AT_accessibility(DW_ACCESS_public)
DW$1044	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1044, DW_AT_name("single2_int"), DW_AT_symbol_name("_single2_int")
	.dwattr DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$1044, DW_AT_accessibility(DW_ACCESS_public)
DW$1045	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1045, DW_AT_name("cyl2_int"), DW_AT_symbol_name("_cyl2_int")
	.dwattr DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$1045, DW_AT_accessibility(DW_ACCESS_public)
DW$1046	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1046, DW_AT_name("mbsum2_int"), DW_AT_symbol_name("_mbsum2_int")
	.dwattr DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$1046, DW_AT_accessibility(DW_ACCESS_public)
DW$1047	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$1047, DW_AT_name("hits"), DW_AT_symbol_name("_hits")
	.dwattr DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$1047, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$81


DW$T$83	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$83, DW_AT_name("tag_damalarmsstruct")
	.dwattr DW$T$83, DW_AT_byte_size(0x04)
DW$1048	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
	.dwattr DW$1048, DW_AT_name("single"), DW_AT_symbol_name("_single")
	.dwattr DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1048, DW_AT_accessibility(DW_ACCESS_public)
DW$1049	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1049, DW_AT_name("cylinder"), DW_AT_symbol_name("_cylinder")
	.dwattr DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1049, DW_AT_accessibility(DW_ACCESS_public)
DW$1050	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1050, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
	.dwattr DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$1050, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$83


DW$T$84	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$84, DW_AT_name("tag_mancalstruct")
	.dwattr DW$T$84, DW_AT_byte_size(0x04)
DW$1051	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1051, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
	.dwattr DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1051, DW_AT_accessibility(DW_ACCESS_public)
DW$1052	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1052, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
	.dwattr DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1052, DW_AT_accessibility(DW_ACCESS_public)
DW$1053	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1053, DW_AT_name("percentleft"), DW_AT_symbol_name("_percentleft")
	.dwattr DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1053, DW_AT_accessibility(DW_ACCESS_public)
DW$1054	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1054, DW_AT_name("manupdateflag"), DW_AT_symbol_name("_manupdateflag")
	.dwattr DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$1054, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$84


DW$T$91	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$91, DW_AT_name("tag_calibrationstruct")
	.dwattr DW$T$91, DW_AT_byte_size(0x31a)
DW$1055	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1055, DW_AT_name("rpmpoints"), DW_AT_symbol_name("_rpmpoints")
	.dwattr DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1055, DW_AT_accessibility(DW_ACCESS_public)
DW$1056	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
	.dwattr DW$1056, DW_AT_name("speedcalpoints"), DW_AT_symbol_name("_speedcalpoints")
	.dwattr DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1056, DW_AT_accessibility(DW_ACCESS_public)
DW$1057	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$1057, DW_AT_name("roughnumpoints"), DW_AT_symbol_name("_roughnumpoints")
	.dwattr DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$1057, DW_AT_accessibility(DW_ACCESS_public)
DW$1058	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
	.dwattr DW$1058, DW_AT_name("numpoints"), DW_AT_symbol_name("_numpoints")
	.dwattr DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$1058, DW_AT_accessibility(DW_ACCESS_public)
DW$1059	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
	.dwattr DW$1059, DW_AT_name("averagespeedacc"), DW_AT_symbol_name("_averagespeedacc")
	.dwattr DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr DW$1059, DW_AT_accessibility(DW_ACCESS_public)
DW$1060	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
	.dwattr DW$1060, DW_AT_name("averagevalacc"), DW_AT_symbol_name("_averagevalacc")
	.dwattr DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e2]
	.dwattr DW$1060, DW_AT_accessibility(DW_ACCESS_public)
DW$1061	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1061, DW_AT_name("validpoints"), DW_AT_symbol_name("_validpoints")
	.dwattr DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x28a]
	.dwattr DW$1061, DW_AT_accessibility(DW_ACCESS_public)
DW$1062	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
	.dwattr DW$1062, DW_AT_name("rpmatcal"), DW_AT_symbol_name("_rpmatcal")
	.dwattr DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x28b]
	.dwattr DW$1062, DW_AT_accessibility(DW_ACCESS_public)
DW$1063	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
	.dwattr DW$1063, DW_AT_name("manroughcalpts"), DW_AT_symbol_name("_manroughcalpts")
	.dwattr DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x28e]
	.dwattr DW$1063, DW_AT_accessibility(DW_ACCESS_public)
DW$1064	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$1064, DW_AT_name("manroughmin"), DW_AT_symbol_name("_manroughmin")
	.dwattr DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e2]
	.dwattr DW$1064, DW_AT_accessibility(DW_ACCESS_public)
DW$1065	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$1065, DW_AT_name("manroughmax"), DW_AT_symbol_name("_manroughmax")
	.dwattr DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x2fe]
	.dwattr DW$1065, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$91


DW$T$92	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$92, DW_AT_name("tag_speedcompstruct")
	.dwattr DW$T$92, DW_AT_byte_size(0x19)
DW$1066	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1066, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
	.dwattr DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1066, DW_AT_accessibility(DW_ACCESS_public)
DW$1067	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1067, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1067, DW_AT_accessibility(DW_ACCESS_public)
DW$1068	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
	.dwattr DW$1068, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
	.dwattr DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1068, DW_AT_accessibility(DW_ACCESS_public)
DW$1069	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1069, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
	.dwattr DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$1069, DW_AT_accessibility(DW_ACCESS_public)
DW$1070	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1070, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
	.dwattr DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$1070, DW_AT_accessibility(DW_ACCESS_public)
DW$1071	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1071, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
	.dwattr DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$1071, DW_AT_accessibility(DW_ACCESS_public)
DW$1072	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1072, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
	.dwattr DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$1072, DW_AT_accessibility(DW_ACCESS_public)
DW$1073	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1073, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
	.dwattr DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$1073, DW_AT_accessibility(DW_ACCESS_public)
DW$1074	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1074, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
	.dwattr DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$1074, DW_AT_accessibility(DW_ACCESS_public)
DW$1075	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1075, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
	.dwattr DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$1075, DW_AT_accessibility(DW_ACCESS_public)
DW$1076	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1076, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
	.dwattr DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$1076, DW_AT_accessibility(DW_ACCESS_public)
DW$1077	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1077, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$1077, DW_AT_accessibility(DW_ACCESS_public)
DW$1078	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1078, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$1078, DW_AT_accessibility(DW_ACCESS_public)
DW$1079	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1079, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$1079, DW_AT_accessibility(DW_ACCESS_public)
DW$1080	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1080, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$1080, DW_AT_accessibility(DW_ACCESS_public)
DW$1081	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1081, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$1081, DW_AT_accessibility(DW_ACCESS_public)
DW$1082	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1082, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$1082, DW_AT_accessibility(DW_ACCESS_public)
DW$1083	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1083, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$1083, DW_AT_accessibility(DW_ACCESS_public)
DW$1084	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1084, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$1084, DW_AT_accessibility(DW_ACCESS_public)
DW$1085	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1085, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$1085, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$92

DW$1086	.dwtag  DW_TAG_far_type
	.dwattr DW$1086, DW_AT_type(*DW$T$96)
DW$T$145	.dwtag  DW_TAG_const_type
	.dwattr DW$T$145, DW_AT_type(*DW$1086)

DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$99, DW_AT_name("tag_sdfilestruct")
	.dwattr DW$T$99, DW_AT_byte_size(0x14e)
DW$1087	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1087, DW_AT_name("year1"), DW_AT_symbol_name("_year1")
	.dwattr DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1087, DW_AT_accessibility(DW_ACCESS_public)
DW$1088	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1088, DW_AT_name("month1"), DW_AT_symbol_name("_month1")
	.dwattr DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1088, DW_AT_accessibility(DW_ACCESS_public)
DW$1089	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1089, DW_AT_name("date1"), DW_AT_symbol_name("_date1")
	.dwattr DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1089, DW_AT_accessibility(DW_ACCESS_public)
DW$1090	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1090, DW_AT_name("yearn"), DW_AT_symbol_name("_yearn")
	.dwattr DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$1090, DW_AT_accessibility(DW_ACCESS_public)
DW$1091	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1091, DW_AT_name("monthn"), DW_AT_symbol_name("_monthn")
	.dwattr DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1091, DW_AT_accessibility(DW_ACCESS_public)
DW$1092	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1092, DW_AT_name("daten"), DW_AT_symbol_name("_daten")
	.dwattr DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$1092, DW_AT_accessibility(DW_ACCESS_public)
DW$1093	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1093, DW_AT_name("readyear"), DW_AT_symbol_name("_readyear")
	.dwattr DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$1093, DW_AT_accessibility(DW_ACCESS_public)
DW$1094	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1094, DW_AT_name("readmonth"), DW_AT_symbol_name("_readmonth")
	.dwattr DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$1094, DW_AT_accessibility(DW_ACCESS_public)
DW$1095	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1095, DW_AT_name("readdate"), DW_AT_symbol_name("_readdate")
	.dwattr DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$1095, DW_AT_accessibility(DW_ACCESS_public)
DW$1096	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
	.dwattr DW$1096, DW_AT_name("file"), DW_AT_symbol_name("_file")
	.dwattr DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$1096, DW_AT_accessibility(DW_ACCESS_public)
DW$1097	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
	.dwattr DW$1097, DW_AT_name("readbuffer"), DW_AT_symbol_name("_readbuffer")
	.dwattr DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$1097, DW_AT_accessibility(DW_ACCESS_public)
DW$1098	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$1098, DW_AT_name("entryposition"), DW_AT_symbol_name("_entryposition")
	.dwattr DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr DW$1098, DW_AT_accessibility(DW_ACCESS_public)
DW$1099	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1099, DW_AT_name("logtype"), DW_AT_symbol_name("_logtype")
	.dwattr DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr DW$1099, DW_AT_accessibility(DW_ACCESS_public)
DW$1100	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$1100, DW_AT_name("directorystr"), DW_AT_symbol_name("_directorystr")
	.dwattr DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0x13b]
	.dwattr DW$1100, DW_AT_accessibility(DW_ACCESS_public)
DW$1101	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
	.dwattr DW$1101, DW_AT_name("filenamestr"), DW_AT_symbol_name("_filenamestr")
	.dwattr DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0x13f]
	.dwattr DW$1101, DW_AT_accessibility(DW_ACCESS_public)
DW$1102	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$1102, DW_AT_name("getnumwords"), DW_AT_symbol_name("_getnumwords")
	.dwattr DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0x146]
	.dwattr DW$1102, DW_AT_accessibility(DW_ACCESS_public)
DW$1103	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1103, DW_AT_name("setnumwords"), DW_AT_symbol_name("_setnumwords")
	.dwattr DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr DW$1103, DW_AT_accessibility(DW_ACCESS_public)
DW$1104	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$1104, DW_AT_name("setoffset"), DW_AT_symbol_name("_setoffset")
	.dwattr DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x14a]
	.dwattr DW$1104, DW_AT_accessibility(DW_ACCESS_public)
DW$1105	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1105, DW_AT_name("readwriteflag"), DW_AT_symbol_name("_readwriteflag")
	.dwattr DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr DW$1105, DW_AT_accessibility(DW_ACCESS_public)
DW$1106	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1106, DW_AT_name("readwriteprogress"), DW_AT_symbol_name("_readwriteprogress")
	.dwattr DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0x14d]
	.dwattr DW$1106, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$99


DW$T$101	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$101, DW_AT_name("tag_sdsettingsstruct")
	.dwattr DW$T$101, DW_AT_byte_size(0x04)
DW$1107	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1107, DW_AT_name("present"), DW_AT_symbol_name("_present")
	.dwattr DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1107, DW_AT_accessibility(DW_ACCESS_public)
DW$1108	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1108, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
	.dwattr DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1108, DW_AT_accessibility(DW_ACCESS_public)
DW$1109	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1109, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
	.dwattr DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1109, DW_AT_accessibility(DW_ACCESS_public)
DW$1110	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
	.dwattr DW$1110, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
	.dwattr DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$1110, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$101


DW$T$104	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$104, DW_AT_name("tag_waterinoilstruct")
	.dwattr DW$T$104, DW_AT_byte_size(0x0c)
DW$1111	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1111, DW_AT_name("netadd"), DW_AT_symbol_name("_netadd")
	.dwattr DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1111, DW_AT_accessibility(DW_ACCESS_public)
DW$1112	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1112, DW_AT_name("temperature"), DW_AT_symbol_name("_temperature")
	.dwattr DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1112, DW_AT_accessibility(DW_ACCESS_public)
DW$1113	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1113, DW_AT_name("activity"), DW_AT_symbol_name("_activity")
	.dwattr DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1113, DW_AT_accessibility(DW_ACCESS_public)
DW$1114	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1114, DW_AT_name("content"), DW_AT_symbol_name("_content")
	.dwattr DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$1114, DW_AT_accessibility(DW_ACCESS_public)
DW$1115	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1115, DW_AT_name("temperature_int"), DW_AT_symbol_name("_temperature_int")
	.dwattr DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$1115, DW_AT_accessibility(DW_ACCESS_public)
DW$1116	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1116, DW_AT_name("activity_int"), DW_AT_symbol_name("_activity_int")
	.dwattr DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$1116, DW_AT_accessibility(DW_ACCESS_public)
DW$1117	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1117, DW_AT_name("content_int"), DW_AT_symbol_name("_content_int")
	.dwattr DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$1117, DW_AT_accessibility(DW_ACCESS_public)
DW$1118	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
	.dwattr DW$1118, DW_AT_name("wioalarms"), DW_AT_symbol_name("_wioalarms")
	.dwattr DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$1118, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$104


DW$T$106	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$106, DW_AT_name("tag_bearingstatusstruct")
	.dwattr DW$T$106, DW_AT_byte_size(0x2c)
DW$1119	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
	.dwattr DW$1119, DW_AT_name("MainBearings"), DW_AT_symbol_name("_MainBearings")
	.dwattr DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1119, DW_AT_accessibility(DW_ACCESS_public)
DW$1120	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$1120, DW_AT_name("CrankPinBearings"), DW_AT_symbol_name("_CrankPinBearings")
	.dwattr DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$1120, DW_AT_accessibility(DW_ACCESS_public)
DW$1121	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$1121, DW_AT_name("CrossHeadBearings"), DW_AT_symbol_name("_CrossHeadBearings")
	.dwattr DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$1121, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$106


DW$T$108	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$108, DW_AT_name("tag_slemsstruct")
	.dwattr DW$T$108, DW_AT_byte_size(0x03)
DW$1122	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1122, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
	.dwattr DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1122, DW_AT_accessibility(DW_ACCESS_public)
DW$1123	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
	.dwattr DW$1123, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
	.dwattr DW$1123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1123, DW_AT_accessibility(DW_ACCESS_public)
DW$1124	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1124, DW_AT_name("levelcount"), DW_AT_symbol_name("_levelcount")
	.dwattr DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1124, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$108


DW$T$110	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$110, DW_AT_name("tag_rtcbatstruct")
	.dwattr DW$T$110, DW_AT_byte_size(0x02)
DW$1125	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1125, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
	.dwattr DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1125, DW_AT_accessibility(DW_ACCESS_public)
DW$1126	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$109)
	.dwattr DW$1126, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
	.dwattr DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1126, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$110


DW$T$111	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$111, DW_AT_name("tag_cppstruct")
	.dwattr DW$T$111, DW_AT_byte_size(0x06)
DW$1127	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$1127, DW_AT_name("iAtodValue"), DW_AT_symbol_name("_iAtodValue")
	.dwattr DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1127, DW_AT_accessibility(DW_ACCESS_public)
DW$1128	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1128, DW_AT_name("fmAinput"), DW_AT_symbol_name("_fmAinput")
	.dwattr DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1128, DW_AT_accessibility(DW_ACCESS_public)
DW$1129	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$1129, DW_AT_name("fLoadPercent"), DW_AT_symbol_name("_fLoadPercent")
	.dwattr DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1129, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$111


DW$T$113	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$113, DW_AT_name("tag_PCCmdStruct")
	.dwattr DW$T$113, DW_AT_byte_size(0x110)
DW$1130	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$1130, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
	.dwattr DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1130, DW_AT_accessibility(DW_ACCESS_public)
DW$1131	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$1131, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
	.dwattr DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1131, DW_AT_accessibility(DW_ACCESS_public)
DW$1132	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1132, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
	.dwattr DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$1132, DW_AT_accessibility(DW_ACCESS_public)
DW$1133	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1133, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
	.dwattr DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$1133, DW_AT_accessibility(DW_ACCESS_public)
DW$1134	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1134, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
	.dwattr DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$1134, DW_AT_accessibility(DW_ACCESS_public)
DW$1135	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
	.dwattr DW$1135, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
	.dwattr DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$1135, DW_AT_accessibility(DW_ACCESS_public)
DW$1136	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1136, DW_AT_name("errorflag"), DW_AT_symbol_name("_errorflag")
	.dwattr DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
	.dwattr DW$1136, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$113


DW$T$114	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$114, DW_AT_name("tag_modbusupdatestruct")
	.dwattr DW$T$114, DW_AT_byte_size(0x02)
DW$1137	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$1137, DW_AT_name("live"), DW_AT_symbol_name("_live")
	.dwattr DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1137, DW_AT_accessibility(DW_ACCESS_public)
DW$1138	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
	.dwattr DW$1138, DW_AT_name("logging"), DW_AT_symbol_name("_logging")
	.dwattr DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$1138, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$114


DW$T$135	.dwtag  DW_TAG_enumeration_type
	.dwattr DW$T$135, DW_AT_name("tag_PtrTypeEnum")
	.dwattr DW$T$135, DW_AT_byte_size(0x01)
DW$1139	.dwtag  DW_TAG_enumerator, DW_AT_name("BYTE"), DW_AT_const_value(0x00)
DW$1140	.dwtag  DW_TAG_enumerator, DW_AT_name("INT"), DW_AT_const_value(0x01)
DW$1141	.dwtag  DW_TAG_enumerator, DW_AT_name("STRING"), DW_AT_const_value(0x02)
	.dwendtag DW$T$135


DW$T$28	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$28, DW_AT_byte_size(0x02)
DW$1142	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1142, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$28


DW$T$90	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$90, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$90, DW_AT_byte_size(0x54)
DW$1143	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1143, DW_AT_upper_bound(0x02)
DW$1144	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1144, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$90


DW$T$34	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$34, DW_AT_byte_size(0x04)
DW$1145	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1145, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$34


DW$T$64	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$64, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$64, DW_AT_byte_size(0x09)
DW$1146	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1146, DW_AT_upper_bound(0x08)
	.dwendtag DW$T$64


DW$T$65	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$65, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$65, DW_AT_byte_size(0x18)
DW$1147	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1147, DW_AT_upper_bound(0x17)
	.dwendtag DW$T$65


DW$T$66	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$66, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$66, DW_AT_byte_size(0x0f)
DW$1148	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1148, DW_AT_upper_bound(0x0e)
	.dwendtag DW$T$66


DW$T$67	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$67, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$67, DW_AT_byte_size(0x05)
DW$1149	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1149, DW_AT_upper_bound(0x04)
	.dwendtag DW$T$67


DW$T$85	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$85, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$85, DW_AT_byte_size(0x06)
DW$1150	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1150, DW_AT_upper_bound(0x02)
DW$1151	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1151, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$85


DW$T$89	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$89, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$89, DW_AT_byte_size(0x03)
DW$1152	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1152, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$89


DW$T$98	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$98, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$98, DW_AT_byte_size(0x06)
DW$1153	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1153, DW_AT_upper_bound(0x05)
	.dwendtag DW$T$98


DW$T$105	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$105, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$105, DW_AT_byte_size(0x10)
DW$1154	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1154, DW_AT_upper_bound(0x0f)
	.dwendtag DW$T$105


DW$T$71	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$71, DW_AT_byte_size(0x38)
DW$1155	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1155, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$71


DW$T$88	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
	.dwattr DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$88, DW_AT_byte_size(0xa8)
DW$1156	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1156, DW_AT_upper_bound(0x02)
DW$1157	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1157, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$88


DW$T$86	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$86, DW_AT_byte_size(0x06)
DW$1158	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1158, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$86


DW$T$87	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
	.dwattr DW$T$87, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$87, DW_AT_byte_size(0x12c)
DW$1159	.dwtag  DW_TAG_subrange_type
	.dwattr DW$1159, DW_AT_upper_bound(0x95)
	.dwendtag DW$T$87

DW$T$16	.dwtag  DW_TAG_base_type, DW_AT_name("float")
	.dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr DW$T$16, DW_AT_byte_size(0x02)

DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$19, DW_AT_name("tag_status1struct")
	.dwattr DW$T$19, DW_AT_byte_size(0x01)
DW$1160	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1160, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$1160, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1160, DW_AT_accessibility(DW_ACCESS_public)
DW$1161	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1161, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
	.dwattr DW$1161, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$1161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1161, DW_AT_accessibility(DW_ACCESS_public)
DW$1162	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1162, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
	.dwattr DW$1162, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1162, DW_AT_accessibility(DW_ACCESS_public)
DW$1163	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1163, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$1163, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$1163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1163, DW_AT_accessibility(DW_ACCESS_public)
DW$1164	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1164, DW_AT_name("replaced"), DW_AT_symbol_name("_replaced")
	.dwattr DW$1164, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$1164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1164, DW_AT_accessibility(DW_ACCESS_public)
DW$1165	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1165, DW_AT_name("excludeslowroll"), DW_AT_symbol_name("_excludeslowroll")
	.dwattr DW$1165, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1165, DW_AT_accessibility(DW_ACCESS_public)
DW$1166	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1166, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$1166, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$1166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1166, DW_AT_accessibility(DW_ACCESS_public)
DW$1167	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1167, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$1167, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$1167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1167, DW_AT_accessibility(DW_ACCESS_public)
DW$1168	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1168, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$1168, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1168, DW_AT_accessibility(DW_ACCESS_public)
DW$1169	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1169, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
	.dwattr DW$1169, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1169, DW_AT_accessibility(DW_ACCESS_public)
DW$1170	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1170, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
	.dwattr DW$1170, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$1170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1170, DW_AT_accessibility(DW_ACCESS_public)
DW$1171	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1171, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
	.dwattr DW$1171, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$1171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1171, DW_AT_accessibility(DW_ACCESS_public)
DW$1172	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1172, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$1172, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$1172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1172, DW_AT_accessibility(DW_ACCESS_public)
DW$1173	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1173, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$1173, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$1173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1173, DW_AT_accessibility(DW_ACCESS_public)
DW$1174	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1174, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$1174, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$1174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1174, DW_AT_accessibility(DW_ACCESS_public)
DW$1175	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1175, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$1175, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$1175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1175, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$19


DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_name("tag_sensoralarmstruct")
	.dwattr DW$T$20, DW_AT_byte_size(0x01)
DW$1176	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1176, DW_AT_name("failure"), DW_AT_symbol_name("_failure")
	.dwattr DW$1176, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$1176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1176, DW_AT_accessibility(DW_ACCESS_public)
DW$1177	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1177, DW_AT_name("failurelatched"), DW_AT_symbol_name("_failurelatched")
	.dwattr DW$1177, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$1177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1177, DW_AT_accessibility(DW_ACCESS_public)
DW$1178	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1178, DW_AT_name("slowdown"), DW_AT_symbol_name("_slowdown")
	.dwattr DW$1178, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1178, DW_AT_accessibility(DW_ACCESS_public)
DW$1179	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1179, DW_AT_name("slowdownlatched"), DW_AT_symbol_name("_slowdownlatched")
	.dwattr DW$1179, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$1179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1179, DW_AT_accessibility(DW_ACCESS_public)
DW$1180	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1180, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
	.dwattr DW$1180, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$1180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1180, DW_AT_accessibility(DW_ACCESS_public)
DW$1181	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1181, DW_AT_name("alarmlatched"), DW_AT_symbol_name("_alarmlatched")
	.dwattr DW$1181, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1181, DW_AT_accessibility(DW_ACCESS_public)
DW$1182	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1182, DW_AT_name("devalarm"), DW_AT_symbol_name("_devalarm")
	.dwattr DW$1182, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1182, DW_AT_accessibility(DW_ACCESS_public)
DW$1183	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1183, DW_AT_name("devalarmlatched"), DW_AT_symbol_name("_devalarmlatched")
	.dwattr DW$1183, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1183, DW_AT_accessibility(DW_ACCESS_public)
DW$1184	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1184, DW_AT_name("devslow"), DW_AT_symbol_name("_devslow")
	.dwattr DW$1184, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$1184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1184, DW_AT_accessibility(DW_ACCESS_public)
DW$1185	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1185, DW_AT_name("devslowlatched"), DW_AT_symbol_name("_devslowlatched")
	.dwattr DW$1185, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$1185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1185, DW_AT_accessibility(DW_ACCESS_public)
DW$1186	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1186, DW_AT_name("calibration"), DW_AT_symbol_name("_calibration")
	.dwattr DW$1186, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$1186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1186, DW_AT_accessibility(DW_ACCESS_public)
DW$1187	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1187, DW_AT_name("calibrationlatched"), DW_AT_symbol_name("_calibrationlatched")
	.dwattr DW$1187, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$1187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1187, DW_AT_accessibility(DW_ACCESS_public)
DW$1188	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1188, DW_AT_name("prewarning"), DW_AT_symbol_name("_prewarning")
	.dwattr DW$1188, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$1188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1188, DW_AT_accessibility(DW_ACCESS_public)
DW$1189	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1189, DW_AT_name("prewarninglatched"), DW_AT_symbol_name("_prewarninglatched")
	.dwattr DW$1189, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1189, DW_AT_accessibility(DW_ACCESS_public)
DW$1190	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1190, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$1190, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1190, DW_AT_accessibility(DW_ACCESS_public)
DW$1191	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1191, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$1191, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20


DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$21, DW_AT_name("tag_status3struct")
	.dwattr DW$T$21, DW_AT_byte_size(0x01)
DW$1192	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1192, DW_AT_name("nopulse"), DW_AT_symbol_name("_nopulse")
	.dwattr DW$1192, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1192, DW_AT_accessibility(DW_ACCESS_public)
DW$1193	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1193, DW_AT_name("low"), DW_AT_symbol_name("_low")
	.dwattr DW$1193, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1193, DW_AT_accessibility(DW_ACCESS_public)
DW$1194	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1194, DW_AT_name("high"), DW_AT_symbol_name("_high")
	.dwattr DW$1194, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1194, DW_AT_accessibility(DW_ACCESS_public)
DW$1195	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1195, DW_AT_name("rpmoor"), DW_AT_symbol_name("_rpmoor")
	.dwattr DW$1195, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1195, DW_AT_accessibility(DW_ACCESS_public)
DW$1196	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1196, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$1196, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1196, DW_AT_accessibility(DW_ACCESS_public)
DW$1197	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1197, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$1197, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1197, DW_AT_accessibility(DW_ACCESS_public)
DW$1198	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1198, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$1198, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1198, DW_AT_accessibility(DW_ACCESS_public)
DW$1199	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1199, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$1199, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1199, DW_AT_accessibility(DW_ACCESS_public)
DW$1200	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1200, DW_AT_name("nopulselatched"), DW_AT_symbol_name("_nopulselatched")
	.dwattr DW$1200, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$1200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1200, DW_AT_accessibility(DW_ACCESS_public)
DW$1201	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1201, DW_AT_name("lowlatched"), DW_AT_symbol_name("_lowlatched")
	.dwattr DW$1201, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$1201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1201, DW_AT_accessibility(DW_ACCESS_public)
DW$1202	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1202, DW_AT_name("highlatched"), DW_AT_symbol_name("_highlatched")
	.dwattr DW$1202, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$1202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1202, DW_AT_accessibility(DW_ACCESS_public)
DW$1203	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1203, DW_AT_name("rpmoorlatched"), DW_AT_symbol_name("_rpmoorlatched")
	.dwattr DW$1203, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$1203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1203, DW_AT_accessibility(DW_ACCESS_public)
DW$1204	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1204, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$1204, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1204, DW_AT_accessibility(DW_ACCESS_public)
DW$1205	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1205, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$1205, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1205, DW_AT_accessibility(DW_ACCESS_public)
DW$1206	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1206, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$1206, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1206, DW_AT_accessibility(DW_ACCESS_public)
DW$1207	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1207, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$1207, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$21


DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_name("tag_alarmsstruct")
	.dwattr DW$T$22, DW_AT_byte_size(0x01)
DW$1208	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1208, DW_AT_name("slavefailure"), DW_AT_symbol_name("_slavefailure")
	.dwattr DW$1208, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1208, DW_AT_accessibility(DW_ACCESS_public)
DW$1209	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1209, DW_AT_name("slavefailurelatched"), DW_AT_symbol_name("_slavefailurelatched")
	.dwattr DW$1209, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1209, DW_AT_accessibility(DW_ACCESS_public)
DW$1210	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1210, DW_AT_name("framfailure"), DW_AT_symbol_name("_framfailure")
	.dwattr DW$1210, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1210, DW_AT_accessibility(DW_ACCESS_public)
DW$1211	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1211, DW_AT_name("framfailurelatched"), DW_AT_symbol_name("_framfailurelatched")
	.dwattr DW$1211, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1211, DW_AT_accessibility(DW_ACCESS_public)
DW$1212	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1212, DW_AT_name("pccommsfailure"), DW_AT_symbol_name("_pccommsfailure")
	.dwattr DW$1212, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1212, DW_AT_accessibility(DW_ACCESS_public)
DW$1213	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1213, DW_AT_name("pccommsfailurelatched"), DW_AT_symbol_name("_pccommsfailurelatched")
	.dwattr DW$1213, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1213, DW_AT_accessibility(DW_ACCESS_public)
DW$1214	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1214, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$1214, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1214, DW_AT_accessibility(DW_ACCESS_public)
DW$1215	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1215, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$1215, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1215, DW_AT_accessibility(DW_ACCESS_public)
DW$1216	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1216, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$1216, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$1216, DW_AT_accessibility(DW_ACCESS_public)
DW$1217	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$1217, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
