;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
;* Date/Time created: Thu Aug 18 12:16:29 2016                 *
;***************************************************************
	.compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
FP	.set	XAR2

DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr DW$CU, DW_AT_name("sdcard.c")
	.dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Instruments Incorporated")
	.dwattr DW$CU, DW_AT_stmt_list(0x00)
	.dwattr DW$CU, DW_AT_TI_VERSION(0x01)
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-IR_1,16
	.field  	_pMsgList+0,32
	.field  	_sensor_failure,32		; _pMsgList[0] @ 0
	.field  	_sensor_slowdown,32		; _pMsgList[1] @ 32
	.field  	_sensor_alarm,32		; _pMsgList[2] @ 64
	.field  	_devsensor_slowdown,32		; _pMsgList[3] @ 96
	.field  	_devsensor_alarm,32		; _pMsgList[4] @ 128
	.field  	_cylinderdev_alarm,32		; _pMsgList[5] @ 160
	.field  	_full_auto_calibration,32		; _pMsgList[6] @ 192
	.field  	_sensor_calibration,32		; _pMsgList[7] @ 224
	.field  	_loss_of_comms_spu2,32		; _pMsgList[8] @ 256
	.field  	_look_up_average_error,32		; _pMsgList[9] @ 288

DW$T$107	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$106)
	.dwattr DW$T$107, DW_AT_address_class(0x16)

DW$T$315	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$107)
	.dwattr DW$T$315, DW_AT_language(DW_LANG_C)
DW$560	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$149)
DW$561	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$149)
	.dwendtag DW$T$315

DW$T$319	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$75)
	.dwattr DW$T$319, DW_AT_address_class(0x16)

DW$T$320	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$319)
	.dwattr DW$T$320, DW_AT_language(DW_LANG_C)
DW$562	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$320

DW$T$324	.dwtag  DW_TAG_typedef, DW_AT_name("eventlogvarsstruct"), DW_AT_type(*DW$T$51)
	.dwattr DW$T$324, DW_AT_language(DW_LANG_C)
DW$T$325	.dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$53)
	.dwattr DW$T$325, DW_AT_language(DW_LANG_C)
DW$T$326	.dwtag  DW_TAG_typedef, DW_AT_name("livestruct"), DW_AT_type(*DW$T$54)
	.dwattr DW$T$326, DW_AT_language(DW_LANG_C)
DW$T$328	.dwtag  DW_TAG_typedef, DW_AT_name("calibrationdatetimestruct"), DW_AT_type(*DW$T$57)
	.dwattr DW$T$328, DW_AT_language(DW_LANG_C)
DW$T$330	.dwtag  DW_TAG_typedef, DW_AT_name("clockstruct"), DW_AT_type(*DW$T$58)
	.dwattr DW$T$330, DW_AT_language(DW_LANG_C)
DW$563	.dwtag  DW_TAG_far_type
	.dwattr DW$563, DW_AT_type(*DW$T$331)
DW$T$332	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$332, DW_AT_type(*DW$563)
DW$T$334	.dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$63)
	.dwattr DW$T$334, DW_AT_language(DW_LANG_C)
DW$T$336	.dwtag  DW_TAG_typedef, DW_AT_name("enginestruct"), DW_AT_type(*DW$T$64)
	.dwattr DW$T$336, DW_AT_language(DW_LANG_C)
DW$T$337	.dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$71)
	.dwattr DW$T$337, DW_AT_language(DW_LANG_C)
DW$T$339	.dwtag  DW_TAG_typedef, DW_AT_name("offsetstruct"), DW_AT_type(*DW$T$73)
	.dwattr DW$T$339, DW_AT_language(DW_LANG_C)

DW$T$342	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$341)
	.dwattr DW$T$342, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$342, DW_AT_byte_size(0x1f8)
DW$564	.dwtag  DW_TAG_subrange_type
	.dwattr DW$564, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$342


DW$T$346	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$345)
	.dwattr DW$T$346, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$346, DW_AT_byte_size(0x118)
DW$565	.dwtag  DW_TAG_subrange_type
	.dwattr DW$565, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$346

DW$T$349	.dwtag  DW_TAG_typedef, DW_AT_name("damagemonstruct"), DW_AT_type(*DW$T$79)
	.dwattr DW$T$349, DW_AT_language(DW_LANG_C)
DW$T$351	.dwtag  DW_TAG_typedef, DW_AT_name("dynamicalarmsstruct"), DW_AT_type(*DW$T$80)
	.dwattr DW$T$351, DW_AT_language(DW_LANG_C)
DW$T$352	.dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$83)
	.dwattr DW$T$352, DW_AT_language(DW_LANG_C)
DW$T$354	.dwtag  DW_TAG_typedef, DW_AT_name("wiosettingsstruct"), DW_AT_type(*DW$T$84)
	.dwattr DW$T$354, DW_AT_language(DW_LANG_C)
DW$T$356	.dwtag  DW_TAG_typedef, DW_AT_name("slemsettingsstruct"), DW_AT_type(*DW$T$85)
	.dwattr DW$T$356, DW_AT_language(DW_LANG_C)
DW$T$358	.dwtag  DW_TAG_typedef, DW_AT_name("slemstruct"), DW_AT_type(*DW$T$87)
	.dwattr DW$T$358, DW_AT_language(DW_LANG_C)
DW$T$359	.dwtag  DW_TAG_typedef, DW_AT_name("cppsettingsstruct"), DW_AT_type(*DW$T$88)
	.dwattr DW$T$359, DW_AT_language(DW_LANG_C)
DW$T$361	.dwtag  DW_TAG_typedef, DW_AT_name("sensorMovingstruct"), DW_AT_type(*DW$T$89)
	.dwattr DW$T$361, DW_AT_language(DW_LANG_C)
DW$T$363	.dwtag  DW_TAG_typedef, DW_AT_name("dcmodechecksstruct"), DW_AT_type(*DW$T$93)
	.dwattr DW$T$363, DW_AT_language(DW_LANG_C)
DW$566	.dwtag  DW_TAG_far_type
	.dwattr DW$566, DW_AT_type(*DW$T$365)
DW$T$366	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$366, DW_AT_type(*DW$566)
DW$T$369	.dwtag  DW_TAG_typedef, DW_AT_name("sdfilestruct"), DW_AT_type(*DW$T$111)
	.dwattr DW$T$369, DW_AT_language(DW_LANG_C)
DW$T$371	.dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$113)
	.dwattr DW$T$371, DW_AT_language(DW_LANG_C)
DW$T$373	.dwtag  DW_TAG_typedef, DW_AT_name("shorttermlogstruct"), DW_AT_type(*DW$T$119)
	.dwattr DW$T$373, DW_AT_language(DW_LANG_C)
DW$T$375	.dwtag  DW_TAG_typedef, DW_AT_name("longtermlogstruct"), DW_AT_type(*DW$T$121)
	.dwattr DW$T$375, DW_AT_language(DW_LANG_C)
DW$T$377	.dwtag  DW_TAG_typedef, DW_AT_name("asciilogstruct"), DW_AT_type(*DW$T$123)
	.dwattr DW$T$377, DW_AT_language(DW_LANG_C)
DW$T$378	.dwtag  DW_TAG_typedef, DW_AT_name("mansdstruct"), DW_AT_type(*DW$T$125)
	.dwattr DW$T$378, DW_AT_language(DW_LANG_C)
DW$567	.dwtag  DW_TAG_far_type
	.dwattr DW$567, DW_AT_type(*DW$T$380)
DW$T$381	.dwtag  DW_TAG_const_type
	.dwattr DW$T$381, DW_AT_type(*DW$567)
DW$568	.dwtag  DW_TAG_far_type
DW$T$131	.dwtag  DW_TAG_const_type
	.dwattr DW$T$131, DW_AT_type(*DW$568)
DW$T$167	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$166)
	.dwattr DW$T$167, DW_AT_address_class(0x16)
DW$T$164	.dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$39)
	.dwattr DW$T$164, DW_AT_language(DW_LANG_C)
DW$T$40	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$40, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$40, DW_AT_byte_size(0x01)
DW$569	.dwtag  DW_TAG_far_type
	.dwattr DW$569, DW_AT_type(*DW$T$40)
DW$T$148	.dwtag  DW_TAG_const_type
	.dwattr DW$T$148, DW_AT_type(*DW$569)

DW$T$306	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$148)
	.dwattr DW$T$306, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$306, DW_AT_byte_size(0x32)
DW$570	.dwtag  DW_TAG_subrange_type
	.dwattr DW$570, DW_AT_upper_bound(0x31)
	.dwendtag DW$T$306

DW$T$308	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$307)
	.dwattr DW$T$308, DW_AT_address_class(0x16)

DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$48, DW_AT_byte_size(0x52)
DW$571	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$571, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
	.dwattr DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$571, DW_AT_accessibility(DW_ACCESS_public)
DW$572	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
	.dwattr DW$572, DW_AT_name("name"), DW_AT_symbol_name("_name")
	.dwattr DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$572, DW_AT_accessibility(DW_ACCESS_public)
DW$573	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
	.dwattr DW$573, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
	.dwattr DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$573, DW_AT_accessibility(DW_ACCESS_public)
DW$574	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
	.dwattr DW$574, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
	.dwattr DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$574, DW_AT_accessibility(DW_ACCESS_public)
DW$575	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$575, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
	.dwattr DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$575, DW_AT_accessibility(DW_ACCESS_public)
DW$576	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
	.dwattr DW$576, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
	.dwattr DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$576, DW_AT_accessibility(DW_ACCESS_public)
DW$577	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$577, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
	.dwattr DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$577, DW_AT_accessibility(DW_ACCESS_public)
DW$578	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
	.dwattr DW$578, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
	.dwattr DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$578, DW_AT_accessibility(DW_ACCESS_public)
DW$579	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
	.dwattr DW$579, DW_AT_name("findfsname"), DW_AT_symbol_name("_findfsname")
	.dwattr DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$579, DW_AT_accessibility(DW_ACCESS_public)
DW$580	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$580, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
	.dwattr DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$48

DW$T$106	.dwtag  DW_TAG_typedef, DW_AT_name("F_FILE"), DW_AT_type(*DW$T$49)
	.dwattr DW$T$106, DW_AT_language(DW_LANG_C)
DW$T$75	.dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$50)
	.dwattr DW$T$75, DW_AT_language(DW_LANG_C)

DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$51, DW_AT_name("tag_eventlogvarsstruct")
	.dwattr DW$T$51, DW_AT_byte_size(0x03)
DW$581	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$581, DW_AT_name("eventlogid"), DW_AT_symbol_name("_eventlogid")
	.dwattr DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$581, DW_AT_accessibility(DW_ACCESS_public)
DW$582	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$582, DW_AT_name("msgqueue"), DW_AT_symbol_name("_msgqueue")
	.dwattr DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$582, DW_AT_accessibility(DW_ACCESS_public)
DW$583	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$583, DW_AT_name("eventlogwrapflag"), DW_AT_symbol_name("_eventlogwrapflag")
	.dwattr DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$51


DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$53, DW_AT_name("tag_settingsstruct")
	.dwattr DW$T$53, DW_AT_byte_size(0x24)
DW$584	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$584, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
	.dwattr DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$584, DW_AT_accessibility(DW_ACCESS_public)
DW$585	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$585, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
	.dwattr DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$585, DW_AT_accessibility(DW_ACCESS_public)
DW$586	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$586, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
	.dwattr DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$586, DW_AT_accessibility(DW_ACCESS_public)
DW$587	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$587, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
	.dwattr DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$587, DW_AT_accessibility(DW_ACCESS_public)
DW$588	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$588, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
	.dwattr DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$588, DW_AT_accessibility(DW_ACCESS_public)
DW$589	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$589, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
	.dwattr DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$589, DW_AT_accessibility(DW_ACCESS_public)
DW$590	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$590, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
	.dwattr DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$590, DW_AT_accessibility(DW_ACCESS_public)
DW$591	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$591, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
	.dwattr DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$591, DW_AT_accessibility(DW_ACCESS_public)
DW$592	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$592, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
	.dwattr DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$592, DW_AT_accessibility(DW_ACCESS_public)
DW$593	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$593, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
	.dwattr DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$593, DW_AT_accessibility(DW_ACCESS_public)
DW$594	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$594, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
	.dwattr DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$594, DW_AT_accessibility(DW_ACCESS_public)
DW$595	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$595, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
	.dwattr DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$595, DW_AT_accessibility(DW_ACCESS_public)
DW$596	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$596, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
	.dwattr DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$596, DW_AT_accessibility(DW_ACCESS_public)
DW$597	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$597, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$597, DW_AT_accessibility(DW_ACCESS_public)
DW$598	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$598, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
	.dwattr DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$598, DW_AT_accessibility(DW_ACCESS_public)
DW$599	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$599, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
	.dwattr DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$599, DW_AT_accessibility(DW_ACCESS_public)
DW$600	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$600, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
	.dwattr DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$600, DW_AT_accessibility(DW_ACCESS_public)
DW$601	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$601, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
	.dwattr DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$601, DW_AT_accessibility(DW_ACCESS_public)
DW$602	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$602, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
	.dwattr DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$602, DW_AT_accessibility(DW_ACCESS_public)
DW$603	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$603, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
	.dwattr DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$603, DW_AT_accessibility(DW_ACCESS_public)
DW$604	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$604, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
	.dwattr DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$604, DW_AT_accessibility(DW_ACCESS_public)
DW$605	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$605, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$605, DW_AT_accessibility(DW_ACCESS_public)
DW$606	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$606, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
	.dwattr DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$606, DW_AT_accessibility(DW_ACCESS_public)
DW$607	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$607, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
	.dwattr DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$607, DW_AT_accessibility(DW_ACCESS_public)
DW$608	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$608, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$608, DW_AT_accessibility(DW_ACCESS_public)
DW$609	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$609, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$609, DW_AT_accessibility(DW_ACCESS_public)
DW$610	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$610, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$610, DW_AT_accessibility(DW_ACCESS_public)
DW$611	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$611, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$611, DW_AT_accessibility(DW_ACCESS_public)
DW$612	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$612, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$612, DW_AT_accessibility(DW_ACCESS_public)
DW$613	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$613, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
	.dwattr DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$613, DW_AT_accessibility(DW_ACCESS_public)
DW$614	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$614, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
	.dwattr DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$614, DW_AT_accessibility(DW_ACCESS_public)
DW$615	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$615, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
	.dwattr DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$615, DW_AT_accessibility(DW_ACCESS_public)
DW$616	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$616, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
	.dwattr DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$616, DW_AT_accessibility(DW_ACCESS_public)
DW$617	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$617, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
	.dwattr DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$617, DW_AT_accessibility(DW_ACCESS_public)
DW$618	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$618, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$53


DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$54, DW_AT_name("tag_livestruct")
	.dwattr DW$T$54, DW_AT_byte_size(0x03)
DW$619	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$619, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
	.dwattr DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$619, DW_AT_accessibility(DW_ACCESS_public)
DW$620	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$620, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
	.dwattr DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$620, DW_AT_accessibility(DW_ACCESS_public)
DW$621	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$621, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
	.dwattr DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$54


DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$57, DW_AT_name("tag_calibrationdatetimestruct")
	.dwattr DW$T$57, DW_AT_byte_size(0x07)
DW$622	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
	.dwattr DW$622, DW_AT_name("calcomplete"), DW_AT_symbol_name("_calcomplete")
	.dwattr DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$622, DW_AT_accessibility(DW_ACCESS_public)
DW$623	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$623, DW_AT_name("verification"), DW_AT_symbol_name("_verification")
	.dwattr DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$623, DW_AT_accessibility(DW_ACCESS_public)
DW$624	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$624, DW_AT_name("chksum"), DW_AT_symbol_name("_chksum")
	.dwattr DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$57


DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$58, DW_AT_name("tag_clockstruct")
	.dwattr DW$T$58, DW_AT_byte_size(0x0e)
DW$625	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$625, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
	.dwattr DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$625, DW_AT_accessibility(DW_ACCESS_public)
DW$626	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$626, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
	.dwattr DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$626, DW_AT_accessibility(DW_ACCESS_public)
DW$627	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$627, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
	.dwattr DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$627, DW_AT_accessibility(DW_ACCESS_public)
DW$628	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$628, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
	.dwattr DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$628, DW_AT_accessibility(DW_ACCESS_public)
DW$629	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$629, DW_AT_name("day"), DW_AT_symbol_name("_day")
	.dwattr DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$629, DW_AT_accessibility(DW_ACCESS_public)
DW$630	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$630, DW_AT_name("date"), DW_AT_symbol_name("_date")
	.dwattr DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$630, DW_AT_accessibility(DW_ACCESS_public)
DW$631	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$631, DW_AT_name("month"), DW_AT_symbol_name("_month")
	.dwattr DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$631, DW_AT_accessibility(DW_ACCESS_public)
DW$632	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$632, DW_AT_name("year"), DW_AT_symbol_name("_year")
	.dwattr DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$632, DW_AT_accessibility(DW_ACCESS_public)
DW$633	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$633, DW_AT_name("control"), DW_AT_symbol_name("_control")
	.dwattr DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$633, DW_AT_accessibility(DW_ACCESS_public)
DW$634	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$634, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
	.dwattr DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$634, DW_AT_accessibility(DW_ACCESS_public)
DW$635	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$635, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
	.dwattr DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$58

DW$T$331	.dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$60)
	.dwattr DW$T$331, DW_AT_language(DW_LANG_C)

DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$63, DW_AT_name("tag_allsensorstruct")
	.dwattr DW$T$63, DW_AT_byte_size(0x2d)
DW$636	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$636, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
	.dwattr DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$636, DW_AT_accessibility(DW_ACCESS_public)
DW$637	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$637, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
	.dwattr DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$637, DW_AT_accessibility(DW_ACCESS_public)
DW$638	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$638, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
	.dwattr DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$638, DW_AT_accessibility(DW_ACCESS_public)
DW$639	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$639, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
	.dwattr DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$639, DW_AT_accessibility(DW_ACCESS_public)
DW$640	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$640, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
	.dwattr DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$640, DW_AT_accessibility(DW_ACCESS_public)
DW$641	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$641, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
	.dwattr DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$641, DW_AT_accessibility(DW_ACCESS_public)
DW$642	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$642, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
	.dwattr DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$642, DW_AT_accessibility(DW_ACCESS_public)
DW$643	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$643, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
	.dwattr DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$643, DW_AT_accessibility(DW_ACCESS_public)
DW$644	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$644, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
	.dwattr DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$644, DW_AT_accessibility(DW_ACCESS_public)
DW$645	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$645, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
	.dwattr DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$645, DW_AT_accessibility(DW_ACCESS_public)
DW$646	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$646, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$646, DW_AT_accessibility(DW_ACCESS_public)
DW$647	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$647, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
	.dwattr DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$647, DW_AT_accessibility(DW_ACCESS_public)
DW$648	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$648, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
	.dwattr DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$648, DW_AT_accessibility(DW_ACCESS_public)
DW$649	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$649, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
	.dwattr DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$649, DW_AT_accessibility(DW_ACCESS_public)
DW$650	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$650, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
	.dwattr DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$650, DW_AT_accessibility(DW_ACCESS_public)
DW$651	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$651, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
	.dwattr DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$651, DW_AT_accessibility(DW_ACCESS_public)
DW$652	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
	.dwattr DW$652, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
	.dwattr DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$652, DW_AT_accessibility(DW_ACCESS_public)
DW$653	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$653, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
	.dwattr DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$653, DW_AT_accessibility(DW_ACCESS_public)
DW$654	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$654, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
	.dwattr DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$654, DW_AT_accessibility(DW_ACCESS_public)
DW$655	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$655, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
	.dwattr DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$655, DW_AT_accessibility(DW_ACCESS_public)
DW$656	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$656, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
	.dwattr DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$656, DW_AT_accessibility(DW_ACCESS_public)
DW$657	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$657, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
	.dwattr DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$657, DW_AT_accessibility(DW_ACCESS_public)
DW$658	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$658, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
	.dwattr DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$658, DW_AT_accessibility(DW_ACCESS_public)
DW$659	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$659, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
	.dwattr DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$659, DW_AT_accessibility(DW_ACCESS_public)
DW$660	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$660, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
	.dwattr DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr DW$660, DW_AT_accessibility(DW_ACCESS_public)
DW$661	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$661, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
	.dwattr DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$661, DW_AT_accessibility(DW_ACCESS_public)
DW$662	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$662, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
	.dwattr DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$662, DW_AT_accessibility(DW_ACCESS_public)
DW$663	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$663, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
	.dwattr DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$663, DW_AT_accessibility(DW_ACCESS_public)
DW$664	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$664, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
	.dwattr DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$664, DW_AT_accessibility(DW_ACCESS_public)
DW$665	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
	.dwattr DW$665, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$665, DW_AT_accessibility(DW_ACCESS_public)
DW$666	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$666, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow")
	.dwattr DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$666, DW_AT_accessibility(DW_ACCESS_public)
DW$667	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$667, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHigh")
	.dwattr DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$63


DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$64, DW_AT_name("tag_engingestruct")
	.dwattr DW$T$64, DW_AT_byte_size(0x02)
DW$668	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$668, DW_AT_name("runtime"), DW_AT_symbol_name("_runtime")
	.dwattr DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$64


DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$71, DW_AT_name("tag_configstruct")
	.dwattr DW$T$71, DW_AT_byte_size(0x18)
DW$669	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
	.dwattr DW$669, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
	.dwattr DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$669, DW_AT_accessibility(DW_ACCESS_public)
DW$670	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$670, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
	.dwattr DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$670, DW_AT_accessibility(DW_ACCESS_public)
DW$671	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
	.dwattr DW$671, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
	.dwattr DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$671, DW_AT_accessibility(DW_ACCESS_public)
DW$672	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
	.dwattr DW$672, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
	.dwattr DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$672, DW_AT_accessibility(DW_ACCESS_public)
DW$673	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$673, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
	.dwattr DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$673, DW_AT_accessibility(DW_ACCESS_public)
DW$674	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$674, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
	.dwattr DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$71


DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$73, DW_AT_name("tag_offsetstruct")
	.dwattr DW$T$73, DW_AT_byte_size(0x1c)
DW$675	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
	.dwattr DW$675, DW_AT_name("val"), DW_AT_symbol_name("_val")
	.dwattr DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$73

DW$T$341	.dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$77)
	.dwattr DW$T$341, DW_AT_language(DW_LANG_C)
DW$T$345	.dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$78)
	.dwattr DW$T$345, DW_AT_language(DW_LANG_C)

DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$79, DW_AT_name("tag_damagemonstruct")
	.dwattr DW$T$79, DW_AT_byte_size(0x10)
DW$676	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$676, DW_AT_name("ccsplit"), DW_AT_symbol_name("_ccsplit")
	.dwattr DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$676, DW_AT_accessibility(DW_ACCESS_public)
DW$677	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$677, DW_AT_name("kvalue"), DW_AT_symbol_name("_kvalue")
	.dwattr DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$677, DW_AT_accessibility(DW_ACCESS_public)
DW$678	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$678, DW_AT_name("betavalue"), DW_AT_symbol_name("_betavalue")
	.dwattr DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$678, DW_AT_accessibility(DW_ACCESS_public)
DW$679	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$679, DW_AT_name("rpmlevelx"), DW_AT_symbol_name("_rpmlevelx")
	.dwattr DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$679, DW_AT_accessibility(DW_ACCESS_public)
DW$680	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$680, DW_AT_name("reflevelx"), DW_AT_symbol_name("_reflevelx")
	.dwattr DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$680, DW_AT_accessibility(DW_ACCESS_public)
DW$681	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$681, DW_AT_name("presentstatex"), DW_AT_symbol_name("_presentstatex")
	.dwattr DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$681, DW_AT_accessibility(DW_ACCESS_public)
DW$682	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$682, DW_AT_name("alarmlevelsingle"), DW_AT_symbol_name("_alarmlevelsingle")
	.dwattr DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$682, DW_AT_accessibility(DW_ACCESS_public)
DW$683	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$683, DW_AT_name("alarmlevelcyl"), DW_AT_symbol_name("_alarmlevelcyl")
	.dwattr DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$683, DW_AT_accessibility(DW_ACCESS_public)
DW$684	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$684, DW_AT_name("alarmlevelmbsum"), DW_AT_symbol_name("_alarmlevelmbsum")
	.dwattr DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$684, DW_AT_accessibility(DW_ACCESS_public)
DW$685	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$685, DW_AT_name("cylneighbour"), DW_AT_symbol_name("_cylneighbour")
	.dwattr DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$685, DW_AT_accessibility(DW_ACCESS_public)
DW$686	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$686, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
	.dwattr DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$686, DW_AT_accessibility(DW_ACCESS_public)
DW$687	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$687, DW_AT_name("cylneighbouralarms"), DW_AT_symbol_name("_cylneighbouralarms")
	.dwattr DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$687, DW_AT_accessibility(DW_ACCESS_public)
DW$688	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$688, DW_AT_name("mbneighbouralarms"), DW_AT_symbol_name("_mbneighbouralarms")
	.dwattr DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$688, DW_AT_accessibility(DW_ACCESS_public)
DW$689	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$689, DW_AT_name("deltarpmlimit"), DW_AT_symbol_name("_deltarpmlimit")
	.dwattr DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$689, DW_AT_accessibility(DW_ACCESS_public)
DW$690	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$690, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
	.dwattr DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$690, DW_AT_accessibility(DW_ACCESS_public)
DW$691	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$691, DW_AT_name("damagemonenb"), DW_AT_symbol_name("_damagemonenb")
	.dwattr DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$691, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$79


DW$T$80	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$80, DW_AT_name("tag_dynamicalarmsstruct")
	.dwattr DW$T$80, DW_AT_byte_size(0x24)
DW$692	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$692, DW_AT_name("rpmav"), DW_AT_symbol_name("_rpmav")
	.dwattr DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$692, DW_AT_accessibility(DW_ACCESS_public)
DW$693	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$693, DW_AT_name("single1"), DW_AT_symbol_name("_single1")
	.dwattr DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$693, DW_AT_accessibility(DW_ACCESS_public)
DW$694	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$694, DW_AT_name("cyl1"), DW_AT_symbol_name("_cyl1")
	.dwattr DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$694, DW_AT_accessibility(DW_ACCESS_public)
DW$695	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$695, DW_AT_name("mbsum1"), DW_AT_symbol_name("_mbsum1")
	.dwattr DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$695, DW_AT_accessibility(DW_ACCESS_public)
DW$696	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$696, DW_AT_name("single2"), DW_AT_symbol_name("_single2")
	.dwattr DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$696, DW_AT_accessibility(DW_ACCESS_public)
DW$697	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$697, DW_AT_name("cyl2"), DW_AT_symbol_name("_cyl2")
	.dwattr DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$697, DW_AT_accessibility(DW_ACCESS_public)
DW$698	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$698, DW_AT_name("mbsum2"), DW_AT_symbol_name("_mbsum2")
	.dwattr DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$698, DW_AT_accessibility(DW_ACCESS_public)
DW$699	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$699, DW_AT_name("deltarpmprev"), DW_AT_symbol_name("_deltarpmprev")
	.dwattr DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$699, DW_AT_accessibility(DW_ACCESS_public)
DW$700	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
	.dwattr DW$700, DW_AT_name("deltarpm"), DW_AT_symbol_name("_deltarpm")
	.dwattr DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$700, DW_AT_accessibility(DW_ACCESS_public)
DW$701	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$701, DW_AT_name("deltarpm_int"), DW_AT_symbol_name("_deltarpm_int")
	.dwattr DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$701, DW_AT_accessibility(DW_ACCESS_public)
DW$702	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$702, DW_AT_name("rpmav_int"), DW_AT_symbol_name("_rpmav_int")
	.dwattr DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$702, DW_AT_accessibility(DW_ACCESS_public)
DW$703	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$703, DW_AT_name("deltarpmprev_int"), DW_AT_symbol_name("_deltarpmprev_int")
	.dwattr DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$703, DW_AT_accessibility(DW_ACCESS_public)
DW$704	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$704, DW_AT_name("single"), DW_AT_symbol_name("_single")
	.dwattr DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$704, DW_AT_accessibility(DW_ACCESS_public)
DW$705	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$705, DW_AT_name("cyl"), DW_AT_symbol_name("_cyl")
	.dwattr DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$705, DW_AT_accessibility(DW_ACCESS_public)
DW$706	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$706, DW_AT_name("mbsum"), DW_AT_symbol_name("_mbsum")
	.dwattr DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$706, DW_AT_accessibility(DW_ACCESS_public)
DW$707	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$707, DW_AT_name("singleprev"), DW_AT_symbol_name("_singleprev")
	.dwattr DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$707, DW_AT_accessibility(DW_ACCESS_public)
DW$708	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$708, DW_AT_name("cylprev"), DW_AT_symbol_name("_cylprev")
	.dwattr DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr DW$708, DW_AT_accessibility(DW_ACCESS_public)
DW$709	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$709, DW_AT_name("mbsumprev"), DW_AT_symbol_name("_mbsumprev")
	.dwattr DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$709, DW_AT_accessibility(DW_ACCESS_public)
DW$710	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$710, DW_AT_name("single1_int"), DW_AT_symbol_name("_single1_int")
	.dwattr DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr DW$710, DW_AT_accessibility(DW_ACCESS_public)
DW$711	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$711, DW_AT_name("cyl1_int"), DW_AT_symbol_name("_cyl1_int")
	.dwattr DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$711, DW_AT_accessibility(DW_ACCESS_public)
DW$712	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$712, DW_AT_name("mbsum1_int"), DW_AT_symbol_name("_mbsum1_int")
	.dwattr DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr DW$712, DW_AT_accessibility(DW_ACCESS_public)
DW$713	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$713, DW_AT_name("single2_int"), DW_AT_symbol_name("_single2_int")
	.dwattr DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$713, DW_AT_accessibility(DW_ACCESS_public)
DW$714	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$714, DW_AT_name("cyl2_int"), DW_AT_symbol_name("_cyl2_int")
	.dwattr DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr DW$714, DW_AT_accessibility(DW_ACCESS_public)
DW$715	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$715, DW_AT_name("mbsum2_int"), DW_AT_symbol_name("_mbsum2_int")
	.dwattr DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$715, DW_AT_accessibility(DW_ACCESS_public)
DW$716	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$716, DW_AT_name("hits"), DW_AT_symbol_name("_hits")
	.dwattr DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$716, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$80


DW$T$83	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$83, DW_AT_name("tag_speedcompstruct")
	.dwattr DW$T$83, DW_AT_byte_size(0x19)
DW$717	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$717, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
	.dwattr DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$717, DW_AT_accessibility(DW_ACCESS_public)
DW$718	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$718, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$718, DW_AT_accessibility(DW_ACCESS_public)
DW$719	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
	.dwattr DW$719, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
	.dwattr DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$719, DW_AT_accessibility(DW_ACCESS_public)
DW$720	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$720, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
	.dwattr DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$720, DW_AT_accessibility(DW_ACCESS_public)
DW$721	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$721, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
	.dwattr DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$721, DW_AT_accessibility(DW_ACCESS_public)
DW$722	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$722, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
	.dwattr DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$722, DW_AT_accessibility(DW_ACCESS_public)
DW$723	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$723, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
	.dwattr DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$723, DW_AT_accessibility(DW_ACCESS_public)
DW$724	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$724, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
	.dwattr DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$724, DW_AT_accessibility(DW_ACCESS_public)
DW$725	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$725, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
	.dwattr DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$725, DW_AT_accessibility(DW_ACCESS_public)
DW$726	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$726, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
	.dwattr DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$726, DW_AT_accessibility(DW_ACCESS_public)
DW$727	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$727, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
	.dwattr DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$727, DW_AT_accessibility(DW_ACCESS_public)
DW$728	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$728, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$728, DW_AT_accessibility(DW_ACCESS_public)
DW$729	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$729, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$729, DW_AT_accessibility(DW_ACCESS_public)
DW$730	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$730, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$730, DW_AT_accessibility(DW_ACCESS_public)
DW$731	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$731, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr DW$731, DW_AT_accessibility(DW_ACCESS_public)
DW$732	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$732, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$732, DW_AT_accessibility(DW_ACCESS_public)
DW$733	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$733, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr DW$733, DW_AT_accessibility(DW_ACCESS_public)
DW$734	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$734, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
DW$735	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$735, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
DW$736	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$736, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$83


DW$T$84	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$84, DW_AT_name("tag_wiosettingsstruct")
	.dwattr DW$T$84, DW_AT_byte_size(0x0a)
DW$737	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$737, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
DW$738	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$738, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
	.dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
DW$739	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$739, DW_AT_name("alarmupperlevel"), DW_AT_symbol_name("_alarmupperlevel")
	.dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
DW$740	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$740, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
DW$741	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$741, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
	.dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
DW$742	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$742, DW_AT_name("scaledmin"), DW_AT_symbol_name("_scaledmin")
	.dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
DW$743	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$743, DW_AT_name("scaledmax"), DW_AT_symbol_name("_scaledmax")
	.dwattr DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$743, DW_AT_accessibility(DW_ACCESS_public)
DW$744	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$744, DW_AT_name("units"), DW_AT_symbol_name("_units")
	.dwattr DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$744, DW_AT_accessibility(DW_ACCESS_public)
DW$745	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$745, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$745, DW_AT_accessibility(DW_ACCESS_public)
DW$746	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$746, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$746, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$84


DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$85, DW_AT_name("tag_slemsettingsstruct")
	.dwattr DW$T$85, DW_AT_byte_size(0x06)
DW$747	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$747, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$747, DW_AT_accessibility(DW_ACCESS_public)
DW$748	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$748, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
	.dwattr DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$748, DW_AT_accessibility(DW_ACCESS_public)
DW$749	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$749, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
	.dwattr DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$749, DW_AT_accessibility(DW_ACCESS_public)
DW$750	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$750, DW_AT_name("mVfsd"), DW_AT_symbol_name("_mVfsd")
	.dwattr DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$750, DW_AT_accessibility(DW_ACCESS_public)
DW$751	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$751, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
	.dwattr DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$751, DW_AT_accessibility(DW_ACCESS_public)
DW$752	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$752, DW_AT_name("alarmdelay"), DW_AT_symbol_name("_alarmdelay")
	.dwattr DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$752, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$85


DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$87, DW_AT_name("tag_slemsstruct")
	.dwattr DW$T$87, DW_AT_byte_size(0x03)
DW$753	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$753, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
	.dwattr DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$753, DW_AT_accessibility(DW_ACCESS_public)
DW$754	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$754, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
	.dwattr DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$754, DW_AT_accessibility(DW_ACCESS_public)
DW$755	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$755, DW_AT_name("levelcount"), DW_AT_symbol_name("_levelcount")
	.dwattr DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$755, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$87


DW$T$88	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$88, DW_AT_name("tag_cppsettingsstruct")
	.dwattr DW$T$88, DW_AT_byte_size(0x10)
DW$756	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$756, DW_AT_name("iCppEnable"), DW_AT_symbol_name("_iCppEnable")
	.dwattr DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$756, DW_AT_accessibility(DW_ACCESS_public)
DW$757	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$757, DW_AT_name("iCppLowLimit"), DW_AT_symbol_name("_iCppLowLimit")
	.dwattr DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$757, DW_AT_accessibility(DW_ACCESS_public)
DW$758	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$758, DW_AT_name("iCppHighLimit"), DW_AT_symbol_name("_iCppHighLimit")
	.dwattr DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$758, DW_AT_accessibility(DW_ACCESS_public)
DW$759	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$759, DW_AT_name("cppkvalue"), DW_AT_symbol_name("_cppkvalue")
	.dwattr DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$759, DW_AT_accessibility(DW_ACCESS_public)
DW$760	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$760, DW_AT_name("gammavalue"), DW_AT_symbol_name("_gammavalue")
	.dwattr DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$760, DW_AT_accessibility(DW_ACCESS_public)
DW$761	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$761, DW_AT_name("cpplevelx"), DW_AT_symbol_name("_cpplevelx")
	.dwattr DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$761, DW_AT_accessibility(DW_ACCESS_public)
DW$762	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$762, DW_AT_name("delatRpmPauseDelay"), DW_AT_symbol_name("_delatRpmPauseDelay")
	.dwattr DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$762, DW_AT_accessibility(DW_ACCESS_public)
DW$763	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$763, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
	.dwattr DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$763, DW_AT_accessibility(DW_ACCESS_public)
DW$764	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$764, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$764, DW_AT_accessibility(DW_ACCESS_public)
DW$765	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$765, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$765, DW_AT_accessibility(DW_ACCESS_public)
DW$766	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$766, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$766, DW_AT_accessibility(DW_ACCESS_public)
DW$767	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$767, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$767, DW_AT_accessibility(DW_ACCESS_public)
DW$768	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$768, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$768, DW_AT_accessibility(DW_ACCESS_public)
DW$769	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$769, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$769, DW_AT_accessibility(DW_ACCESS_public)
DW$770	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$770, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$770, DW_AT_accessibility(DW_ACCESS_public)
DW$771	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$771, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$771, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$88


DW$T$89	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$89, DW_AT_name("tag_sensorMoving")
	.dwattr DW$T$89, DW_AT_byte_size(0x02)
DW$772	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$772, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
	.dwattr DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$772, DW_AT_accessibility(DW_ACCESS_public)
DW$773	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$773, DW_AT_name("unusedByte"), DW_AT_symbol_name("_unusedByte")
	.dwattr DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$773, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$89


DW$T$93	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$93, DW_AT_name("tag_dcmodechecksstruct")
	.dwattr DW$T$93, DW_AT_byte_size(0x0f)
DW$774	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
	.dwattr DW$774, DW_AT_name("ideal"), DW_AT_symbol_name("_ideal")
	.dwattr DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$774, DW_AT_accessibility(DW_ACCESS_public)
DW$775	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
	.dwattr DW$775, DW_AT_name("ok"), DW_AT_symbol_name("_ok")
	.dwattr DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$775, DW_AT_accessibility(DW_ACCESS_public)
DW$776	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
	.dwattr DW$776, DW_AT_name("cylinderComparison"), DW_AT_symbol_name("_cylinderComparison")
	.dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
DW$777	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$777, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
	.dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
DW$778	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$778, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
	.dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
DW$779	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$779, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
	.dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
DW$780	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$780, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
	.dwattr DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$780, DW_AT_accessibility(DW_ACCESS_public)
DW$781	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$781, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
	.dwattr DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$781, DW_AT_accessibility(DW_ACCESS_public)
DW$782	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$782, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
	.dwattr DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$782, DW_AT_accessibility(DW_ACCESS_public)
DW$783	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$783, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$783, DW_AT_accessibility(DW_ACCESS_public)
DW$784	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$784, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr DW$784, DW_AT_accessibility(DW_ACCESS_public)
DW$785	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$785, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$785, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$93

DW$T$365	.dwtag  DW_TAG_typedef, DW_AT_name("inputstruct"), DW_AT_type(*DW$T$105)
	.dwattr DW$T$365, DW_AT_language(DW_LANG_C)

DW$T$111	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$111, DW_AT_name("tag_sdfilestruct")
	.dwattr DW$T$111, DW_AT_byte_size(0x14e)
DW$786	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$786, DW_AT_name("year1"), DW_AT_symbol_name("_year1")
	.dwattr DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$786, DW_AT_accessibility(DW_ACCESS_public)
DW$787	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$787, DW_AT_name("month1"), DW_AT_symbol_name("_month1")
	.dwattr DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$787, DW_AT_accessibility(DW_ACCESS_public)
DW$788	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$788, DW_AT_name("date1"), DW_AT_symbol_name("_date1")
	.dwattr DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$788, DW_AT_accessibility(DW_ACCESS_public)
DW$789	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$789, DW_AT_name("yearn"), DW_AT_symbol_name("_yearn")
	.dwattr DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$789, DW_AT_accessibility(DW_ACCESS_public)
DW$790	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$790, DW_AT_name("monthn"), DW_AT_symbol_name("_monthn")
	.dwattr DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$790, DW_AT_accessibility(DW_ACCESS_public)
DW$791	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$791, DW_AT_name("daten"), DW_AT_symbol_name("_daten")
	.dwattr DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$791, DW_AT_accessibility(DW_ACCESS_public)
DW$792	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$792, DW_AT_name("readyear"), DW_AT_symbol_name("_readyear")
	.dwattr DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$792, DW_AT_accessibility(DW_ACCESS_public)
DW$793	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$793, DW_AT_name("readmonth"), DW_AT_symbol_name("_readmonth")
	.dwattr DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$793, DW_AT_accessibility(DW_ACCESS_public)
DW$794	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$794, DW_AT_name("readdate"), DW_AT_symbol_name("_readdate")
	.dwattr DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$794, DW_AT_accessibility(DW_ACCESS_public)
DW$795	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
	.dwattr DW$795, DW_AT_name("file"), DW_AT_symbol_name("_file")
	.dwattr DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$795, DW_AT_accessibility(DW_ACCESS_public)
DW$796	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
	.dwattr DW$796, DW_AT_name("readbuffer"), DW_AT_symbol_name("_readbuffer")
	.dwattr DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$796, DW_AT_accessibility(DW_ACCESS_public)
DW$797	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$797, DW_AT_name("entryposition"), DW_AT_symbol_name("_entryposition")
	.dwattr DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr DW$797, DW_AT_accessibility(DW_ACCESS_public)
DW$798	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$798, DW_AT_name("logtype"), DW_AT_symbol_name("_logtype")
	.dwattr DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr DW$798, DW_AT_accessibility(DW_ACCESS_public)
DW$799	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$109)
	.dwattr DW$799, DW_AT_name("directorystr"), DW_AT_symbol_name("_directorystr")
	.dwattr DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x13b]
	.dwattr DW$799, DW_AT_accessibility(DW_ACCESS_public)
DW$800	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
	.dwattr DW$800, DW_AT_name("filenamestr"), DW_AT_symbol_name("_filenamestr")
	.dwattr DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x13f]
	.dwattr DW$800, DW_AT_accessibility(DW_ACCESS_public)
DW$801	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$801, DW_AT_name("getnumwords"), DW_AT_symbol_name("_getnumwords")
	.dwattr DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x146]
	.dwattr DW$801, DW_AT_accessibility(DW_ACCESS_public)
DW$802	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$802, DW_AT_name("setnumwords"), DW_AT_symbol_name("_setnumwords")
	.dwattr DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr DW$802, DW_AT_accessibility(DW_ACCESS_public)
DW$803	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$803, DW_AT_name("setoffset"), DW_AT_symbol_name("_setoffset")
	.dwattr DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x14a]
	.dwattr DW$803, DW_AT_accessibility(DW_ACCESS_public)
DW$804	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$804, DW_AT_name("readwriteflag"), DW_AT_symbol_name("_readwriteflag")
	.dwattr DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr DW$804, DW_AT_accessibility(DW_ACCESS_public)
DW$805	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$805, DW_AT_name("readwriteprogress"), DW_AT_symbol_name("_readwriteprogress")
	.dwattr DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x14d]
	.dwattr DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$111


DW$T$113	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$113, DW_AT_name("tag_sdsettingsstruct")
	.dwattr DW$T$113, DW_AT_byte_size(0x04)
DW$806	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$806, DW_AT_name("present"), DW_AT_symbol_name("_present")
	.dwattr DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$806, DW_AT_accessibility(DW_ACCESS_public)
DW$807	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$807, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
	.dwattr DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$807, DW_AT_accessibility(DW_ACCESS_public)
DW$808	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$808, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
	.dwattr DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$808, DW_AT_accessibility(DW_ACCESS_public)
DW$809	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
	.dwattr DW$809, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
	.dwattr DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$809, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$113


DW$T$119	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$119, DW_AT_name("tag_shorttermlogstruct")
	.dwattr DW$T$119, DW_AT_byte_size(0x2e)
DW$810	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$810, DW_AT_name("setupvalue"), DW_AT_symbol_name("_setupvalue")
	.dwattr DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$810, DW_AT_accessibility(DW_ACCESS_public)
DW$811	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
	.dwattr DW$811, DW_AT_name("sdcard"), DW_AT_symbol_name("_sdcard")
	.dwattr DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$811, DW_AT_accessibility(DW_ACCESS_public)
DW$812	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$118)
	.dwattr DW$812, DW_AT_name("sdshorttermfilenames"), DW_AT_symbol_name("_sdshorttermfilenames")
	.dwattr DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$812, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$119


DW$T$121	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$121, DW_AT_name("tag_longtermlogstruct")
	.dwattr DW$T$121, DW_AT_byte_size(0x14)
DW$813	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$120)
	.dwattr DW$813, DW_AT_name("sdcard"), DW_AT_symbol_name("_sdcard")
	.dwattr DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$813, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$121


DW$T$123	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$123, DW_AT_name("tag_asciilogstruct")
	.dwattr DW$T$123, DW_AT_byte_size(0x12)
DW$814	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$122)
	.dwattr DW$814, DW_AT_name("sdcard"), DW_AT_symbol_name("_sdcard")
	.dwattr DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$814, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$123


DW$T$125	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$125, DW_AT_name("tag_mansdstruct")
	.dwattr DW$T$125, DW_AT_byte_size(0x19)
DW$815	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$124)
	.dwattr DW$815, DW_AT_name("sdcard"), DW_AT_symbol_name("_sdcard")
	.dwattr DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$815, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$125

DW$T$380	.dwtag  DW_TAG_typedef, DW_AT_name("sdcarddirstruct"), DW_AT_type(*DW$T$127)
	.dwattr DW$T$380, DW_AT_language(DW_LANG_C)
DW$T$9	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$9, DW_AT_byte_size(0x01)

DW$T$72	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$72, DW_AT_byte_size(0x1c)
DW$816	.dwtag  DW_TAG_subrange_type
	.dwattr DW$816, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$72


DW$T$59	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$59, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$59, DW_AT_byte_size(0x0e)
DW$817	.dwtag  DW_TAG_subrange_type
	.dwattr DW$817, DW_AT_upper_bound(0x0d)
	.dwendtag DW$T$59


DW$T$82	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$82, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$82, DW_AT_byte_size(0x06)
DW$818	.dwtag  DW_TAG_subrange_type
	.dwattr DW$818, DW_AT_upper_bound(0x02)
DW$819	.dwtag  DW_TAG_subrange_type
	.dwattr DW$819, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$82


DW$T$109	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$109, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$109, DW_AT_byte_size(0x04)
DW$820	.dwtag  DW_TAG_subrange_type
	.dwattr DW$820, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$109


DW$T$110	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
	.dwattr DW$T$110, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$110, DW_AT_byte_size(0x06)
DW$821	.dwtag  DW_TAG_subrange_type
	.dwattr DW$821, DW_AT_upper_bound(0x05)
	.dwendtag DW$T$110

DW$T$16	.dwtag  DW_TAG_base_type, DW_AT_name("float")
	.dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr DW$T$16, DW_AT_byte_size(0x02)

DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$39, DW_AT_byte_size(0x10)
DW$822	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$822, DW_AT_name("writesector"), DW_AT_symbol_name("_writesector")
	.dwattr DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$822, DW_AT_accessibility(DW_ACCESS_public)
DW$823	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$823, DW_AT_name("writemultiplesector"), DW_AT_symbol_name("_writemultiplesector")
	.dwattr DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$823, DW_AT_accessibility(DW_ACCESS_public)
DW$824	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$824, DW_AT_name("readsector"), DW_AT_symbol_name("_readsector")
	.dwattr DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$824, DW_AT_accessibility(DW_ACCESS_public)
DW$825	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$825, DW_AT_name("readmultiplesector"), DW_AT_symbol_name("_readmultiplesector")
	.dwattr DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$825, DW_AT_accessibility(DW_ACCESS_public)
DW$826	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$826, DW_AT_name("getphy"), DW_AT_symbol_name("_getphy")
	.dwattr DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$826, DW_AT_accessibility(DW_ACCESS_public)
DW$827	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
	.dwattr DW$827, DW_AT_name("getstatus"), DW_AT_symbol_name("_getstatus")
	.dwattr DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$827, DW_AT_accessibility(DW_ACCESS_public)
DW$828	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$828, DW_AT_name("delfunc"), DW_AT_symbol_name("_delfunc")
	.dwattr DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$828, DW_AT_accessibility(DW_ACCESS_public)
DW$829	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$829, DW_AT_name("user_ptr"), DW_AT_symbol_name("_user_ptr")
	.dwattr DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$829, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$39


DW$T$41	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$41, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$41, DW_AT_byte_size(0x14)
DW$830	.dwtag  DW_TAG_subrange_type
	.dwattr DW$830, DW_AT_upper_bound(0x13)
	.dwendtag DW$T$41


DW$T$42	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$42, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$42, DW_AT_byte_size(0x08)
DW$831	.dwtag  DW_TAG_subrange_type
	.dwattr DW$831, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$42


DW$T$43	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$43, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$43, DW_AT_byte_size(0x03)
DW$832	.dwtag  DW_TAG_subrange_type
	.dwattr DW$832, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$43


DW$T$108	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$108, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$108, DW_AT_byte_size(0x12c)
DW$833	.dwtag  DW_TAG_subrange_type
	.dwattr DW$833, DW_AT_upper_bound(0x12b)
	.dwendtag DW$T$108

DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("F_NAME"), DW_AT_type(*DW$T$44)
	.dwattr DW$T$46, DW_AT_language(DW_LANG_C)
DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("F_POS"), DW_AT_type(*DW$T$45)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)

DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$49, DW_AT_byte_size(0x02)
DW$834	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$834, DW_AT_name("reference"), DW_AT_symbol_name("_reference")
	.dwattr DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$834, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$49


DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$50, DW_AT_name("tag_status1struct")
	.dwattr DW$T$50, DW_AT_byte_size(0x01)
DW$835	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$835, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
	.dwattr DW$835, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$835, DW_AT_accessibility(DW_ACCESS_public)
DW$836	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$836, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
	.dwattr DW$836, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$836, DW_AT_accessibility(DW_ACCESS_public)
DW$837	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$837, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
	.dwattr DW$837, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$837, DW_AT_accessibility(DW_ACCESS_public)
DW$838	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$838, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$838, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$838, DW_AT_accessibility(DW_ACCESS_public)
DW$839	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$839, DW_AT_name("replaced"), DW_AT_symbol_name("_replaced")
	.dwattr DW$839, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$839, DW_AT_accessibility(DW_ACCESS_public)
DW$840	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$840, DW_AT_name("excludeslowroll"), DW_AT_symbol_name("_excludeslowroll")
	.dwattr DW$840, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$840, DW_AT_accessibility(DW_ACCESS_public)
DW$841	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$841, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
	.dwattr DW$841, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$841, DW_AT_accessibility(DW_ACCESS_public)
DW$842	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$842, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
	.dwattr DW$842, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$842, DW_AT_accessibility(DW_ACCESS_public)
DW$843	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$843, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
	.dwattr DW$843, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$843, DW_AT_accessibility(DW_ACCESS_public)
DW$844	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$844, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
	.dwattr DW$844, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$844, DW_AT_accessibility(DW_ACCESS_public)
DW$845	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$845, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
	.dwattr DW$845, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$845, DW_AT_accessibility(DW_ACCESS_public)
DW$846	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$846, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
	.dwattr DW$846, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$846, DW_AT_accessibility(DW_ACCESS_public)
DW$847	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$847, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
	.dwattr DW$847, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$847, DW_AT_accessibility(DW_ACCESS_public)
DW$848	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$848, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
	.dwattr DW$848, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$848, DW_AT_accessibility(DW_ACCESS_public)
DW$849	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$849, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
	.dwattr DW$849, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$849, DW_AT_accessibility(DW_ACCESS_public)
DW$850	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$850, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
	.dwattr DW$850, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$850, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$50


DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$52, DW_AT_byte_size(0x02)
DW$851	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$851, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
	.dwattr DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$851, DW_AT_accessibility(DW_ACCESS_public)
DW$852	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$852, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
	.dwattr DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$852, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$52


DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$55, DW_AT_byte_size(0x03)
DW$853	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$853, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
	.dwattr DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$853, DW_AT_accessibility(DW_ACCESS_public)
DW$854	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$854, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
	.dwattr DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$854, DW_AT_accessibility(DW_ACCESS_public)
DW$855	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$855, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
	.dwattr DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$855, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$55


DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$56, DW_AT_byte_size(0x03)
DW$856	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$856, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
	.dwattr DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$856, DW_AT_accessibility(DW_ACCESS_public)
DW$857	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$857, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
	.dwattr DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$857, DW_AT_accessibility(DW_ACCESS_public)
DW$858	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$858, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
	.dwattr DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$858, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$56


DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$60, DW_AT_name("tag_timers")
	.dwattr DW$T$60, DW_AT_byte_size(0x4c)
DW$859	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$859, DW_AT_name("update"), DW_AT_symbol_name("_update")
	.dwattr DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$859, DW_AT_accessibility(DW_ACCESS_public)
DW$860	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$860, DW_AT_name("general"), DW_AT_symbol_name("_general")
	.dwattr DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$860, DW_AT_accessibility(DW_ACCESS_public)
DW$861	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$861, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
	.dwattr DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$861, DW_AT_accessibility(DW_ACCESS_public)
DW$862	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$862, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
	.dwattr DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$862, DW_AT_accessibility(DW_ACCESS_public)
DW$863	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$863, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
	.dwattr DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$863, DW_AT_accessibility(DW_ACCESS_public)
DW$864	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$864, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
	.dwattr DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$864, DW_AT_accessibility(DW_ACCESS_public)
DW$865	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$865, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
	.dwattr DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$865, DW_AT_accessibility(DW_ACCESS_public)
DW$866	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$866, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
	.dwattr DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$866, DW_AT_accessibility(DW_ACCESS_public)
DW$867	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$867, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
	.dwattr DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$867, DW_AT_accessibility(DW_ACCESS_public)
DW$868	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$868, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
	.dwattr DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr DW$868, DW_AT_accessibility(DW_ACCESS_public)
DW$869	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$869, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
	.dwattr DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$869, DW_AT_accessibility(DW_ACCESS_public)
DW$870	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$870, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
	.dwattr DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$870, DW_AT_accessibility(DW_ACCESS_public)
DW$871	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$871, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
	.dwattr DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$871, DW_AT_accessibility(DW_ACCESS_public)
DW$872	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$872, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
	.dwattr DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr DW$872, DW_AT_accessibility(DW_ACCESS_public)
DW$873	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$873, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
	.dwattr DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$873, DW_AT_accessibility(DW_ACCESS_public)
DW$874	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$874, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
	.dwattr DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr DW$874, DW_AT_accessibility(DW_ACCESS_public)
DW$875	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$875, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
	.dwattr DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$875, DW_AT_accessibility(DW_ACCESS_public)
DW$876	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$876, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
	.dwattr DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr DW$876, DW_AT_accessibility(DW_ACCESS_public)
DW$877	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$877, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
	.dwattr DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$877, DW_AT_accessibility(DW_ACCESS_public)
DW$878	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$878, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
	.dwattr DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$878, DW_AT_accessibility(DW_ACCESS_public)
DW$879	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$879, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
	.dwattr DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$879, DW_AT_accessibility(DW_ACCESS_public)
DW$880	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$880, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
	.dwattr DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$880, DW_AT_accessibility(DW_ACCESS_public)
DW$881	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$881, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
	.dwattr DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr DW$881, DW_AT_accessibility(DW_ACCESS_public)
DW$882	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$882, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
	.dwattr DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$882, DW_AT_accessibility(DW_ACCESS_public)
DW$883	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$883, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
	.dwattr DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr DW$883, DW_AT_accessibility(DW_ACCESS_public)
DW$884	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$884, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
	.dwattr DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$884, DW_AT_accessibility(DW_ACCESS_public)
DW$885	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$885, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
	.dwattr DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr DW$885, DW_AT_accessibility(DW_ACCESS_public)
DW$886	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$886, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
	.dwattr DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$886, DW_AT_accessibility(DW_ACCESS_public)
DW$887	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$887, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
	.dwattr DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr DW$887, DW_AT_accessibility(DW_ACCESS_public)
DW$888	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$888, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
	.dwattr DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$888, DW_AT_accessibility(DW_ACCESS_public)
DW$889	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$889, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
	.dwattr DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$889, DW_AT_accessibility(DW_ACCESS_public)
DW$890	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$890, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
	.dwattr DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$890, DW_AT_accessibility(DW_ACCESS_public)
DW$891	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$891, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
	.dwattr DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr DW$891, DW_AT_accessibility(DW_ACCESS_public)
DW$892	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$892, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
	.dwattr DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$892, DW_AT_accessibility(DW_ACCESS_public)
DW$893	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$893, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
	.dwattr DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr DW$893, DW_AT_accessibility(DW_ACCESS_public)
DW$894	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$894, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
	.dwattr DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr DW$894, DW_AT_accessibility(DW_ACCESS_public)
DW$895	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$895, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
	.dwattr DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr DW$895, DW_AT_accessibility(DW_ACCESS_public)
DW$896	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$896, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
	.dwattr DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$896, DW_AT_accessibility(DW_ACCESS_public)
DW$897	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$897, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
	.dwattr DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr DW$897, DW_AT_accessibility(DW_ACCESS_public)
DW$898	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$898, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
	.dwattr DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$898, DW_AT_accessibility(DW_ACCESS_public)
DW$899	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$899, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
	.dwattr DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr DW$899, DW_AT_accessibility(DW_ACCESS_public)
DW$900	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$900, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
	.dwattr DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$900, DW_AT_accessibility(DW_ACCESS_public)
DW$901	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$901, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
	.dwattr DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr DW$901, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$60


DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$61, DW_AT_byte_size(0x01)
DW$902	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$902, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
	.dwattr DW$902, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$902, DW_AT_accessibility(DW_ACCESS_public)
DW$903	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$903, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
	.dwattr DW$903, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$903, DW_AT_accessibility(DW_ACCESS_public)
DW$904	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$904, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
	.dwattr DW$904, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$904, DW_AT_accessibility(DW_ACCESS_public)
DW$905	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$905, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
	.dwattr DW$905, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$905, DW_AT_accessibility(DW_ACCESS_public)
DW$906	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$906, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
	.dwattr DW$906, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$906, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$61


DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$62, DW_AT_byte_size(0x01)
DW$907	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
	.dwattr DW$907, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
	.dwattr DW$907, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$907, DW_AT_accessibility(DW_ACCESS_public)
DW$908	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
