TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:05 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("adc.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("abs"), DW_AT_symbol_name("_abs")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$10)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    8083              DW$T$228        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$62)
    8084                      .dwattr DW$T$228, DW_AT_language(DW_LANG_C)
    8085              DW$T$229        .dwtag  DW_TAG_typedef, DW_AT_name("loopcheckstruct"), DW_AT_type(*DW$T$66)
    8086                      .dwattr DW$T$229, DW_AT_language(DW_LANG_C)
    8087              DW$T$230        .dwtag  DW_TAG_typedef, DW_AT_name("offsetstruct"), DW_AT_type(*DW$T$68)
    8088                      .dwattr DW$T$230, DW_AT_language(DW_LANG_C)
    8089              
    8090              DW$T$233        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$232)
    8091                      .dwattr DW$T$233, DW_AT_language(DW_LANG_C)
    8092                      .dwattr DW$T$233, DW_AT_byte_size(0x1f8)
    8093              DW$363  .dwtag  DW_TAG_subrange_type
    8094                      .dwattr DW$363, DW_AT_upper_bound(0x1b)
    8095                      .dwendtag DW$T$233
    8096              
    8097              DW$T$236        .dwtag  DW_TAG_typedef, DW_AT_name("rpmstruct"), DW_AT_type(*DW$T$74)
    8098                      .dwattr DW$T$236, DW_AT_language(DW_LANG_C)
    8099              DW$364  .dwtag  DW_TAG_far_type
    8100                      .dwattr DW$364, DW_AT_type(*DW$T$95)
    8101              DW$T$240        .dwtag  DW_TAG_volatile_type
    8102                      .dwattr DW$T$240, DW_AT_type(*DW$364)
    8103              DW$365  .dwtag  DW_TAG_far_type
    8104                      .dwattr DW$365, DW_AT_type(*DW$T$251)
    8105              DW$T$252        .dwtag  DW_TAG_volatile_type
    8106                      .dwattr DW$T$252, DW_AT_type(*DW$365)
    8107              DW$366  .dwtag  DW_TAG_far_type
    8108                      .dwattr DW$366, DW_AT_type(*DW$T$283)
    8109              DW$T$284        .dwtag  DW_TAG_volatile_type
    8110                      .dwattr DW$T$284, DW_AT_type(*DW$366)
    8111              DW$T$287        .dwtag  DW_TAG_typedef, DW_AT_name("slemsettingsstruct"), DW_AT_type(*DW$T$111)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  180

    8112                      .dwattr DW$T$287, DW_AT_language(DW_LANG_C)
    8113              DW$T$289        .dwtag  DW_TAG_typedef, DW_AT_name("slemstruct"), DW_AT_type(*DW$T$113)
    8114                      .dwattr DW$T$289, DW_AT_language(DW_LANG_C)
    8115              DW$T$291        .dwtag  DW_TAG_typedef, DW_AT_name("rtcbatstruct"), DW_AT_type(*DW$T$115)
    8116                      .dwattr DW$T$291, DW_AT_language(DW_LANG_C)
    8117              DW$T$293        .dwtag  DW_TAG_typedef, DW_AT_name("cppstruct"), DW_AT_type(*DW$T$116)
    8118                      .dwattr DW$T$293, DW_AT_language(DW_LANG_C)
    8119              DW$T$294        .dwtag  DW_TAG_typedef, DW_AT_name("cppsettingsstruct"), DW_AT_type(*DW$T$117)
    8120                      .dwattr DW$T$294, DW_AT_language(DW_LANG_C)
    8121              DW$T$296        .dwtag  DW_TAG_typedef, DW_AT_name("sensorMovingstruct"), DW_AT_type(*DW$T$118)
    8122                      .dwattr DW$T$296, DW_AT_language(DW_LANG_C)
    8123              DW$T$298        .dwtag  DW_TAG_typedef, DW_AT_name("dcmodechecksstruct"), DW_AT_type(*DW$T$122)
    8124                      .dwattr DW$T$298, DW_AT_language(DW_LANG_C)
    8125              DW$T$127        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$126)
    8126                      .dwattr DW$T$127, DW_AT_address_class(0x16)
    8127              DW$T$145        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$144)
    8128                      .dwattr DW$T$145, DW_AT_address_class(0x16)
    8129              
    8130              DW$T$300        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$126)
    8131                      .dwattr DW$T$300, DW_AT_language(DW_LANG_C)
    8132                      .dwattr DW$T$300, DW_AT_byte_size(0x64)
    8133              DW$367  .dwtag  DW_TAG_subrange_type
    8134                      .dwattr DW$367, DW_AT_upper_bound(0x63)
    8135                      .dwendtag DW$T$300
    8136              
    8137              DW$T$176        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$175)
    8138                      .dwattr DW$T$176, DW_AT_address_class(0x16)
    8139              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    8140                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    8141                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    8142              DW$T$70 .dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$19)
    8143                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    8144              DW$T$193        .dwtag  DW_TAG_typedef, DW_AT_name("status3struct"), DW_AT_type(*DW$T$20)
    8145                      .dwattr DW$T$193, DW_AT_language(DW_LANG_C)
    8146              DW$T$201        .dwtag  DW_TAG_typedef, DW_AT_name("gpaport"), DW_AT_type(*DW$T$23)
    8147                      .dwattr DW$T$201, DW_AT_language(DW_LANG_C)
    8148              DW$T$205        .dwtag  DW_TAG_typedef, DW_AT_name("gpbport"), DW_AT_type(*DW$T$26)
    8149                      .dwattr DW$T$205, DW_AT_language(DW_LANG_C)
    8150              DW$T$209        .dwtag  DW_TAG_typedef, DW_AT_name("gpdport"), DW_AT_type(*DW$T$29)
    8151                      .dwattr DW$T$209, DW_AT_language(DW_LANG_C)
    8152              
    8153              DW$T$31 .dwtag  DW_TAG_structure_type
    8154                      .dwattr DW$T$31, DW_AT_name("tag_settingsstruct")
    8155                      .dwattr DW$T$31, DW_AT_byte_size(0x24)
    8156              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8157                      .dwattr DW$368, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    8158                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8159                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    8160              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8161                      .dwattr DW$369, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    8162                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8163                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    8164              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8165                      .dwattr DW$370, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    8166                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  181

    8167                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    8168              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8169                      .dwattr DW$371, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    8170                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8171                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    8172              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8173                      .dwattr DW$372, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    8174                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8175                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    8176              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8177                      .dwattr DW$373, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    8178                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8179                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    8180              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8181                      .dwattr DW$374, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    8182                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8183                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    8184              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8185                      .dwattr DW$375, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    8186                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8187                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    8188              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8189                      .dwattr DW$376, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    8190                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8191                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    8192              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8193                      .dwattr DW$377, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    8194                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8195                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    8196              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8197                      .dwattr DW$378, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    8198                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8199                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    8200              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8201                      .dwattr DW$379, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    8202                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8203                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    8204              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8205                      .dwattr DW$380, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    8206                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8207                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    8208              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8209                      .dwattr DW$381, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    8210                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8211                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    8212              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8213                      .dwattr DW$382, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    8214                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8215                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    8216              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8217                      .dwattr DW$383, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    8218                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8219                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    8220              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8221                      .dwattr DW$384, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  182

    8222                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8223                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    8224              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8225                      .dwattr DW$385, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    8226                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8227                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    8228              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8229                      .dwattr DW$386, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    8230                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8231                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    8232              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8233                      .dwattr DW$387, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    8234                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    8235                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    8236              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8237                      .dwattr DW$388, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    8238                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8239                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    8240              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8241                      .dwattr DW$389, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    8242                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8243                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    8244              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8245                      .dwattr DW$390, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    8246                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8247                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    8248              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8249                      .dwattr DW$391, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    8250                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8251                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    8252              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8253                      .dwattr DW$392, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    8254                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8255                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    8256              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8257                      .dwattr DW$393, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    8258                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8259                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    8260              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8261                      .dwattr DW$394, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    8262                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8263                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    8264              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8265                      .dwattr DW$395, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    8266                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    8267                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    8268              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8269                      .dwattr DW$396, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    8270                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8271                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    8272              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8273                      .dwattr DW$397, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    8274                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8275                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    8276              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  183

    8277                      .dwattr DW$398, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    8278                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8279                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    8280              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    8281                      .dwattr DW$399, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    8282                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    8283                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    8284              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8285                      .dwattr DW$400, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    8286                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8287                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    8288              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8289                      .dwattr DW$401, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    8290                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8291                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    8292              DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8293                      .dwattr DW$402, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    8294                      .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    8295                      .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    8296                      .dwendtag DW$T$31
    8297              
    8298              
    8299              DW$T$33 .dwtag  DW_TAG_structure_type
    8300                      .dwattr DW$T$33, DW_AT_name("tag_motionstruct")
    8301                      .dwattr DW$T$33, DW_AT_byte_size(0x09)
    8302              DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8303                      .dwattr DW$403, DW_AT_name("counter"), DW_AT_symbol_name("_counter")
    8304                      .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8305                      .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    8306              DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8307                      .dwattr DW$404, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
    8308                      .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8309                      .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    8310              DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    8311                      .dwattr DW$405, DW_AT_name("order"), DW_AT_symbol_name("_order")
    8312                      .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8313                      .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    8314              DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8315                      .dwattr DW$406, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    8316                      .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8317                      .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    8318              DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8319                      .dwattr DW$407, DW_AT_name("forwardasternflagprev"), DW_AT_symbol_name("_forwardasternflagprev")
    8320                      .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8321                      .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    8322              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8323                      .dwattr DW$408, DW_AT_name("recalnow"), DW_AT_symbol_name("_recalnow")
    8324                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8325                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    8326              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8327                      .dwattr DW$409, DW_AT_name("calerror"), DW_AT_symbol_name("_calerror")
    8328                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8329                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    8330              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8331                      .dwattr DW$410, DW_AT_name("recheckdir"), DW_AT_symbol_name("_recheckdir")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  184

    8332                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8333                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    8334                      .dwendtag DW$T$33
    8335              
    8336              
    8337              DW$T$37 .dwtag  DW_TAG_structure_type
    8338                      .dwattr DW$T$37, DW_AT_name("tag_safestruct1struct")
    8339                      .dwattr DW$T$37, DW_AT_byte_size(0x1f)
    8340              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    8341                      .dwattr DW$411, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    8342                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8343                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    8344              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    8345                      .dwattr DW$412, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    8346                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8347                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    8348                      .dwendtag DW$T$37
    8349              
    8350              
    8351              DW$T$50 .dwtag  DW_TAG_structure_type
    8352                      .dwattr DW$T$50, DW_AT_name("tag_safestruct2struct")
    8353                      .dwattr DW$T$50, DW_AT_byte_size(0x1e)
    8354              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    8355                      .dwattr DW$413, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    8356                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8357                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    8358              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    8359                      .dwattr DW$414, DW_AT_name("log"), DW_AT_symbol_name("_log")
    8360                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8361                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    8362              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    8363                      .dwattr DW$415, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
    8364                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8365                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    8366              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    8367                      .dwattr DW$416, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    8368                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8369                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    8370              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    8371                      .dwattr DW$417, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    8372                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8373                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    8374              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    8375                      .dwattr DW$418, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
    8376                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8377                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    8378              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    8379                      .dwattr DW$419, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
    8380                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8381                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    8382              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    8383                      .dwattr DW$420, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
    8384                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8385                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    8386              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  185

    8387                      .dwattr DW$421, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    8388                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    8389                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    8390              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    8391                      .dwattr DW$422, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    8392                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8393                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    8394              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    8395                      .dwattr DW$423, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
    8396                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8397                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    8398                      .dwendtag DW$T$50
    8399              
    8400              
    8401              DW$T$51 .dwtag  DW_TAG_structure_type
    8402                      .dwattr DW$T$51, DW_AT_name("tag_xtswplusanastruct")
    8403                      .dwattr DW$T$51, DW_AT_byte_size(0x0e)
    8404              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    8405                      .dwattr DW$424, DW_AT_name("analog18ma"), DW_AT_symbol_name("_analog18ma")
    8406                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8407                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    8408                      .dwendtag DW$T$51
    8409              
    8410              DW$T$222        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$52)
    8411                      .dwattr DW$T$222, DW_AT_language(DW_LANG_C)
    8412              
    8413              DW$T$55 .dwtag  DW_TAG_structure_type
    8414                      .dwattr DW$T$55, DW_AT_name("tag_allsensorstruct")
    8415                      .dwattr DW$T$55, DW_AT_byte_size(0x2d)
    8416              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8417                      .dwattr DW$425, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    8418                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8419                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    8420              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8421                      .dwattr DW$426, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    8422                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8423                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    8424              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8425                      .dwattr DW$427, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    8426                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8427                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    8428              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8429                      .dwattr DW$428, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    8430                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8431                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    8432              DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8433                      .dwattr DW$429, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    8434                      .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8435                      .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    8436              DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8437                      .dwattr DW$430, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    8438                      .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8439                      .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    8440              DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8441                      .dwattr DW$431, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  186

    8442                      .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8443                      .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    8444              DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8445                      .dwattr DW$432, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    8446                      .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8447                      .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    8448              DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8449                      .dwattr DW$433, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    8450                      .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8451                      .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    8452              DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8453                      .dwattr DW$434, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    8454                      .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8455                      .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    8456              DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8457                      .dwattr DW$435, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    8458                      .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8459                      .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    8460              DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8461                      .dwattr DW$436, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    8462                      .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8463                      .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    8464              DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8465                      .dwattr DW$437, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    8466                      .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8467                      .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    8468              DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8469                      .dwattr DW$438, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    8470                      .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8471                      .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    8472              DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8473                      .dwattr DW$439, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    8474                      .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8475                      .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    8476              DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8477                      .dwattr DW$440, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    8478                      .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8479                      .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    8480              DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    8481                      .dwattr DW$441, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    8482                      .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8483                      .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    8484              DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8485                      .dwattr DW$442, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    8486                      .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8487                      .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    8488              DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8489                      .dwattr DW$443, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    8490                      .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8491                      .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    8492              DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8493                      .dwattr DW$444, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    8494                      .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    8495                      .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    8496              DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  187

    8497                      .dwattr DW$445, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    8498                      .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8499                      .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    8500              DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    8501                      .dwattr DW$446, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    8502                      .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8503                      .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    8504              DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8505                      .dwattr DW$447, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    8506                      .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    8507                      .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    8508              DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8509                      .dwattr DW$448, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    8510                      .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8511                      .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
    8512              DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8513                      .dwattr DW$449, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    8514                      .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    8515                      .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    8516              DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8517                      .dwattr DW$450, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    8518                      .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    8519                      .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    8520              DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8521                      .dwattr DW$451, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    8522                      .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    8523                      .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    8524              DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8525                      .dwattr DW$452, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    8526                      .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8527                      .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    8528              DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8529                      .dwattr DW$453, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    8530                      .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    8531                      .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    8532              DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    8533                      .dwattr DW$454, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    8534                      .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    8535                      .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    8536              DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8537                      .dwattr DW$455, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    8538                      .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    8539                      .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    8540              DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8541                      .dwattr DW$456, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    8542                      .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8543                      .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    8544                      .dwendtag DW$T$55
    8545              
    8546              
    8547              DW$T$62 .dwtag  DW_TAG_structure_type
    8548                      .dwattr DW$T$62, DW_AT_name("tag_configstruct")
    8549                      .dwattr DW$T$62, DW_AT_byte_size(0x18)
    8550              DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    8551                      .dwattr DW$457, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  188

    8552                      .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8553                      .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    8554              DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    8555                      .dwattr DW$458, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    8556                      .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8557                      .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    8558              DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    8559                      .dwattr DW$459, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    8560                      .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8561                      .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
    8562              DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    8563                      .dwattr DW$460, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    8564                      .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8565                      .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    8566              DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    8567                      .dwattr DW$461, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    8568                      .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8569                      .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    8570              DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    8571                      .dwattr DW$462, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    8572                      .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8573                      .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    8574                      .dwendtag DW$T$62
    8575              
    8576              
    8577              DW$T$66 .dwtag  DW_TAG_structure_type
    8578                      .dwattr DW$T$66, DW_AT_name("tag_loopcheckstruct")
    8579                      .dwattr DW$T$66, DW_AT_byte_size(0x10)
    8580              DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    8581                      .dwattr DW$463, DW_AT_name("min"), DW_AT_symbol_name("_min")
    8582                      .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8583                      .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    8584              DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    8585                      .dwattr DW$464, DW_AT_name("max"), DW_AT_symbol_name("_max")
    8586                      .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8587                      .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8588              DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    8589                      .dwattr DW$465, DW_AT_name("last"), DW_AT_symbol_name("_last")
    8590                      .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8591                      .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8592              DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8593                      .dwattr DW$466, DW_AT_name("value"), DW_AT_symbol_name("_value")
    8594                      .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8595                      .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8596                      .dwendtag DW$T$66
    8597              
    8598              
    8599              DW$T$68 .dwtag  DW_TAG_structure_type
    8600                      .dwattr DW$T$68, DW_AT_name("tag_offsetstruct")
    8601                      .dwattr DW$T$68, DW_AT_byte_size(0x1c)
    8602              DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    8603                      .dwattr DW$467, DW_AT_name("val"), DW_AT_symbol_name("_val")
    8604                      .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8605                      .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8606                      .dwendtag DW$T$68
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  189

    8607              
    8608              DW$T$232        .dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$72)
    8609                      .dwattr DW$T$232, DW_AT_language(DW_LANG_C)
    8610              
    8611              DW$T$74 .dwtag  DW_TAG_structure_type
    8612                      .dwattr DW$T$74, DW_AT_byte_size(0x13)
    8613              DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8614                      .dwattr DW$468, DW_AT_name("count"), DW_AT_symbol_name("_count")
    8615                      .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8616                      .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8617              DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8618                      .dwattr DW$469, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
    8619                      .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8620                      .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    8621              DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8622                      .dwattr DW$470, DW_AT_name("previouscount"), DW_AT_symbol_name("_previouscount")
    8623                      .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8624                      .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8625              DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8626                      .dwattr DW$471, DW_AT_name("sampleperiod"), DW_AT_symbol_name("_sampleperiod")
    8627                      .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8628                      .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8629              DW$472  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8630                      .dwattr DW$472, DW_AT_name("period"), DW_AT_symbol_name("_period")
    8631                      .dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8632                      .dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8633              DW$473  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    8634                      .dwattr DW$473, DW_AT_name("stable"), DW_AT_symbol_name("_stable")
    8635                      .dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8636                      .dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
    8637                      .dwendtag DW$T$74
    8638              
    8639              
    8640              DW$T$95 .dwtag  DW_TAG_structure_type
    8641                      .dwattr DW$T$95, DW_AT_name("ADC_REGS")
    8642                      .dwattr DW$T$95, DW_AT_byte_size(0x1a)
    8643              DW$474  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    8644                      .dwattr DW$474, DW_AT_name("ADCTRL1"), DW_AT_symbol_name("_ADCTRL1")
    8645                      .dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8646                      .dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
    8647              DW$475  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    8648                      .dwattr DW$475, DW_AT_name("ADCTRL2"), DW_AT_symbol_name("_ADCTRL2")
    8649                      .dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8650                      .dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
    8651              DW$476  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    8652                      .dwattr DW$476, DW_AT_name("ADCMAXCONV"), DW_AT_symbol_name("_ADCMAXCONV")
    8653                      .dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8654                      .dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
    8655              DW$477  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    8656                      .dwattr DW$477, DW_AT_name("ADCCHSELSEQ1"), DW_AT_symbol_name("_ADCCHSELSEQ1")
    8657                      .dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8658                      .dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
    8659              DW$478  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    8660                      .dwattr DW$478, DW_AT_name("ADCCHSELSEQ2"), DW_AT_symbol_name("_ADCCHSELSEQ2")
    8661                      .dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  190

    8662                      .dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
    8663              DW$479  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    8664                      .dwattr DW$479, DW_AT_name("ADCCHSELSEQ3"), DW_AT_symbol_name("_ADCCHSELSEQ3")
    8665                      .dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8666                      .dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
    8667              DW$480  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    8668                      .dwattr DW$480, DW_AT_name("ADCCHSELSEQ4"), DW_AT_symbol_name("_ADCCHSELSEQ4")
    8669                      .dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8670                      .dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
    8671              DW$481  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    8672                      .dwattr DW$481, DW_AT_name("ADCASEQSR"), DW_AT_symbol_name("_ADCASEQSR")
    8673                      .dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8674                      .dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
    8675              DW$482  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8676                      .dwattr DW$482, DW_AT_name("ADCRESULT0"), DW_AT_symbol_name("_ADCRESULT0")
    8677                      .dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8678                      .dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
    8679              DW$483  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8680                      .dwattr DW$483, DW_AT_name("ADCRESULT1"), DW_AT_symbol_name("_ADCRESULT1")
    8681                      .dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8682                      .dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
    8683              DW$484  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8684                      .dwattr DW$484, DW_AT_name("ADCRESULT2"), DW_AT_symbol_name("_ADCRESULT2")
    8685                      .dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8686                      .dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
    8687              DW$485  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8688                      .dwattr DW$485, DW_AT_name("ADCRESULT3"), DW_AT_symbol_name("_ADCRESULT3")
    8689                      .dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8690                      .dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
    8691              DW$486  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8692                      .dwattr DW$486, DW_AT_name("ADCRESULT4"), DW_AT_symbol_name("_ADCRESULT4")
    8693                      .dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8694                      .dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
    8695              DW$487  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8696                      .dwattr DW$487, DW_AT_name("ADCRESULT5"), DW_AT_symbol_name("_ADCRESULT5")
    8697                      .dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8698                      .dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
    8699              DW$488  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8700                      .dwattr DW$488, DW_AT_name("ADCRESULT6"), DW_AT_symbol_name("_ADCRESULT6")
    8701                      .dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8702                      .dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
    8703              DW$489  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8704                      .dwattr DW$489, DW_AT_name("ADCRESULT7"), DW_AT_symbol_name("_ADCRESULT7")
    8705                      .dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8706                      .dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
    8707              DW$490  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8708                      .dwattr DW$490, DW_AT_name("ADCRESULT8"), DW_AT_symbol_name("_ADCRESULT8")
    8709                      .dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8710                      .dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
    8711              DW$491  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8712                      .dwattr DW$491, DW_AT_name("ADCRESULT9"), DW_AT_symbol_name("_ADCRESULT9")
    8713                      .dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8714                      .dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
    8715              DW$492  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8716                      .dwattr DW$492, DW_AT_name("ADCRESULT10"), DW_AT_symbol_name("_ADCRESULT10")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  191

    8717                      .dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8718                      .dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
    8719              DW$493  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8720                      .dwattr DW$493, DW_AT_name("ADCRESULT11"), DW_AT_symbol_name("_ADCRESULT11")
    8721                      .dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    8722                      .dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8723              DW$494  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8724                      .dwattr DW$494, DW_AT_name("ADCRESULT12"), DW_AT_symbol_name("_ADCRESULT12")
    8725                      .dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8726                      .dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
    8727              DW$495  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8728                      .dwattr DW$495, DW_AT_name("ADCRESULT13"), DW_AT_symbol_name("_ADCRESULT13")
    8729                      .dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8730                      .dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
    8731              DW$496  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8732                      .dwattr DW$496, DW_AT_name("ADCRESULT14"), DW_AT_symbol_name("_ADCRESULT14")
    8733                      .dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8734                      .dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
    8735              DW$497  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8736                      .dwattr DW$497, DW_AT_name("ADCRESULT15"), DW_AT_symbol_name("_ADCRESULT15")
    8737                      .dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8738                      .dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
    8739              DW$498  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    8740                      .dwattr DW$498, DW_AT_name("ADCTRL3"), DW_AT_symbol_name("_ADCTRL3")
    8741                      .dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8742                      .dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
    8743              DW$499  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
    8744                      .dwattr DW$499, DW_AT_name("ADCST"), DW_AT_symbol_name("_ADCST")
    8745                      .dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8746                      .dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
    8747                      .dwendtag DW$T$95
    8748              
    8749              DW$T$251        .dwtag  DW_TAG_typedef, DW_AT_name("adcdatastruct"), DW_AT_type(*DW$T$99)
    8750                      .dwattr DW$T$251, DW_AT_language(DW_LANG_C)
    8751              DW$T$283        .dwtag  DW_TAG_typedef, DW_AT_name("inputstruct"), DW_AT_type(*DW$T$110)
    8752                      .dwattr DW$T$283, DW_AT_language(DW_LANG_C)
    8753              
    8754              DW$T$111        .dwtag  DW_TAG_structure_type
    8755                      .dwattr DW$T$111, DW_AT_name("tag_slemsettingsstruct")
    8756                      .dwattr DW$T$111, DW_AT_byte_size(0x06)
    8757              DW$500  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8758                      .dwattr DW$500, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    8759                      .dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8760                      .dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
    8761              DW$501  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8762                      .dwattr DW$501, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
    8763                      .dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8764                      .dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
    8765              DW$502  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8766                      .dwattr DW$502, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    8767                      .dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8768                      .dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
    8769              DW$503  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8770                      .dwattr DW$503, DW_AT_name("mVfsd"), DW_AT_symbol_name("_mVfsd")
    8771                      .dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  192

    8772                      .dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
    8773              DW$504  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8774                      .dwattr DW$504, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
    8775                      .dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8776                      .dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
    8777              DW$505  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8778                      .dwattr DW$505, DW_AT_name("alarmdelay"), DW_AT_symbol_name("_alarmdelay")
    8779                      .dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8780                      .dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
    8781                      .dwendtag DW$T$111
    8782              
    8783              
    8784              DW$T$113        .dwtag  DW_TAG_structure_type
    8785                      .dwattr DW$T$113, DW_AT_name("tag_slemsstruct")
    8786                      .dwattr DW$T$113, DW_AT_byte_size(0x03)
    8787              DW$506  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8788                      .dwattr DW$506, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
    8789                      .dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8790                      .dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
    8791              DW$507  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
    8792                      .dwattr DW$507, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    8793                      .dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8794                      .dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
    8795              DW$508  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8796                      .dwattr DW$508, DW_AT_name("levelcount"), DW_AT_symbol_name("_levelcount")
    8797                      .dwattr DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8798                      .dwattr DW$508, DW_AT_accessibility(DW_ACCESS_public)
    8799                      .dwendtag DW$T$113
    8800              
    8801              
    8802              DW$T$115        .dwtag  DW_TAG_structure_type
    8803                      .dwattr DW$T$115, DW_AT_name("tag_rtcbatstruct")
    8804                      .dwattr DW$T$115, DW_AT_byte_size(0x02)
    8805              DW$509  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8806                      .dwattr DW$509, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
    8807                      .dwattr DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8808                      .dwattr DW$509, DW_AT_accessibility(DW_ACCESS_public)
    8809              DW$510  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$114)
    8810                      .dwattr DW$510, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    8811                      .dwattr DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8812                      .dwattr DW$510, DW_AT_accessibility(DW_ACCESS_public)
    8813                      .dwendtag DW$T$115
    8814              
    8815              
    8816              DW$T$116        .dwtag  DW_TAG_structure_type
    8817                      .dwattr DW$T$116, DW_AT_name("tag_cppstruct")
    8818                      .dwattr DW$T$116, DW_AT_byte_size(0x06)
    8819              DW$511  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8820                      .dwattr DW$511, DW_AT_name("iAtodValue"), DW_AT_symbol_name("_iAtodValue")
    8821                      .dwattr DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8822                      .dwattr DW$511, DW_AT_accessibility(DW_ACCESS_public)
    8823              DW$512  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8824                      .dwattr DW$512, DW_AT_name("fmAinput"), DW_AT_symbol_name("_fmAinput")
    8825                      .dwattr DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8826                      .dwattr DW$512, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  193

    8827              DW$513  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8828                      .dwattr DW$513, DW_AT_name("fLoadPercent"), DW_AT_symbol_name("_fLoadPercent")
    8829                      .dwattr DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8830                      .dwattr DW$513, DW_AT_accessibility(DW_ACCESS_public)
    8831                      .dwendtag DW$T$116
    8832              
    8833              
    8834              DW$T$117        .dwtag  DW_TAG_structure_type
    8835                      .dwattr DW$T$117, DW_AT_name("tag_cppsettingsstruct")
    8836                      .dwattr DW$T$117, DW_AT_byte_size(0x10)
    8837              DW$514  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8838                      .dwattr DW$514, DW_AT_name("iCppEnable"), DW_AT_symbol_name("_iCppEnable")
    8839                      .dwattr DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8840                      .dwattr DW$514, DW_AT_accessibility(DW_ACCESS_public)
    8841              DW$515  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8842                      .dwattr DW$515, DW_AT_name("iCppLowLimit"), DW_AT_symbol_name("_iCppLowLimit")
    8843                      .dwattr DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8844                      .dwattr DW$515, DW_AT_accessibility(DW_ACCESS_public)
    8845              DW$516  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8846                      .dwattr DW$516, DW_AT_name("iCppHighLimit"), DW_AT_symbol_name("_iCppHighLimit")
    8847                      .dwattr DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8848                      .dwattr DW$516, DW_AT_accessibility(DW_ACCESS_public)
    8849              DW$517  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8850                      .dwattr DW$517, DW_AT_name("cppkvalue"), DW_AT_symbol_name("_cppkvalue")
    8851                      .dwattr DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8852                      .dwattr DW$517, DW_AT_accessibility(DW_ACCESS_public)
    8853              DW$518  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8854                      .dwattr DW$518, DW_AT_name("gammavalue"), DW_AT_symbol_name("_gammavalue")
    8855                      .dwattr DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8856                      .dwattr DW$518, DW_AT_accessibility(DW_ACCESS_public)
    8857              DW$519  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8858                      .dwattr DW$519, DW_AT_name("cpplevelx"), DW_AT_symbol_name("_cpplevelx")
    8859                      .dwattr DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8860                      .dwattr DW$519, DW_AT_accessibility(DW_ACCESS_public)
    8861              DW$520  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8862                      .dwattr DW$520, DW_AT_name("delatRpmPauseDelay"), DW_AT_symbol_name("_delatRpmPauseDelay")
    8863                      .dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8864                      .dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
    8865              DW$521  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8866                      .dwattr DW$521, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
    8867                      .dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8868                      .dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
    8869              DW$522  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8870                      .dwattr DW$522, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    8871                      .dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8872                      .dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
    8873              DW$523  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8874                      .dwattr DW$523, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    8875                      .dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8876                      .dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
    8877              DW$524  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8878                      .dwattr DW$524, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    8879                      .dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8880                      .dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
    8881              DW$525  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  194

    8882                      .dwattr DW$525, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    8883                      .dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8884                      .dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
    8885              DW$526  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8886                      .dwattr DW$526, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    8887                      .dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8888                      .dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
    8889              DW$527  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8890                      .dwattr DW$527, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    8891                      .dwattr DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8892                      .dwattr DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8893              DW$528  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8894                      .dwattr DW$528, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    8895                      .dwattr DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8896                      .dwattr DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8897              DW$529  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8898                      .dwattr DW$529, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    8899                      .dwattr DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8900                      .dwattr DW$529, DW_AT_accessibility(DW_ACCESS_public)
    8901                      .dwendtag DW$T$117
    8902              
    8903              
    8904              DW$T$118        .dwtag  DW_TAG_structure_type
    8905                      .dwattr DW$T$118, DW_AT_name("tag_sensorMoving")
    8906                      .dwattr DW$T$118, DW_AT_byte_size(0x02)
    8907              DW$530  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8908                      .dwattr DW$530, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
    8909                      .dwattr DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8910                      .dwattr DW$530, DW_AT_accessibility(DW_ACCESS_public)
    8911              DW$531  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8912                      .dwattr DW$531, DW_AT_name("unusedByte"), DW_AT_symbol_name("_unusedByte")
    8913                      .dwattr DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8914                      .dwattr DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8915                      .dwendtag DW$T$118
    8916              
    8917              
    8918              DW$T$122        .dwtag  DW_TAG_structure_type
    8919                      .dwattr DW$T$122, DW_AT_name("tag_dcmodechecksstruct")
    8920                      .dwattr DW$T$122, DW_AT_byte_size(0x0f)
    8921              DW$532  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    8922                      .dwattr DW$532, DW_AT_name("ideal"), DW_AT_symbol_name("_ideal")
    8923                      .dwattr DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8924                      .dwattr DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8925              DW$533  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$120)
    8926                      .dwattr DW$533, DW_AT_name("ok"), DW_AT_symbol_name("_ok")
    8927                      .dwattr DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8928                      .dwattr DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8929              DW$534  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$121)
    8930                      .dwattr DW$534, DW_AT_name("cylinderComparison"), DW_AT_symbol_name("_cylinderComparison")
    8931                      .dwattr DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8932                      .dwattr DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8933              DW$535  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8934                      .dwattr DW$535, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    8935                      .dwattr DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8936                      .dwattr DW$535, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  195

    8937              DW$536  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8938                      .dwattr DW$536, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    8939                      .dwattr DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8940                      .dwattr DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8941              DW$537  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8942                      .dwattr DW$537, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    8943                      .dwattr DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8944                      .dwattr DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8945              DW$538  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8946                      .dwattr DW$538, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    8947                      .dwattr DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8948                      .dwattr DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8949              DW$539  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8950                      .dwattr DW$539, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    8951                      .dwattr DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8952                      .dwattr DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8953              DW$540  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8954                      .dwattr DW$540, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    8955                      .dwattr DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8956                      .dwattr DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8957              DW$541  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8958                      .dwattr DW$541, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    8959                      .dwattr DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8960                      .dwattr DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8961              DW$542  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8962                      .dwattr DW$542, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    8963                      .dwattr DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8964                      .dwattr DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8965              DW$543  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8966                      .dwattr DW$543, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    8967                      .dwattr DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8968                      .dwattr DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8969                      .dwendtag DW$T$122
    8970              
    8971              DW$T$126        .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    8972                      .dwattr DW$T$126, DW_AT_encoding(DW_ATE_signed_char)
    8973                      .dwattr DW$T$126, DW_AT_byte_size(0x01)
    8974              DW$544  .dwtag  DW_TAG_far_type
    8975                      .dwattr DW$544, DW_AT_type(*DW$T$126)
    8976              DW$T$144        .dwtag  DW_TAG_const_type
    8977                      .dwattr DW$T$144, DW_AT_type(*DW$544)
    8978              
    8979              DW$T$32 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    8980                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    8981                      .dwattr DW$T$32, DW_AT_byte_size(0x02)
    8982              DW$545  .dwtag  DW_TAG_subrange_type
    8983                      .dwattr DW$545, DW_AT_upper_bound(0x01)
    8984                      .dwendtag DW$T$32
    8985              
    8986              
    8987              DW$T$73 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    8988                      .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    8989                      .dwattr DW$T$73, DW_AT_byte_size(0x0e)
    8990              DW$546  .dwtag  DW_TAG_subrange_type
    8991                      .dwattr DW$546, DW_AT_upper_bound(0x0d)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  196

    8992                      .dwendtag DW$T$73
    8993              
    8994              
    8995              DW$T$34 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    8996                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    8997                      .dwattr DW$T$34, DW_AT_byte_size(0x0e)
    8998              DW$547  .dwtag  DW_TAG_subrange_type
    8999                      .dwattr DW$547, DW_AT_upper_bound(0x0d)
    9000                      .dwendtag DW$T$34
    9001              
    9002              DW$548  .dwtag  DW_TAG_far_type
    9003                      .dwattr DW$548, DW_AT_type(*DW$T$11)
    9004              DW$T$175        .dwtag  DW_TAG_volatile_type
    9005                      .dwattr DW$T$175, DW_AT_type(*DW$548)
    9006              
    9007              DW$T$19 .dwtag  DW_TAG_structure_type
    9008                      .dwattr DW$T$19, DW_AT_name("tag_status1struct")
    9009                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    9010              DW$549  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9011                      .dwattr DW$549, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    9012                      .dwattr DW$549, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    9013                      .dwattr DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9014                      .dwattr DW$549, DW_AT_accessibility(DW_ACCESS_public)
    9015              DW$550  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9016                      .dwattr DW$550, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    9017                      .dwattr DW$550, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    9018                      .dwattr DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9019                      .dwattr DW$550, DW_AT_accessibility(DW_ACCESS_public)
    9020              DW$551  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9021                      .dwattr DW$551, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
    9022                      .dwattr DW$551, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    9023                      .dwattr DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9024                      .dwattr DW$551, DW_AT_accessibility(DW_ACCESS_public)
    9025              DW$552  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9026                      .dwattr DW$552, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    9027                      .dwattr DW$552, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    9028                      .dwattr DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9029                      .dwattr DW$552, DW_AT_accessibility(DW_ACCESS_public)
    9030              DW$553  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9031                      .dwattr DW$553, DW_AT_name("replaced"), DW_AT_symbol_name("_replaced")
    9032                      .dwattr DW$553, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    9033                      .dwattr DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9034                      .dwattr DW$553, DW_AT_accessibility(DW_ACCESS_public)
    9035              DW$554  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9036                      .dwattr DW$554, DW_AT_name("excludeslowroll"), DW_AT_symbol_name("_excludeslowroll")
    9037                      .dwattr DW$554, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    9038                      .dwattr DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9039                      .dwattr DW$554, DW_AT_accessibility(DW_ACCESS_public)
    9040              DW$555  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9041                      .dwattr DW$555, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    9042                      .dwattr DW$555, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    9043                      .dwattr DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9044                      .dwattr DW$555, DW_AT_accessibility(DW_ACCESS_public)
    9045              DW$556  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9046                      .dwattr DW$556, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  197

    9047                      .dwattr DW$556, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    9048                      .dwattr DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9049                      .dwattr DW$556, DW_AT_accessibility(DW_ACCESS_public)
    9050              DW$557  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9051                      .dwattr DW$557, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    9052                      .dwattr DW$557, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    9053                      .dwattr DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9054                      .dwattr DW$557, DW_AT_accessibility(DW_ACCESS_public)
    9055              DW$558  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9056                      .dwattr DW$558, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    9057                      .dwattr DW$558, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    9058                      .dwattr DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9059                      .dwattr DW$558, DW_AT_accessibility(DW_ACCESS_public)
    9060              DW$559  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9061                      .dwattr DW$559, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    9062                      .dwattr DW$559, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    9063                      .dwattr DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9064                      .dwattr DW$559, DW_AT_accessibility(DW_ACCESS_public)
    9065              DW$560  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9066                      .dwattr DW$560, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    9067                      .dwattr DW$560, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    9068                      .dwattr DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9069                      .dwattr DW$560, DW_AT_accessibility(DW_ACCESS_public)
    9070              DW$561  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9071                      .dwattr DW$561, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    9072                      .dwattr DW$561, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    9073                      .dwattr DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9074                      .dwattr DW$561, DW_AT_accessibility(DW_ACCESS_public)
    9075              DW$562  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9076                      .dwattr DW$562, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    9077                      .dwattr DW$562, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    9078                      .dwattr DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9079                      .dwattr DW$562, DW_AT_accessibility(DW_ACCESS_public)
    9080              DW$563  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9081                      .dwattr DW$563, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    9082                      .dwattr DW$563, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    9083                      .dwattr DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9084                      .dwattr DW$563, DW_AT_accessibility(DW_ACCESS_public)
    9085              DW$564  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9086                      .dwattr DW$564, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    9087                      .dwattr DW$564, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    9088                      .dwattr DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9089                      .dwattr DW$564, DW_AT_accessibility(DW_ACCESS_public)
    9090                      .dwendtag DW$T$19
    9091              
    9092              
    9093              DW$T$20 .dwtag  DW_TAG_structure_type
    9094                      .dwattr DW$T$20, DW_AT_name("tag_status3struct")
    9095                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    9096              DW$565  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9097                      .dwattr DW$565, DW_AT_name("nopulse"), DW_AT_symbol_name("_nopulse")
    9098                      .dwattr DW$565, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    9099                      .dwattr DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9100                      .dwattr DW$565, DW_AT_accessibility(DW_ACCESS_public)
    9101              DW$566  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  198

    9102                      .dwattr DW$566, DW_AT_name("low"), DW_AT_symbol_name("_low")
    9103                      .dwattr DW$566, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    9104                      .dwattr DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9105                      .dwattr DW$566, DW_AT_accessibility(DW_ACCESS_public)
    9106              DW$567  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9107                      .dwattr DW$567, DW_AT_name("high"), DW_AT_symbol_name("_high")
    9108                      .dwattr DW$567, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    9109                      .dwattr DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9110                      .dwattr DW$567, DW_AT_accessibility(DW_ACCESS_public)
    9111              DW$568  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9112                      .dwattr DW$568, DW_AT_name("rpmoor"), DW_AT_symbol_name("_rpmoor")
    9113                      .dwattr DW$568, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    9114                      .dwattr DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9115                      .dwattr DW$568, DW_AT_accessibility(DW_ACCESS_public)
    9116              DW$569  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9117                      .dwattr DW$569, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    9118                      .dwattr DW$569, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    9119                      .dwattr DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9120                      .dwattr DW$569, DW_AT_accessibility(DW_ACCESS_public)
    9121              DW$570  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9122                      .dwattr DW$570, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    9123                      .dwattr DW$570, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    9124                      .dwattr DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9125                      .dwattr DW$570, DW_AT_accessibility(DW_ACCESS_public)
    9126              DW$571  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9127                      .dwattr DW$571, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    9128                      .dwattr DW$571, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    9129                      .dwattr DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9130                      .dwattr DW$571, DW_AT_accessibility(DW_ACCESS_public)
    9131              DW$572  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9132                      .dwattr DW$572, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    9133                      .dwattr DW$572, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    9134                      .dwattr DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9135                      .dwattr DW$572, DW_AT_accessibility(DW_ACCESS_public)
    9136              DW$573  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9137                      .dwattr DW$573, DW_AT_name("nopulselatched"), DW_AT_symbol_name("_nopulselatched")
    9138                      .dwattr DW$573, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    9139                      .dwattr DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9140                      .dwattr DW$573, DW_AT_accessibility(DW_ACCESS_public)
    9141              DW$574  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9142                      .dwattr DW$574, DW_AT_name("lowlatched"), DW_AT_symbol_name("_lowlatched")
    9143                      .dwattr DW$574, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    9144                      .dwattr DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9145                      .dwattr DW$574, DW_AT_accessibility(DW_ACCESS_public)
    9146              DW$575  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9147                      .dwattr DW$575, DW_AT_name("highlatched"), DW_AT_symbol_name("_highlatched")
    9148                      .dwattr DW$575, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    9149                      .dwattr DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9150                      .dwattr DW$575, DW_AT_accessibility(DW_ACCESS_public)
    9151              DW$576  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9152                      .dwattr DW$576, DW_AT_name("rpmoorlatched"), DW_AT_symbol_name("_rpmoorlatched")
    9153                      .dwattr DW$576, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    9154                      .dwattr DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9155                      .dwattr DW$576, DW_AT_accessibility(DW_ACCESS_public)
    9156              DW$577  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:05 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
adc.asm                                                              PAGE  199

    9157                      .dwattr DW$577, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    9158                      .dwattr DW$577, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    9159                      .dwattr DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9160                      .dwattr DW$577, DW_AT_accessibility(DW_ACCESS_public)
    9161              DW$578  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9162                      .dwattr DW$578, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    9163                      .dwattr DW$578, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    9164                      .dwattr DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9165                      .dwattr DW$578, DW_AT_accessibility(DW_ACCESS_public)
    9166              DW$579  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9167                      .dwattr DW$579, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    9168                      .dwattr DW$579, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    9169                      .dwattr DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9170                      .dwattr DW$579, DW_AT_accessibility(DW_ACCESS_public)
    9171              DW$580  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9172                      .dwattr DW$580, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    9173                      .dwattr DW$580, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    9174                      .dwattr DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9175                      .dwattr DW$580, DW_AT_accessibility(DW_ACCESS_public)
    9176                      .dwendtag DW$T$20
    9177              
    9178              
    9179              DW$T$23 .dwtag  DW_TAG_structure_type
    9180                      .dwattr DW$T$23, DW_AT_name("taggpaport")
    9181                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    9182              DW$581  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    9183                      .dwattr DW$581, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    9184                      .dwattr DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9185                      .dwattr DW$581, DW_AT_accessibility(DW_ACCESS_public)
    9186                      .dwendtag DW$T$23
    9187              
    9188              
    9189              DW$T$26 .dwtag  DW_TAG_structure_type
    9190                      .dwattr DW$T$26, DW_AT_name("taggpbport")
    9191                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    9192              DW$582  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    9193                      .dwattr DW$582, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    9194                      .dwattr DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9195                      .dwattr DW$582, DW_AT_accessibility(DW_ACCESS_public)
    9196                      .dwendtag DW$T$26
    9197              
    9198              
    9199              DW$T$29 .dwtag  DW_TAG_structure_type
    9200                      .dwattr DW$T$29, DW_AT_name("taggpdport")
