TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:06 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("alarms.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("sprintf"), DW_AT_symbol_name("_sprintf")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$10)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    2819                      .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    2820              
    2821              DW$T$102        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$101)
    2822                      .dwattr DW$T$102, DW_AT_language(DW_LANG_C)
    2823              
    2824              DW$T$108        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$107)
    2825                      .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   62

    2826              DW$164  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2827                      .dwendtag DW$T$108
    2828              
    2829              
    2830              DW$T$109        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$106)
    2831                      .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
    2832                      .dwattr DW$T$109, DW_AT_byte_size(0x1c)
    2833              DW$165  .dwtag  DW_TAG_subrange_type
    2834                      .dwattr DW$165, DW_AT_upper_bound(0x1b)
    2835                      .dwendtag DW$T$109
    2836              
    2837              DW$T$114        .dwtag  DW_TAG_typedef, DW_AT_name("eventlogstruct"), DW_AT_type(*DW$T$26)
    2838                      .dwattr DW$T$114, DW_AT_language(DW_LANG_C)
    2839              DW$T$116        .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$28)
    2840                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
    2841              DW$166  .dwtag  DW_TAG_far_type
    2842                      .dwattr DW$166, DW_AT_type(*DW$T$117)
    2843              DW$T$118        .dwtag  DW_TAG_volatile_type
    2844                      .dwattr DW$T$118, DW_AT_type(*DW$166)
    2845              DW$T$120        .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$33)
    2846                      .dwattr DW$T$120, DW_AT_language(DW_LANG_C)
    2847              
    2848              DW$T$123        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$122)
    2849                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    2850                      .dwattr DW$T$123, DW_AT_byte_size(0x38)
    2851              DW$167  .dwtag  DW_TAG_subrange_type
    2852                      .dwattr DW$167, DW_AT_upper_bound(0x0d)
    2853                      .dwendtag DW$T$123
    2854              
    2855              
    2856              DW$T$127        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$126)
    2857                      .dwattr DW$T$127, DW_AT_language(DW_LANG_C)
    2858                      .dwattr DW$T$127, DW_AT_byte_size(0x1f8)
    2859              DW$168  .dwtag  DW_TAG_subrange_type
    2860                      .dwattr DW$168, DW_AT_upper_bound(0x1b)
    2861                      .dwendtag DW$T$127
    2862              
    2863              DW$T$130        .dwtag  DW_TAG_typedef, DW_AT_name("damagemonstruct"), DW_AT_type(*DW$T$41)
    2864                      .dwattr DW$T$130, DW_AT_language(DW_LANG_C)
    2865              DW$T$131        .dwtag  DW_TAG_typedef, DW_AT_name("damalarmsstruct"), DW_AT_type(*DW$T$43)
    2866                      .dwattr DW$T$131, DW_AT_language(DW_LANG_C)
    2867              DW$T$133        .dwtag  DW_TAG_typedef, DW_AT_name("slavecmdstruct"), DW_AT_type(*DW$T$45)
    2868                      .dwattr DW$T$133, DW_AT_language(DW_LANG_C)
    2869              DW$T$134        .dwtag  DW_TAG_typedef, DW_AT_name("waterinoilstruct"), DW_AT_type(*DW$T$48)
    2870                      .dwattr DW$T$134, DW_AT_language(DW_LANG_C)
    2871              DW$T$136        .dwtag  DW_TAG_typedef, DW_AT_name("digoutstruct"), DW_AT_type(*DW$T$49)
    2872                      .dwattr DW$T$136, DW_AT_language(DW_LANG_C)
    2873              DW$T$137        .dwtag  DW_TAG_typedef, DW_AT_name("bearingstatusstruct"), DW_AT_type(*DW$T$51)
    2874                      .dwattr DW$T$137, DW_AT_language(DW_LANG_C)
    2875              DW$T$53 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$52)
    2876                      .dwattr DW$T$53, DW_AT_address_class(0x16)
    2877              DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    2878                      .dwattr DW$T$64, DW_AT_address_class(0x16)
    2879              
    2880              DW$T$139        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$52)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   63

    2881                      .dwattr DW$T$139, DW_AT_language(DW_LANG_C)
    2882                      .dwattr DW$T$139, DW_AT_byte_size(0x64)
    2883              DW$169  .dwtag  DW_TAG_subrange_type
    2884                      .dwattr DW$169, DW_AT_upper_bound(0x63)
    2885                      .dwendtag DW$T$139
    2886              
    2887              DW$T$85 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
    2888                      .dwattr DW$T$85, DW_AT_address_class(0x16)
    2889              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("sensoralarmstruct"), DW_AT_type(*DW$T$19)
    2890                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    2891              
    2892              DW$T$20 .dwtag  DW_TAG_structure_type
    2893                      .dwattr DW$T$20, DW_AT_name("tag_alarmsstruct")
    2894                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    2895              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2896                      .dwattr DW$170, DW_AT_name("slavefailure"), DW_AT_symbol_name("_slavefailure")
    2897                      .dwattr DW$170, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2898                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2899                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2900              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2901                      .dwattr DW$171, DW_AT_name("slavefailurelatched"), DW_AT_symbol_name("_slavefailurelatched")
    2902                      .dwattr DW$171, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2903                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2904                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2905              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2906                      .dwattr DW$172, DW_AT_name("framfailure"), DW_AT_symbol_name("_framfailure")
    2907                      .dwattr DW$172, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2908                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2909                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2910              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2911                      .dwattr DW$173, DW_AT_name("framfailurelatched"), DW_AT_symbol_name("_framfailurelatched")
    2912                      .dwattr DW$173, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2913                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2914                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2915              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2916                      .dwattr DW$174, DW_AT_name("pccommsfailure"), DW_AT_symbol_name("_pccommsfailure")
    2917                      .dwattr DW$174, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2918                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2919                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2920              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2921                      .dwattr DW$175, DW_AT_name("pccommsfailurelatched"), DW_AT_symbol_name("_pccommsfailurelatched")
    2922                      .dwattr DW$175, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2923                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2924                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2925              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2926                      .dwattr DW$176, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    2927                      .dwattr DW$176, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2928                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2929                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2930              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2931                      .dwattr DW$177, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    2932                      .dwattr DW$177, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2933                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2934                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2935              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   64

    2936                      .dwattr DW$178, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    2937                      .dwattr DW$178, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2938                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2939                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2940              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2941                      .dwattr DW$179, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    2942                      .dwattr DW$179, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2943                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2944                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2945              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2946                      .dwattr DW$180, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    2947                      .dwattr DW$180, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2948                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2949                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2950              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2951                      .dwattr DW$181, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    2952                      .dwattr DW$181, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2953                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2954                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2955              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2956                      .dwattr DW$182, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    2957                      .dwattr DW$182, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2958                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2959                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2960              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2961                      .dwattr DW$183, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    2962                      .dwattr DW$183, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2963                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2964                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2965              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2966                      .dwattr DW$184, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    2967                      .dwattr DW$184, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2968                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2969                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2970              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2971                      .dwattr DW$185, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    2972                      .dwattr DW$185, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2973                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2974                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2975                      .dwendtag DW$T$20
    2976              
    2977              DW$T$101        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$100)
    2978                      .dwattr DW$T$101, DW_AT_address_class(0x16)
    2979              DW$T$106        .dwtag  DW_TAG_typedef, DW_AT_name("status3struct"), DW_AT_type(*DW$T$21)
    2980                      .dwattr DW$T$106, DW_AT_language(DW_LANG_C)
    2981              DW$T$107        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$106)
    2982                      .dwattr DW$T$107, DW_AT_address_class(0x16)
    2983              
    2984              DW$T$26 .dwtag  DW_TAG_structure_type
    2985                      .dwattr DW$T$26, DW_AT_name("tag_eventlogstruct")
    2986                      .dwattr DW$T$26, DW_AT_byte_size(0x44)
    2987              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2988                      .dwattr DW$186, DW_AT_name("eventid"), DW_AT_symbol_name("_eventid")
    2989                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2990                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   65

    2991              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2992                      .dwattr DW$187, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
    2993                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2994                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2995              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2996                      .dwattr DW$188, DW_AT_name("msgstring"), DW_AT_symbol_name("_msgstring")
    2997                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2998                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2999              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3000                      .dwattr DW$189, DW_AT_name("msgstring2"), DW_AT_symbol_name("_msgstring2")
    3001                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3002                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3003              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3004                      .dwattr DW$190, DW_AT_name("ackdatetime"), DW_AT_symbol_name("_ackdatetime")
    3005                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3006                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3007              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    3008                      .dwattr DW$191, DW_AT_name("ackstring"), DW_AT_symbol_name("_ackstring")
    3009                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3010                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3011              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3012                      .dwattr DW$192, DW_AT_name("newalarmeventflag"), DW_AT_symbol_name("_newalarmeventflag")
    3013                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    3014                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3015              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3016                      .dwattr DW$193, DW_AT_name("eventcodestatus"), DW_AT_symbol_name("_eventcodestatus")
    3017                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3018                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3019              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3020                      .dwattr DW$194, DW_AT_name("eventcode"), DW_AT_symbol_name("_eventcode")
    3021                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3022                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3023              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3024                      .dwattr DW$195, DW_AT_name("currentindex"), DW_AT_symbol_name("_currentindex")
    3025                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3026                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3027              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3028                      .dwattr DW$196, DW_AT_name("txalarmevents"), DW_AT_symbol_name("_txalarmevents")
    3029                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3030                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3031                      .dwendtag DW$T$26
    3032              
    3033              
    3034              DW$T$28 .dwtag  DW_TAG_structure_type
    3035                      .dwattr DW$T$28, DW_AT_name("tag_settingsstruct")
    3036                      .dwattr DW$T$28, DW_AT_byte_size(0x24)
    3037              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3038                      .dwattr DW$197, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    3039                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3040                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3041              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3042                      .dwattr DW$198, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    3043                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3044                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3045              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   66

    3046                      .dwattr DW$199, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    3047                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3048                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3049              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3050                      .dwattr DW$200, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    3051                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3052                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3053              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3054                      .dwattr DW$201, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    3055                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3056                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3057              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3058                      .dwattr DW$202, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    3059                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3060                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3061              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3062                      .dwattr DW$203, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    3063                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3064                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3065              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3066                      .dwattr DW$204, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    3067                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3068                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3069              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3070                      .dwattr DW$205, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    3071                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3072                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3073              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3074                      .dwattr DW$206, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    3075                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3076                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3077              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3078                      .dwattr DW$207, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    3079                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3080                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3081              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3082                      .dwattr DW$208, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    3083                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3084                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3085              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3086                      .dwattr DW$209, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    3087                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3088                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3089              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3090                      .dwattr DW$210, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    3091                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3092                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3093              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3094                      .dwattr DW$211, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    3095                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3096                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3097              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3098                      .dwattr DW$212, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    3099                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3100                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   67

    3101              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3102                      .dwattr DW$213, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    3103                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3104                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3105              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3106                      .dwattr DW$214, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    3107                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3108                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3109              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3110                      .dwattr DW$215, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    3111                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3112                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3113              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3114                      .dwattr DW$216, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    3115                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3116                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3117              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3118                      .dwattr DW$217, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    3119                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3120                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3121              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3122                      .dwattr DW$218, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    3123                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3124                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3125              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3126                      .dwattr DW$219, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    3127                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3128                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3129              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3130                      .dwattr DW$220, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    3131                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3132                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3133              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3134                      .dwattr DW$221, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    3135                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3136                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3137              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3138                      .dwattr DW$222, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    3139                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3140                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3141              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3142                      .dwattr DW$223, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    3143                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3144                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3145              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3146                      .dwattr DW$224, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    3147                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3148                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3149              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3150                      .dwattr DW$225, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    3151                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3152                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3153              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3154                      .dwattr DW$226, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    3155                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   68

    3156                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3157              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3158                      .dwattr DW$227, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    3159                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3160                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3161              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3162                      .dwattr DW$228, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    3163                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3164                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3165              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3166                      .dwattr DW$229, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    3167                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3168                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3169              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3170                      .dwattr DW$230, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    3171                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3172                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3173              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3174                      .dwattr DW$231, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    3175                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3176                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3177                      .dwendtag DW$T$28
    3178              
    3179              DW$T$117        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$30)
    3180                      .dwattr DW$T$117, DW_AT_language(DW_LANG_C)
    3181              
    3182              DW$T$33 .dwtag  DW_TAG_structure_type
    3183                      .dwattr DW$T$33, DW_AT_name("tag_allsensorstruct")
    3184                      .dwattr DW$T$33, DW_AT_byte_size(0x2d)
    3185              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3186                      .dwattr DW$232, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    3187                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3188                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3189              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3190                      .dwattr DW$233, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    3191                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3192                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3193              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3194                      .dwattr DW$234, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    3195                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3196                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3197              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3198                      .dwattr DW$235, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    3199                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3200                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3201              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3202                      .dwattr DW$236, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    3203                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3204                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3205              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3206                      .dwattr DW$237, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    3207                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3208                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3209              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3210                      .dwattr DW$238, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   69

    3211                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3212                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3213              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3214                      .dwattr DW$239, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    3215                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3216                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3217              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3218                      .dwattr DW$240, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    3219                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3220                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3221              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3222                      .dwattr DW$241, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    3223                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3224                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3225              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3226                      .dwattr DW$242, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    3227                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3228                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3229              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3230                      .dwattr DW$243, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    3231                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3232                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3233              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3234                      .dwattr DW$244, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    3235                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3236                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3237              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3238                      .dwattr DW$245, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    3239                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3240                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3241              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3242                      .dwattr DW$246, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    3243                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3244                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3245              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3246                      .dwattr DW$247, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    3247                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3248                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3249              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3250                      .dwattr DW$248, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    3251                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3252                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3253              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3254                      .dwattr DW$249, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    3255                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3256                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3257              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3258                      .dwattr DW$250, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    3259                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3260                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3261              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3262                      .dwattr DW$251, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    3263                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3264                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3265              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   70

    3266                      .dwattr DW$252, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    3267                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3268                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3269              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3270                      .dwattr DW$253, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    3271                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3272                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3273              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3274                      .dwattr DW$254, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    3275                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3276                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3277              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3278                      .dwattr DW$255, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    3279                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3280                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3281              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3282                      .dwattr DW$256, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    3283                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3284                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3285              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3286                      .dwattr DW$257, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    3287                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3288                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3289              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3290                      .dwattr DW$258, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    3291                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3292                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3293              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3294                      .dwattr DW$259, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    3295                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3296                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3297              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3298                      .dwattr DW$260, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    3299                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3300                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3301              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    3302                      .dwattr DW$261, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    3303                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3304                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3305              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3306                      .dwattr DW$262, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    3307                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3308                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3309              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3310                      .dwattr DW$263, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    3311                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3312                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3313                      .dwendtag DW$T$33
    3314              
    3315              DW$T$122        .dwtag  DW_TAG_typedef, DW_AT_name("cylinderstruct"), DW_AT_type(*DW$T$36)
    3316                      .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
    3317              DW$T$126        .dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$40)
    3318                      .dwattr DW$T$126, DW_AT_language(DW_LANG_C)
    3319              
    3320              DW$T$41 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   71

    3321                      .dwattr DW$T$41, DW_AT_name("tag_damagemonstruct")
    3322                      .dwattr DW$T$41, DW_AT_byte_size(0x10)
    3323              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3324                      .dwattr DW$264, DW_AT_name("ccsplit"), DW_AT_symbol_name("_ccsplit")
    3325                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3326                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3327              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3328                      .dwattr DW$265, DW_AT_name("kvalue"), DW_AT_symbol_name("_kvalue")
    3329                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3330                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3331              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3332                      .dwattr DW$266, DW_AT_name("betavalue"), DW_AT_symbol_name("_betavalue")
    3333                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3334                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3335              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3336                      .dwattr DW$267, DW_AT_name("rpmlevelx"), DW_AT_symbol_name("_rpmlevelx")
    3337                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3338                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3339              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3340                      .dwattr DW$268, DW_AT_name("reflevelx"), DW_AT_symbol_name("_reflevelx")
    3341                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3342                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3343              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3344                      .dwattr DW$269, DW_AT_name("presentstatex"), DW_AT_symbol_name("_presentstatex")
    3345                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3346                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3347              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3348                      .dwattr DW$270, DW_AT_name("alarmlevelsingle"), DW_AT_symbol_name("_alarmlevelsingle")
    3349                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3350                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3351              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3352                      .dwattr DW$271, DW_AT_name("alarmlevelcyl"), DW_AT_symbol_name("_alarmlevelcyl")
    3353                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3354                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3355              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3356                      .dwattr DW$272, DW_AT_name("alarmlevelmbsum"), DW_AT_symbol_name("_alarmlevelmbsum")
    3357                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3358                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3359              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3360                      .dwattr DW$273, DW_AT_name("cylneighbour"), DW_AT_symbol_name("_cylneighbour")
    3361                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3362                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3363              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3364                      .dwattr DW$274, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
    3365                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3366                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3367              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3368                      .dwattr DW$275, DW_AT_name("cylneighbouralarms"), DW_AT_symbol_name("_cylneighbouralarms")
    3369                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3370                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3371              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3372                      .dwattr DW$276, DW_AT_name("mbneighbouralarms"), DW_AT_symbol_name("_mbneighbouralarms")
    3373                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3374                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3375              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   72

    3376                      .dwattr DW$277, DW_AT_name("deltarpmlimit"), DW_AT_symbol_name("_deltarpmlimit")
    3377                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3378                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3379              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3380                      .dwattr DW$278, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
    3381                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3382                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3383              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3384                      .dwattr DW$279, DW_AT_name("damagemonenb"), DW_AT_symbol_name("_damagemonenb")
    3385                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3386                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3387                      .dwendtag DW$T$41
    3388              
    3389              
    3390              DW$T$43 .dwtag  DW_TAG_structure_type
    3391                      .dwattr DW$T$43, DW_AT_name("tag_damalarmsstruct")
    3392                      .dwattr DW$T$43, DW_AT_byte_size(0x04)
    3393              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3394                      .dwattr DW$280, DW_AT_name("single"), DW_AT_symbol_name("_single")
    3395                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3396                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3397              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3398                      .dwattr DW$281, DW_AT_name("cylinder"), DW_AT_symbol_name("_cylinder")
    3399                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3400                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3401              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3402                      .dwattr DW$282, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
    3403                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3404                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3405                      .dwendtag DW$T$43
    3406              
    3407              
    3408              DW$T$45 .dwtag  DW_TAG_structure_type
    3409                      .dwattr DW$T$45, DW_AT_name("tag_slavecmdstruct")
    3410                      .dwattr DW$T$45, DW_AT_byte_size(0x48)
    3411              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3412                      .dwattr DW$283, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
    3413                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3414                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3415              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3416                      .dwattr DW$284, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
    3417                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3418                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3419              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3420                      .dwattr DW$285, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
    3421                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3422                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3423              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3424                      .dwattr DW$286, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
    3425                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3426                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3427              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3428                      .dwattr DW$287, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
    3429                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3430                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   73

    3431              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3432                      .dwattr DW$288, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
    3433                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3434                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3435              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3436                      .dwattr DW$289, DW_AT_name("txmode"), DW_AT_symbol_name("_txmode")
    3437                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3438                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3439              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3440                      .dwattr DW$290, DW_AT_name("slavelost"), DW_AT_symbol_name("_slavelost")
    3441                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3442                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3443              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3444                      .dwattr DW$291, DW_AT_name("slavenotready"), DW_AT_symbol_name("_slavenotready")
    3445                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    3446                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3447                      .dwendtag DW$T$45
    3448              
    3449              
    3450              DW$T$48 .dwtag  DW_TAG_structure_type
    3451                      .dwattr DW$T$48, DW_AT_name("tag_waterinoilstruct")
    3452                      .dwattr DW$T$48, DW_AT_byte_size(0x0c)
    3453              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3454                      .dwattr DW$292, DW_AT_name("netadd"), DW_AT_symbol_name("_netadd")
    3455                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3456                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3457              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3458                      .dwattr DW$293, DW_AT_name("temperature"), DW_AT_symbol_name("_temperature")
    3459                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3460                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3461              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3462                      .dwattr DW$294, DW_AT_name("activity"), DW_AT_symbol_name("_activity")
    3463                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3464                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3465              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3466                      .dwattr DW$295, DW_AT_name("content"), DW_AT_symbol_name("_content")
    3467                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3468                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3469              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3470                      .dwattr DW$296, DW_AT_name("temperature_int"), DW_AT_symbol_name("_temperature_int")
    3471                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3472                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3473              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3474                      .dwattr DW$297, DW_AT_name("activity_int"), DW_AT_symbol_name("_activity_int")
    3475                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3476                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3477              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3478                      .dwattr DW$298, DW_AT_name("content_int"), DW_AT_symbol_name("_content_int")
    3479                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3480                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3481              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3482                      .dwattr DW$299, DW_AT_name("wioalarms"), DW_AT_symbol_name("_wioalarms")
    3483                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3484                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3485                      .dwendtag DW$T$48
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   74

    3486              
    3487              
    3488              DW$T$49 .dwtag  DW_TAG_structure_type
    3489                      .dwattr DW$T$49, DW_AT_byte_size(0x07)
    3490              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3491                      .dwattr DW$300, DW_AT_name("outputtestmode"), DW_AT_symbol_name("_outputtestmode")
    3492                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3493                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3494              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3495                      .dwattr DW$301, DW_AT_name("previousstatus"), DW_AT_symbol_name("_previousstatus")
    3496                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3497                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3498              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3499                      .dwattr DW$302, DW_AT_name("previousslowdown"), DW_AT_symbol_name("_previousslowdown")
    3500                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3501                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3502              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3503                      .dwattr DW$303, DW_AT_name("previousalarm"), DW_AT_symbol_name("_previousalarm")
    3504                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3505                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3506              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3507                      .dwattr DW$304, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    3508                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3509                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3510              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3511                      .dwattr DW$305, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    3512                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3513                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3514              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3515                      .dwattr DW$306, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    3516                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3517                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3518                      .dwendtag DW$T$49
    3519              
    3520              
    3521              DW$T$51 .dwtag  DW_TAG_structure_type
    3522                      .dwattr DW$T$51, DW_AT_name("tag_bearingstatusstruct")
    3523                      .dwattr DW$T$51, DW_AT_byte_size(0x2c)
    3524              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    3525                      .dwattr DW$307, DW_AT_name("MainBearings"), DW_AT_symbol_name("_MainBearings")
    3526                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3527                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3528              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3529                      .dwattr DW$308, DW_AT_name("CrankPinBearings"), DW_AT_symbol_name("_CrankPinBearings")
    3530                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3531                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3532              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3533                      .dwattr DW$309, DW_AT_name("CrossHeadBearings"), DW_AT_symbol_name("_CrossHeadBearings")
    3534                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3535                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3536                      .dwendtag DW$T$51
    3537              
    3538              DW$T$52 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    3539                      .dwattr DW$T$52, DW_AT_encoding(DW_ATE_signed_char)
    3540                      .dwattr DW$T$52, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   75

    3541              DW$310  .dwtag  DW_TAG_far_type
    3542                      .dwattr DW$310, DW_AT_type(*DW$T$52)
    3543              DW$T$63 .dwtag  DW_TAG_const_type
    3544                      .dwattr DW$T$63, DW_AT_type(*DW$310)
    3545              
    3546              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3547                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    3548                      .dwattr DW$T$22, DW_AT_byte_size(0x09)
    3549              DW$311  .dwtag  DW_TAG_subrange_type
    3550                      .dwattr DW$311, DW_AT_upper_bound(0x08)
    3551                      .dwendtag DW$T$22
    3552              
    3553              
    3554              DW$T$23 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3555                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    3556                      .dwattr DW$T$23, DW_AT_byte_size(0x18)
    3557              DW$312  .dwtag  DW_TAG_subrange_type
    3558                      .dwattr DW$312, DW_AT_upper_bound(0x17)
    3559                      .dwendtag DW$T$23
    3560              
    3561              
    3562              DW$T$24 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3563                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    3564                      .dwattr DW$T$24, DW_AT_byte_size(0x0f)
    3565              DW$313  .dwtag  DW_TAG_subrange_type
    3566                      .dwattr DW$313, DW_AT_upper_bound(0x0e)
    3567                      .dwendtag DW$T$24
    3568              
    3569              
    3570              DW$T$25 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3571                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    3572                      .dwattr DW$T$25, DW_AT_byte_size(0x05)
    3573              DW$314  .dwtag  DW_TAG_subrange_type
    3574                      .dwattr DW$314, DW_AT_upper_bound(0x04)
    3575                      .dwendtag DW$T$25
    3576              
    3577              
    3578              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3579                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    3580                      .dwattr DW$T$29, DW_AT_byte_size(0x0e)
    3581              DW$315  .dwtag  DW_TAG_subrange_type
    3582                      .dwattr DW$315, DW_AT_upper_bound(0x0d)
    3583                      .dwendtag DW$T$29
    3584              
    3585              
    3586              DW$T$42 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3587                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    3588                      .dwattr DW$T$42, DW_AT_byte_size(0x02)
    3589              DW$316  .dwtag  DW_TAG_subrange_type
    3590                      .dwattr DW$316, DW_AT_upper_bound(0x01)
    3591                      .dwendtag DW$T$42
    3592              
    3593              
    3594              DW$T$44 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3595                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   76

    3596                      .dwattr DW$T$44, DW_AT_byte_size(0x40)
    3597              DW$317  .dwtag  DW_TAG_subrange_type
    3598                      .dwattr DW$317, DW_AT_upper_bound(0x3f)
    3599                      .dwendtag DW$T$44
    3600              
    3601              
    3602              DW$T$50 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3603                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    3604                      .dwattr DW$T$50, DW_AT_byte_size(0x10)
    3605              DW$318  .dwtag  DW_TAG_subrange_type
    3606                      .dwattr DW$318, DW_AT_upper_bound(0x0f)
    3607                      .dwendtag DW$T$50
    3608              
    3609              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    3610                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    3611                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    3612              
    3613              DW$T$19 .dwtag  DW_TAG_structure_type
    3614                      .dwattr DW$T$19, DW_AT_name("tag_sensoralarmstruct")
    3615                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    3616              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3617                      .dwattr DW$319, DW_AT_name("failure"), DW_AT_symbol_name("_failure")
    3618                      .dwattr DW$319, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3619                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3620                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3621              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3622                      .dwattr DW$320, DW_AT_name("failurelatched"), DW_AT_symbol_name("_failurelatched")
    3623                      .dwattr DW$320, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3624                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3625                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3626              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3627                      .dwattr DW$321, DW_AT_name("slowdown"), DW_AT_symbol_name("_slowdown")
    3628                      .dwattr DW$321, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3629                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3630                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3631              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3632                      .dwattr DW$322, DW_AT_name("slowdownlatched"), DW_AT_symbol_name("_slowdownlatched")
    3633                      .dwattr DW$322, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3634                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3635                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3636              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3637                      .dwattr DW$323, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
    3638                      .dwattr DW$323, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3639                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3640                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3641              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3642                      .dwattr DW$324, DW_AT_name("alarmlatched"), DW_AT_symbol_name("_alarmlatched")
    3643                      .dwattr DW$324, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3644                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3645                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3646              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3647                      .dwattr DW$325, DW_AT_name("devalarm"), DW_AT_symbol_name("_devalarm")
    3648                      .dwattr DW$325, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3649                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3650                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   77

    3651              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3652                      .dwattr DW$326, DW_AT_name("devalarmlatched"), DW_AT_symbol_name("_devalarmlatched")
    3653                      .dwattr DW$326, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3654                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3655                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3656              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3657                      .dwattr DW$327, DW_AT_name("devslow"), DW_AT_symbol_name("_devslow")
    3658                      .dwattr DW$327, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3659                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3660                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3661              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3662                      .dwattr DW$328, DW_AT_name("devslowlatched"), DW_AT_symbol_name("_devslowlatched")
    3663                      .dwattr DW$328, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3664                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3665                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3666              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3667                      .dwattr DW$329, DW_AT_name("calibration"), DW_AT_symbol_name("_calibration")
    3668                      .dwattr DW$329, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3669                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3670                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3671              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3672                      .dwattr DW$330, DW_AT_name("calibrationlatched"), DW_AT_symbol_name("_calibrationlatched")
    3673                      .dwattr DW$330, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3674                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3675                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3676              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3677                      .dwattr DW$331, DW_AT_name("prewarning"), DW_AT_symbol_name("_prewarning")
    3678                      .dwattr DW$331, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3679                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3680                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3681              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3682                      .dwattr DW$332, DW_AT_name("prewarninglatched"), DW_AT_symbol_name("_prewarninglatched")
    3683                      .dwattr DW$332, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3684                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3685                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3686              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3687                      .dwattr DW$333, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    3688                      .dwattr DW$333, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3689                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3690                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3691              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3692                      .dwattr DW$334, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    3693                      .dwattr DW$334, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3694                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3695                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3696                      .dwendtag DW$T$19
    3697              
    3698              
    3699              DW$T$21 .dwtag  DW_TAG_structure_type
    3700                      .dwattr DW$T$21, DW_AT_name("tag_status3struct")
    3701                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    3702              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3703                      .dwattr DW$335, DW_AT_name("nopulse"), DW_AT_symbol_name("_nopulse")
    3704                      .dwattr DW$335, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3705                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   78

    3706                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3707              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3708                      .dwattr DW$336, DW_AT_name("low"), DW_AT_symbol_name("_low")
    3709                      .dwattr DW$336, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3710                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3711                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3712              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3713                      .dwattr DW$337, DW_AT_name("high"), DW_AT_symbol_name("_high")
    3714                      .dwattr DW$337, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3715                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3716                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3717              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3718                      .dwattr DW$338, DW_AT_name("rpmoor"), DW_AT_symbol_name("_rpmoor")
    3719                      .dwattr DW$338, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3720                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3721                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3722              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3723                      .dwattr DW$339, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    3724                      .dwattr DW$339, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3725                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3726                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3727              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3728                      .dwattr DW$340, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    3729                      .dwattr DW$340, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3730                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3731                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3732              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3733                      .dwattr DW$341, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    3734                      .dwattr DW$341, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3735                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3736                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3737              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3738                      .dwattr DW$342, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    3739                      .dwattr DW$342, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3740                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3741                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3742              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3743                      .dwattr DW$343, DW_AT_name("nopulselatched"), DW_AT_symbol_name("_nopulselatched")
    3744                      .dwattr DW$343, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3745                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3746                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3747              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3748                      .dwattr DW$344, DW_AT_name("lowlatched"), DW_AT_symbol_name("_lowlatched")
    3749                      .dwattr DW$344, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3750                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3751                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3752              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3753                      .dwattr DW$345, DW_AT_name("highlatched"), DW_AT_symbol_name("_highlatched")
    3754                      .dwattr DW$345, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3755                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3756                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3757              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3758                      .dwattr DW$346, DW_AT_name("rpmoorlatched"), DW_AT_symbol_name("_rpmoorlatched")
    3759                      .dwattr DW$346, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3760                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   79

    3761                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3762              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3763                      .dwattr DW$347, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    3764                      .dwattr DW$347, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3765                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3766                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3767              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3768                      .dwattr DW$348, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    3769                      .dwattr DW$348, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3770                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3771                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3772              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3773                      .dwattr DW$349, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    3774                      .dwattr DW$349, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3775                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3776                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3777              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3778                      .dwattr DW$350, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    3779                      .dwattr DW$350, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3780                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3781                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3782                      .dwendtag DW$T$21
    3783              
    3784              
    3785              DW$T$27 .dwtag  DW_TAG_structure_type
    3786                      .dwattr DW$T$27, DW_AT_byte_size(0x02)
    3787              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3788                      .dwattr DW$351, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    3789                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3790                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3791              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3792                      .dwattr DW$352, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    3793                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3794                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3795                      .dwendtag DW$T$27
    3796              
    3797              
    3798              DW$T$30 .dwtag  DW_TAG_structure_type
    3799                      .dwattr DW$T$30, DW_AT_name("tag_timers")
    3800                      .dwattr DW$T$30, DW_AT_byte_size(0x4c)
    3801              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3802                      .dwattr DW$353, DW_AT_name("update"), DW_AT_symbol_name("_update")
    3803                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3804                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3805              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3806                      .dwattr DW$354, DW_AT_name("general"), DW_AT_symbol_name("_general")
    3807                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3808                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3809              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3810                      .dwattr DW$355, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    3811                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3812                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3813              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3814                      .dwattr DW$356, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    3815                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   80

    3816                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3817              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3818                      .dwattr DW$357, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    3819                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3820                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3821              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3822                      .dwattr DW$358, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    3823                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3824                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3825              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3826                      .dwattr DW$359, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    3827                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3828                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3829              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3830                      .dwattr DW$360, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    3831                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3832                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3833              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3834                      .dwattr DW$361, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    3835                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3836                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3837              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3838                      .dwattr DW$362, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    3839                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3840                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3841              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3842                      .dwattr DW$363, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    3843                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3844                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3845              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3846                      .dwattr DW$364, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    3847                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3848                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3849              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3850                      .dwattr DW$365, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    3851                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3852                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3853              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3854                      .dwattr DW$366, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    3855                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3856                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3857              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3858                      .dwattr DW$367, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    3859                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3860                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3861              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3862                      .dwattr DW$368, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    3863                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3864                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3865              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3866                      .dwattr DW$369, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    3867                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3868                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3869              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3870                      .dwattr DW$370, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   81

    3871                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3872                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3873              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3874                      .dwattr DW$371, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    3875                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3876                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3877              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3878                      .dwattr DW$372, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    3879                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3880                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3881              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3882                      .dwattr DW$373, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    3883                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3884                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3885              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3886                      .dwattr DW$374, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    3887                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3888                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3889              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3890                      .dwattr DW$375, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    3891                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    3892                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3893              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3894                      .dwattr DW$376, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    3895                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3896                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3897              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3898                      .dwattr DW$377, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    3899                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3900                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3901              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3902                      .dwattr DW$378, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    3903                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3904                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3905              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3906                      .dwattr DW$379, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    3907                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3908                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3909              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3910                      .dwattr DW$380, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    3911                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3912                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3913              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3914                      .dwattr DW$381, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    3915                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    3916                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3917              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3918                      .dwattr DW$382, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    3919                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3920                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3921              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3922                      .dwattr DW$383, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    3923                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3924                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3925              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:06 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
alarms.asm                                                           PAGE   82

    3926                      .dwattr DW$384, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
