TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:07 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("common.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

   11322                      .dwendtag DW$T$260
   11323              
   11324              DW$T$92 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$74)
   11325                      .dwattr DW$T$92, DW_AT_address_class(0x16)
   11326              DW$T$142        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$92)
   11327                      .dwattr DW$T$142, DW_AT_address_class(0x16)
   11328              DW$T$106        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$105)
   11329                      .dwattr DW$T$106, DW_AT_address_class(0x16)
   11330              DW$T$185        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$106)
   11331                      .dwattr DW$T$185, DW_AT_address_class(0x16)
   11332              
   11333              DW$T$273        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$105)
   11334                      .dwattr DW$T$273, DW_AT_language(DW_LANG_C)
   11335                      .dwattr DW$T$273, DW_AT_byte_size(0x1a)
   11336              DW$645  .dwtag  DW_TAG_subrange_type
   11337                      .dwattr DW$645, DW_AT_upper_bound(0x00)
   11338                      .dwendtag DW$T$273
   11339              
   11340              DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
   11341                      .dwattr DW$T$64, DW_AT_address_class(0x16)
   11342              DW$T$179        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$67)
   11343                      .dwattr DW$T$179, DW_AT_address_class(0x16)
   11344              DW$T$108        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
   11345                      .dwattr DW$T$108, DW_AT_address_class(0x16)
   11346              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  229

   11347              DW$T$285        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$108)
   11348                      .dwattr DW$T$285, DW_AT_language(DW_LANG_C)
   11349              DW$646  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$179)
   11350                      .dwendtag DW$T$285
   11351              
   11352              DW$T$100        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$99)
   11353                      .dwattr DW$T$100, DW_AT_address_class(0x16)
   11354              DW$T$171        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$170)
   11355                      .dwattr DW$T$171, DW_AT_address_class(0x16)
   11356              DW$T$299        .dwtag  DW_TAG_typedef, DW_AT_name("F_FILESYSTEM"), DW_AT_type(*DW$T$78)
   11357                      .dwattr DW$T$299, DW_AT_language(DW_LANG_C)
   11358              
   11359              DW$T$303        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$302)
   11360                      .dwattr DW$T$303, DW_AT_language(DW_LANG_C)
   11361                      .dwattr DW$T$303, DW_AT_byte_size(0x18)
   11362              DW$647  .dwtag  DW_TAG_subrange_type
   11363                      .dwattr DW$647, DW_AT_upper_bound(0x05)
   11364                      .dwendtag DW$T$303
   11365              
   11366              DW$648  .dwtag  DW_TAG_far_type
   11367              DW$T$80 .dwtag  DW_TAG_const_type
   11368                      .dwattr DW$T$80, DW_AT_type(*DW$648)
   11369              DW$649  .dwtag  DW_TAG_far_type
   11370                      .dwattr DW$649, DW_AT_type(*DW$T$6)
   11371              DW$T$121        .dwtag  DW_TAG_const_type
   11372                      .dwattr DW$T$121, DW_AT_type(*DW$649)
   11373              DW$T$147        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$146)
   11374                      .dwattr DW$T$147, DW_AT_address_class(0x16)
   11375              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("F_BOOTRECORD"), DW_AT_type(*DW$T$24)
   11376                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
   11377              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("F_PHY"), DW_AT_type(*DW$T$26)
   11378                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
   11379              DW$T$52 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
   11380                      .dwattr DW$T$52, DW_AT_encoding(DW_ATE_signed_char)
   11381                      .dwattr DW$T$52, DW_AT_byte_size(0x01)
   11382              DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("F_VOLUME"), DW_AT_type(*DW$T$55)
   11383                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
   11384              DW$T$105        .dwtag  DW_TAG_typedef, DW_AT_name("F_MULTI"), DW_AT_type(*DW$T$60)
   11385                      .dwattr DW$T$105, DW_AT_language(DW_LANG_C)
   11386              DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("F_POS"), DW_AT_type(*DW$T$61)
   11387                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
   11388              DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("F_FILE"), DW_AT_type(*DW$T$62)
   11389                      .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
   11390              DW$T$76 .dwtag  DW_TAG_typedef, DW_AT_name("F_FILEINT"), DW_AT_type(*DW$T$70)
   11391                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
   11392              DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("F_DIRENTRY"), DW_AT_type(*DW$T$72)
   11393                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
   11394              DW$T$170        .dwtag  DW_TAG_typedef, DW_AT_name("F_SPACE"), DW_AT_type(*DW$T$73)
   11395                      .dwattr DW$T$170, DW_AT_language(DW_LANG_C)
   11396              
   11397              DW$T$78 .dwtag  DW_TAG_structure_type
   11398                      .dwattr DW$T$78, DW_AT_byte_size(0xa4a)
   11399              DW$650  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
   11400                      .dwattr DW$650, DW_AT_name("volumes"), DW_AT_symbol_name("_volumes")
   11401                      .dwattr DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  230

   11402                      .dwattr DW$650, DW_AT_accessibility(DW_ACCESS_public)
   11403              DW$651  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
   11404                      .dwattr DW$651, DW_AT_name("files"), DW_AT_symbol_name("_files")
   11405                      .dwattr DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x47c]
   11406                      .dwattr DW$651, DW_AT_accessibility(DW_ACCESS_public)
   11407              DW$652  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   11408                      .dwattr DW$652, DW_AT_name("sectorbuffer"), DW_AT_symbol_name("_sectorbuffer")
   11409                      .dwattr DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x84a]
   11410                      .dwattr DW$652, DW_AT_accessibility(DW_ACCESS_public)
   11411                      .dwendtag DW$T$78
   11412              
   11413              DW$653  .dwtag  DW_TAG_far_type
   11414                      .dwattr DW$653, DW_AT_type(*DW$T$301)
   11415              DW$T$302        .dwtag  DW_TAG_const_type
   11416                      .dwattr DW$T$302, DW_AT_type(*DW$653)
   11417              
   11418              DW$T$50 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
   11419                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
   11420                      .dwattr DW$T$50, DW_AT_byte_size(0x200)
   11421              DW$654  .dwtag  DW_TAG_subrange_type
   11422                      .dwattr DW$654, DW_AT_upper_bound(0x1ff)
   11423                      .dwendtag DW$T$50
   11424              
   11425              
   11426              DW$T$146        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
   11427                      .dwattr DW$T$146, DW_AT_language(DW_LANG_C)
   11428              DW$655  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$145)
   11429              DW$656  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
   11430                      .dwendtag DW$T$146
   11431              
   11432              
   11433              DW$T$24 .dwtag  DW_TAG_structure_type
   11434                      .dwattr DW$T$24, DW_AT_byte_size(0x48)
   11435              DW$657  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   11436                      .dwattr DW$657, DW_AT_name("jump_code"), DW_AT_symbol_name("_jump_code")
   11437                      .dwattr DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11438                      .dwattr DW$657, DW_AT_accessibility(DW_ACCESS_public)
   11439              DW$658  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
   11440                      .dwattr DW$658, DW_AT_name("OEM_name"), DW_AT_symbol_name("_OEM_name")
   11441                      .dwattr DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11442                      .dwattr DW$658, DW_AT_accessibility(DW_ACCESS_public)
   11443              DW$659  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11444                      .dwattr DW$659, DW_AT_name("bytes_per_sector"), DW_AT_symbol_name("_bytes_per_sector")
   11445                      .dwattr DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11446                      .dwattr DW$659, DW_AT_accessibility(DW_ACCESS_public)
   11447              DW$660  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11448                      .dwattr DW$660, DW_AT_name("sector_per_cluster"), DW_AT_symbol_name("_sector_per_cluster")
   11449                      .dwattr DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11450                      .dwattr DW$660, DW_AT_accessibility(DW_ACCESS_public)
   11451              DW$661  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11452                      .dwattr DW$661, DW_AT_name("reserved_sectors"), DW_AT_symbol_name("_reserved_sectors")
   11453                      .dwattr DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11454                      .dwattr DW$661, DW_AT_accessibility(DW_ACCESS_public)
   11455              DW$662  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11456                      .dwattr DW$662, DW_AT_name("number_of_FATs"), DW_AT_symbol_name("_number_of_FATs")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  231

   11457                      .dwattr DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11458                      .dwattr DW$662, DW_AT_accessibility(DW_ACCESS_public)
   11459              DW$663  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11460                      .dwattr DW$663, DW_AT_name("max_root_entry"), DW_AT_symbol_name("_max_root_entry")
   11461                      .dwattr DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   11462                      .dwattr DW$663, DW_AT_accessibility(DW_ACCESS_public)
   11463              DW$664  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11464                      .dwattr DW$664, DW_AT_name("number_of_sectors_less32"), DW_AT_symbol_name("_number_of_sectors_less32"
   11465                      .dwattr DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11466                      .dwattr DW$664, DW_AT_accessibility(DW_ACCESS_public)
   11467              DW$665  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11468                      .dwattr DW$665, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
   11469                      .dwattr DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   11470                      .dwattr DW$665, DW_AT_accessibility(DW_ACCESS_public)
   11471              DW$666  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11472                      .dwattr DW$666, DW_AT_name("sector_per_FAT"), DW_AT_symbol_name("_sector_per_FAT")
   11473                      .dwattr DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11474                      .dwattr DW$666, DW_AT_accessibility(DW_ACCESS_public)
   11475              DW$667  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11476                      .dwattr DW$667, DW_AT_name("sector_per_Track"), DW_AT_symbol_name("_sector_per_Track")
   11477                      .dwattr DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   11478                      .dwattr DW$667, DW_AT_accessibility(DW_ACCESS_public)
   11479              DW$668  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11480                      .dwattr DW$668, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
   11481                      .dwattr DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11482                      .dwattr DW$668, DW_AT_accessibility(DW_ACCESS_public)
   11483              DW$669  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11484                      .dwattr DW$669, DW_AT_name("number_of_hidden_sectors"), DW_AT_symbol_name("_number_of_hidden_sectors"
   11485                      .dwattr DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11486                      .dwattr DW$669, DW_AT_accessibility(DW_ACCESS_public)
   11487              DW$670  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11488                      .dwattr DW$670, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
   11489                      .dwattr DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11490                      .dwattr DW$670, DW_AT_accessibility(DW_ACCESS_public)
   11491              DW$671  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11492                      .dwattr DW$671, DW_AT_name("sector_per_FAT32"), DW_AT_symbol_name("_sector_per_FAT32")
   11493                      .dwattr DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11494                      .dwattr DW$671, DW_AT_accessibility(DW_ACCESS_public)
   11495              DW$672  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11496                      .dwattr DW$672, DW_AT_name("extflags"), DW_AT_symbol_name("_extflags")
   11497                      .dwattr DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11498                      .dwattr DW$672, DW_AT_accessibility(DW_ACCESS_public)
   11499              DW$673  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11500                      .dwattr DW$673, DW_AT_name("fsversion"), DW_AT_symbol_name("_fsversion")
   11501                      .dwattr DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   11502                      .dwattr DW$673, DW_AT_accessibility(DW_ACCESS_public)
   11503              DW$674  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11504                      .dwattr DW$674, DW_AT_name("rootcluster"), DW_AT_symbol_name("_rootcluster")
   11505                      .dwattr DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   11506                      .dwattr DW$674, DW_AT_accessibility(DW_ACCESS_public)
   11507              DW$675  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11508                      .dwattr DW$675, DW_AT_name("fsinfo"), DW_AT_symbol_name("_fsinfo")
   11509                      .dwattr DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   11510                      .dwattr DW$675, DW_AT_accessibility(DW_ACCESS_public)
   11511              DW$676  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  232

   11512                      .dwattr DW$676, DW_AT_name("bkbootsec"), DW_AT_symbol_name("_bkbootsec")
   11513                      .dwattr DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   11514                      .dwattr DW$676, DW_AT_accessibility(DW_ACCESS_public)
   11515              DW$677  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   11516                      .dwattr DW$677, DW_AT_name("reserved"), DW_AT_symbol_name("_reserved")
   11517                      .dwattr DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   11518                      .dwattr DW$677, DW_AT_accessibility(DW_ACCESS_public)
   11519              DW$678  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11520                      .dwattr DW$678, DW_AT_name("logical_drive_num"), DW_AT_symbol_name("_logical_drive_num")
   11521                      .dwattr DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   11522                      .dwattr DW$678, DW_AT_accessibility(DW_ACCESS_public)
   11523              DW$679  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11524                      .dwattr DW$679, DW_AT_name("extended_signature"), DW_AT_symbol_name("_extended_signature")
   11525                      .dwattr DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
   11526                      .dwattr DW$679, DW_AT_accessibility(DW_ACCESS_public)
   11527              DW$680  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11528                      .dwattr DW$680, DW_AT_name("serial_number"), DW_AT_symbol_name("_serial_number")
   11529                      .dwattr DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   11530                      .dwattr DW$680, DW_AT_accessibility(DW_ACCESS_public)
   11531              DW$681  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
   11532                      .dwattr DW$681, DW_AT_name("volume_name"), DW_AT_symbol_name("_volume_name")
   11533                      .dwattr DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   11534                      .dwattr DW$681, DW_AT_accessibility(DW_ACCESS_public)
   11535              DW$682  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
   11536                      .dwattr DW$682, DW_AT_name("FAT_name"), DW_AT_symbol_name("_FAT_name")
   11537                      .dwattr DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
   11538                      .dwattr DW$682, DW_AT_accessibility(DW_ACCESS_public)
   11539              DW$683  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   11540                      .dwattr DW$683, DW_AT_name("executable_marker"), DW_AT_symbol_name("_executable_marker")
   11541                      .dwattr DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   11542                      .dwattr DW$683, DW_AT_accessibility(DW_ACCESS_public)
   11543                      .dwendtag DW$T$24
   11544              
   11545              
   11546              DW$T$26 .dwtag  DW_TAG_structure_type
   11547                      .dwattr DW$T$26, DW_AT_byte_size(0x08)
   11548              DW$684  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11549                      .dwattr DW$684, DW_AT_name("number_of_cylinders"), DW_AT_symbol_name("_number_of_cylinders")
   11550                      .dwattr DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11551                      .dwattr DW$684, DW_AT_accessibility(DW_ACCESS_public)
   11552              DW$685  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11553                      .dwattr DW$685, DW_AT_name("sector_per_track"), DW_AT_symbol_name("_sector_per_track")
   11554                      .dwattr DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11555                      .dwattr DW$685, DW_AT_accessibility(DW_ACCESS_public)
   11556              DW$686  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   11557                      .dwattr DW$686, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
   11558                      .dwattr DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11559                      .dwattr DW$686, DW_AT_accessibility(DW_ACCESS_public)
   11560              DW$687  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11561                      .dwattr DW$687, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
   11562                      .dwattr DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11563                      .dwattr DW$687, DW_AT_accessibility(DW_ACCESS_public)
   11564              DW$688  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11565                      .dwattr DW$688, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
   11566                      .dwattr DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  233

   11567                      .dwattr DW$688, DW_AT_accessibility(DW_ACCESS_public)
   11568                      .dwendtag DW$T$26
   11569              
   11570              DW$T$145        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
   11571                      .dwattr DW$T$145, DW_AT_address_class(0x16)
   11572              
   11573              DW$T$55 .dwtag  DW_TAG_structure_type
   11574                      .dwattr DW$T$55, DW_AT_byte_size(0x47c)
   11575              DW$689  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
   11576                      .dwattr DW$689, DW_AT_name("state"), DW_AT_symbol_name("_state")
   11577                      .dwattr DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11578                      .dwattr DW$689, DW_AT_accessibility(DW_ACCESS_public)
   11579              DW$690  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
   11580                      .dwattr DW$690, DW_AT_name("bootrecord"), DW_AT_symbol_name("_bootrecord")
   11581                      .dwattr DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11582                      .dwattr DW$690, DW_AT_accessibility(DW_ACCESS_public)
   11583              DW$691  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
   11584                      .dwattr DW$691, DW_AT_name("firstfat"), DW_AT_symbol_name("_firstfat")
   11585                      .dwattr DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   11586                      .dwattr DW$691, DW_AT_accessibility(DW_ACCESS_public)
   11587              DW$692  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
   11588                      .dwattr DW$692, DW_AT_name("root"), DW_AT_symbol_name("_root")
   11589                      .dwattr DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   11590                      .dwattr DW$692, DW_AT_accessibility(DW_ACCESS_public)
   11591              DW$693  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
   11592                      .dwattr DW$693, DW_AT_name("data"), DW_AT_symbol_name("_data")
   11593                      .dwattr DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
   11594                      .dwattr DW$693, DW_AT_accessibility(DW_ACCESS_public)
   11595              DW$694  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   11596                      .dwattr DW$694, DW_AT_name("fat"), DW_AT_symbol_name("_fat")
   11597                      .dwattr DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
   11598                      .dwattr DW$694, DW_AT_accessibility(DW_ACCESS_public)
   11599              DW$695  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11600                      .dwattr DW$695, DW_AT_name("fatsector"), DW_AT_symbol_name("_fatsector")
   11601                      .dwattr DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x256]
   11602                      .dwattr DW$695, DW_AT_accessibility(DW_ACCESS_public)
   11603              DW$696  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
   11604                      .dwattr DW$696, DW_AT_name("fatmodified"), DW_AT_symbol_name("_fatmodified")
   11605                      .dwattr DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x258]
   11606                      .dwattr DW$696, DW_AT_accessibility(DW_ACCESS_public)
   11607              DW$697  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   11608                      .dwattr DW$697, DW_AT_name("direntry"), DW_AT_symbol_name("_direntry")
   11609                      .dwattr DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x25a]
   11610                      .dwattr DW$697, DW_AT_accessibility(DW_ACCESS_public)
   11611              DW$698  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11612                      .dwattr DW$698, DW_AT_name("direntrysector"), DW_AT_symbol_name("_direntrysector")
   11613                      .dwattr DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x45a]
   11614                      .dwattr DW$698, DW_AT_accessibility(DW_ACCESS_public)
   11615              DW$699  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11616                      .dwattr DW$699, DW_AT_name("lastalloccluster"), DW_AT_symbol_name("_lastalloccluster")
   11617                      .dwattr DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x45c]
   11618                      .dwattr DW$699, DW_AT_accessibility(DW_ACCESS_public)
   11619              DW$700  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
   11620                      .dwattr DW$700, DW_AT_name("func"), DW_AT_symbol_name("_func")
   11621                      .dwattr DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x45e]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  234

   11622                      .dwattr DW$700, DW_AT_accessibility(DW_ACCESS_public)
   11623              DW$701  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
   11624                      .dwattr DW$701, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
   11625                      .dwattr DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
   11626                      .dwattr DW$701, DW_AT_accessibility(DW_ACCESS_public)
   11627              DW$702  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
   11628                      .dwattr DW$702, DW_AT_name("mediatype"), DW_AT_symbol_name("_mediatype")
   11629                      .dwattr DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x470]
   11630                      .dwattr DW$702, DW_AT_accessibility(DW_ACCESS_public)
   11631              DW$703  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
   11632                      .dwattr DW$703, DW_AT_name("clspace"), DW_AT_symbol_name("_clspace")
   11633                      .dwattr DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x472]
   11634                      .dwattr DW$703, DW_AT_accessibility(DW_ACCESS_public)
   11635              DW$704  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
   11636                      .dwattr DW$704, DW_AT_name("cspaceok"), DW_AT_symbol_name("_cspaceok")
   11637                      .dwattr DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x478]
   11638                      .dwattr DW$704, DW_AT_accessibility(DW_ACCESS_public)
   11639              DW$705  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11640                      .dwattr DW$705, DW_AT_name("mutex"), DW_AT_symbol_name("_mutex")
   11641                      .dwattr DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x47a]
   11642                      .dwattr DW$705, DW_AT_accessibility(DW_ACCESS_public)
   11643                      .dwendtag DW$T$55
   11644              
   11645              
   11646              DW$T$75 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$74)
   11647                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
   11648                      .dwattr DW$T$75, DW_AT_byte_size(0x47c)
   11649              DW$706  .dwtag  DW_TAG_subrange_type
   11650                      .dwattr DW$706, DW_AT_upper_bound(0x00)
   11651                      .dwendtag DW$T$75
   11652              
   11653              
   11654              DW$T$60 .dwtag  DW_TAG_structure_type
   11655                      .dwattr DW$T$60, DW_AT_byte_size(0x1a)
   11656              DW$707  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
   11657                      .dwattr DW$707, DW_AT_name("ID"), DW_AT_symbol_name("_ID")
   11658                      .dwattr DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11659                      .dwattr DW$707, DW_AT_accessibility(DW_ACCESS_public)
   11660              DW$708  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   11661                      .dwattr DW$708, DW_AT_name("f_curdrive"), DW_AT_symbol_name("_f_curdrive")
   11662                      .dwattr DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11663                      .dwattr DW$708, DW_AT_accessibility(DW_ACCESS_public)
   11664              DW$709  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
   11665                      .dwattr DW$709, DW_AT_name("f_vols"), DW_AT_symbol_name("_f_vols")
   11666                      .dwattr DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11667                      .dwattr DW$709, DW_AT_accessibility(DW_ACCESS_public)
   11668              DW$710  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
   11669                      .dwattr DW$710, DW_AT_name("pmutex"), DW_AT_symbol_name("_pmutex")
   11670                      .dwattr DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11671                      .dwattr DW$710, DW_AT_accessibility(DW_ACCESS_public)
   11672                      .dwendtag DW$T$60
   11673              
   11674              
   11675              DW$T$61 .dwtag  DW_TAG_structure_type
   11676                      .dwattr DW$T$61, DW_AT_byte_size(0x0c)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  235

   11677              DW$711  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11678                      .dwattr DW$711, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
   11679                      .dwattr DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11680                      .dwattr DW$711, DW_AT_accessibility(DW_ACCESS_public)
   11681              DW$712  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11682                      .dwattr DW$712, DW_AT_name("prevcluster"), DW_AT_symbol_name("_prevcluster")
   11683                      .dwattr DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11684                      .dwattr DW$712, DW_AT_accessibility(DW_ACCESS_public)
   11685              DW$713  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11686                      .dwattr DW$713, DW_AT_name("sectorbegin"), DW_AT_symbol_name("_sectorbegin")
   11687                      .dwattr DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11688                      .dwattr DW$713, DW_AT_accessibility(DW_ACCESS_public)
   11689              DW$714  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11690                      .dwattr DW$714, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
   11691                      .dwattr DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11692                      .dwattr DW$714, DW_AT_accessibility(DW_ACCESS_public)
   11693              DW$715  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11694                      .dwattr DW$715, DW_AT_name("sectorend"), DW_AT_symbol_name("_sectorend")
   11695                      .dwattr DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11696                      .dwattr DW$715, DW_AT_accessibility(DW_ACCESS_public)
   11697              DW$716  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11698                      .dwattr DW$716, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
   11699                      .dwattr DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11700                      .dwattr DW$716, DW_AT_accessibility(DW_ACCESS_public)
   11701                      .dwendtag DW$T$61
   11702              
   11703              
   11704              DW$T$62 .dwtag  DW_TAG_structure_type
   11705                      .dwattr DW$T$62, DW_AT_byte_size(0x02)
   11706              DW$717  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   11707                      .dwattr DW$717, DW_AT_name("reference"), DW_AT_symbol_name("_reference")
   11708                      .dwattr DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11709                      .dwattr DW$717, DW_AT_accessibility(DW_ACCESS_public)
   11710                      .dwendtag DW$T$62
   11711              
   11712              
   11713              DW$T$70 .dwtag  DW_TAG_structure_type
   11714                      .dwattr DW$T$70, DW_AT_byte_size(0x3ce)
   11715              DW$718  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
   11716                      .dwattr DW$718, DW_AT_name("file"), DW_AT_symbol_name("_file")
   11717                      .dwattr DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11718                      .dwattr DW$718, DW_AT_accessibility(DW_ACCESS_public)
   11719              DW$719  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
   11720                      .dwattr DW$719, DW_AT_name("modified"), DW_AT_symbol_name("_modified")
   11721                      .dwattr DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11722                      .dwattr DW$719, DW_AT_accessibility(DW_ACCESS_public)
   11723              DW$720  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
   11724                      .dwattr DW$720, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
   11725                      .dwattr DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11726                      .dwattr DW$720, DW_AT_accessibility(DW_ACCESS_public)
   11727              DW$721  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   11728                      .dwattr DW$721, DW_AT_name("drivenum"), DW_AT_symbol_name("_drivenum")
   11729                      .dwattr DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11730                      .dwattr DW$721, DW_AT_accessibility(DW_ACCESS_public)
   11731              DW$722  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  236

   11732                      .dwattr DW$722, DW_AT_name("abspos"), DW_AT_symbol_name("_abspos")
   11733                      .dwattr DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11734                      .dwattr DW$722, DW_AT_accessibility(DW_ACCESS_public)
   11735              DW$723  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11736                      .dwattr DW$723, DW_AT_name("relpos"), DW_AT_symbol_name("_relpos")
   11737                      .dwattr DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11738                      .dwattr DW$723, DW_AT_accessibility(DW_ACCESS_public)
   11739              DW$724  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11740                      .dwattr DW$724, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
   11741                      .dwattr DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11742                      .dwattr DW$724, DW_AT_accessibility(DW_ACCESS_public)
   11743              DW$725  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   11744                      .dwattr DW$725, DW_AT_name("data"), DW_AT_symbol_name("_data")
   11745                      .dwattr DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11746                      .dwattr DW$725, DW_AT_accessibility(DW_ACCESS_public)
   11747              DW$726  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
   11748                      .dwattr DW$726, DW_AT_name("WrDataCache"), DW_AT_symbol_name("_WrDataCache")
   11749                      .dwattr DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
   11750                      .dwattr DW$726, DW_AT_accessibility(DW_ACCESS_public)
   11751              DW$727  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11752                      .dwattr DW$727, DW_AT_name("startcluster"), DW_AT_symbol_name("_startcluster")
   11753                      .dwattr DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x392]
   11754                      .dwattr DW$727, DW_AT_accessibility(DW_ACCESS_public)
   11755              DW$728  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
   11756                      .dwattr DW$728, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
   11757                      .dwattr DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x394]
   11758                      .dwattr DW$728, DW_AT_accessibility(DW_ACCESS_public)
   11759              DW$729  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
   11760                      .dwattr DW$729, DW_AT_name("dirpos"), DW_AT_symbol_name("_dirpos")
   11761                      .dwattr DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a0]
   11762                      .dwattr DW$729, DW_AT_accessibility(DW_ACCESS_public)
   11763              DW$730  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
   11764                      .dwattr DW$730, DW_AT_name("seekpos"), DW_AT_symbol_name("_seekpos")
   11765                      .dwattr DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x3ac]
   11766                      .dwattr DW$730, DW_AT_accessibility(DW_ACCESS_public)
   11767              DW$731  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
   11768                      .dwattr DW$731, DW_AT_name("seekprev"), DW_AT_symbol_name("_seekprev")
   11769                      .dwattr DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x3bc]
   11770                      .dwattr DW$731, DW_AT_accessibility(DW_ACCESS_public)
   11771              DW$732  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
   11772                      .dwattr DW$732, DW_AT_name("seekshift"), DW_AT_symbol_name("_seekshift")
   11773                      .dwattr DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x3cc]
   11774                      .dwattr DW$732, DW_AT_accessibility(DW_ACCESS_public)
   11775                      .dwendtag DW$T$70
   11776              
   11777              
   11778              DW$T$77 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$76)
   11779                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
   11780                      .dwattr DW$T$77, DW_AT_byte_size(0x3ce)
   11781              DW$733  .dwtag  DW_TAG_subrange_type
   11782                      .dwattr DW$733, DW_AT_upper_bound(0x00)
   11783                      .dwendtag DW$T$77
   11784              
   11785              
   11786              DW$T$72 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  237

   11787                      .dwattr DW$T$72, DW_AT_byte_size(0x20)
   11788              DW$734  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
   11789                      .dwattr DW$734, DW_AT_name("name"), DW_AT_symbol_name("_name")
   11790                      .dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11791                      .dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
   11792              DW$735  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   11793                      .dwattr DW$735, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
   11794                      .dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11795                      .dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
   11796              DW$736  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11797                      .dwattr DW$736, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
   11798                      .dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11799                      .dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
   11800              DW$737  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11801                      .dwattr DW$737, DW_AT_name("ntres"), DW_AT_symbol_name("_ntres")
   11802                      .dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11803                      .dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
   11804              DW$738  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11805                      .dwattr DW$738, DW_AT_name("crttimetenth"), DW_AT_symbol_name("_crttimetenth")
   11806                      .dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11807                      .dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
   11808              DW$739  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   11809                      .dwattr DW$739, DW_AT_name("crttime"), DW_AT_symbol_name("_crttime")
   11810                      .dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11811                      .dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
   11812              DW$740  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   11813                      .dwattr DW$740, DW_AT_name("crtdate"), DW_AT_symbol_name("_crtdate")
   11814                      .dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11815                      .dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
   11816              DW$741  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   11817                      .dwattr DW$741, DW_AT_name("lastaccessdate"), DW_AT_symbol_name("_lastaccessdate")
   11818                      .dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11819                      .dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
   11820              DW$742  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   11821                      .dwattr DW$742, DW_AT_name("clusterhi"), DW_AT_symbol_name("_clusterhi")
   11822                      .dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11823                      .dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
   11824              DW$743  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   11825                      .dwattr DW$743, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
   11826                      .dwattr DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11827                      .dwattr DW$743, DW_AT_accessibility(DW_ACCESS_public)
   11828              DW$744  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   11829                      .dwattr DW$744, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
   11830                      .dwattr DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11831                      .dwattr DW$744, DW_AT_accessibility(DW_ACCESS_public)
   11832              DW$745  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   11833                      .dwattr DW$745, DW_AT_name("clusterlo"), DW_AT_symbol_name("_clusterlo")
   11834                      .dwattr DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11835                      .dwattr DW$745, DW_AT_accessibility(DW_ACCESS_public)
   11836              DW$746  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
   11837                      .dwattr DW$746, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
   11838                      .dwattr DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11839                      .dwattr DW$746, DW_AT_accessibility(DW_ACCESS_public)
   11840                      .dwendtag DW$T$72
   11841              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  238

   11842              
   11843              DW$T$73 .dwtag  DW_TAG_structure_type
   11844                      .dwattr DW$T$73, DW_AT_byte_size(0x10)
   11845              DW$747  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11846                      .dwattr DW$747, DW_AT_name("total"), DW_AT_symbol_name("_total")
   11847                      .dwattr DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11848                      .dwattr DW$747, DW_AT_accessibility(DW_ACCESS_public)
   11849              DW$748  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11850                      .dwattr DW$748, DW_AT_name("free"), DW_AT_symbol_name("_free")
   11851                      .dwattr DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11852                      .dwattr DW$748, DW_AT_accessibility(DW_ACCESS_public)
   11853              DW$749  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11854                      .dwattr DW$749, DW_AT_name("used"), DW_AT_symbol_name("_used")
   11855                      .dwattr DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11856                      .dwattr DW$749, DW_AT_accessibility(DW_ACCESS_public)
   11857              DW$750  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11858                      .dwattr DW$750, DW_AT_name("bad"), DW_AT_symbol_name("_bad")
   11859                      .dwattr DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11860                      .dwattr DW$750, DW_AT_accessibility(DW_ACCESS_public)
   11861              DW$751  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11862                      .dwattr DW$751, DW_AT_name("total_high"), DW_AT_symbol_name("_total_high")
   11863                      .dwattr DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11864                      .dwattr DW$751, DW_AT_accessibility(DW_ACCESS_public)
   11865              DW$752  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11866                      .dwattr DW$752, DW_AT_name("free_high"), DW_AT_symbol_name("_free_high")
   11867                      .dwattr DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11868                      .dwattr DW$752, DW_AT_accessibility(DW_ACCESS_public)
   11869              DW$753  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11870                      .dwattr DW$753, DW_AT_name("used_high"), DW_AT_symbol_name("_used_high")
   11871                      .dwattr DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11872                      .dwattr DW$753, DW_AT_accessibility(DW_ACCESS_public)
   11873              DW$754  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11874                      .dwattr DW$754, DW_AT_name("bad_high"), DW_AT_symbol_name("_bad_high")
   11875                      .dwattr DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11876                      .dwattr DW$754, DW_AT_accessibility(DW_ACCESS_public)
   11877                      .dwendtag DW$T$73
   11878              
   11879              DW$T$301        .dwtag  DW_TAG_typedef, DW_AT_name("t_FAT32_CS"), DW_AT_type(*DW$T$79)
   11880                      .dwattr DW$T$301, DW_AT_language(DW_LANG_C)
   11881              
   11882              DW$T$19 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
   11883                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
   11884                      .dwattr DW$T$19, DW_AT_byte_size(0x03)
   11885              DW$755  .dwtag  DW_TAG_subrange_type
   11886                      .dwattr DW$755, DW_AT_upper_bound(0x02)
   11887                      .dwendtag DW$T$19
   11888              
   11889              
   11890              DW$T$20 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
   11891                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
   11892                      .dwattr DW$T$20, DW_AT_byte_size(0x08)
   11893              DW$756  .dwtag  DW_TAG_subrange_type
   11894                      .dwattr DW$756, DW_AT_upper_bound(0x07)
   11895                      .dwendtag DW$T$20
   11896              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  239

   11897              
   11898              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
   11899                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
   11900                      .dwattr DW$T$21, DW_AT_byte_size(0x0c)
   11901              DW$757  .dwtag  DW_TAG_subrange_type
   11902                      .dwattr DW$757, DW_AT_upper_bound(0x0b)
   11903                      .dwendtag DW$T$21
   11904              
   11905              
   11906              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
   11907                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
   11908                      .dwattr DW$T$22, DW_AT_byte_size(0x0b)
   11909              DW$758  .dwtag  DW_TAG_subrange_type
   11910                      .dwattr DW$758, DW_AT_upper_bound(0x0a)
   11911                      .dwendtag DW$T$22
   11912              
   11913              
   11914              DW$T$23 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
   11915                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
   11916                      .dwattr DW$T$23, DW_AT_byte_size(0x02)
   11917              DW$759  .dwtag  DW_TAG_subrange_type
   11918                      .dwattr DW$759, DW_AT_upper_bound(0x01)
   11919                      .dwendtag DW$T$23
   11920              
   11921              
   11922              DW$T$71 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
   11923                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
   11924                      .dwattr DW$T$71, DW_AT_byte_size(0x04)
   11925              DW$760  .dwtag  DW_TAG_subrange_type
   11926                      .dwattr DW$760, DW_AT_upper_bound(0x03)
   11927                      .dwendtag DW$T$71
   11928              
   11929              
   11930              DW$T$69 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
   11931                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
   11932                      .dwattr DW$T$69, DW_AT_byte_size(0x10)
   11933              DW$761  .dwtag  DW_TAG_subrange_type
   11934                      .dwattr DW$761, DW_AT_upper_bound(0x07)
   11935                      .dwendtag DW$T$69
   11936              
   11937              DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("F_SECTOR"), DW_AT_type(*DW$T$25)
   11938                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
   11939              DW$T$51 .dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$46)
   11940                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
   11941              DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("F_CLSPACE"), DW_AT_type(*DW$T$47)
   11942                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
   11943              
   11944              DW$T$58 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$57)
   11945                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
   11946                      .dwattr DW$T$58, DW_AT_byte_size(0x14)
   11947              DW$762  .dwtag  DW_TAG_subrange_type
   11948                      .dwattr DW$762, DW_AT_upper_bound(0x00)
   11949                      .dwendtag DW$T$58
   11950              
   11951              DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("t_WrDataCache"), DW_AT_type(*DW$T$66)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  240

   11952                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
   11953              
   11954              DW$T$79 .dwtag  DW_TAG_structure_type
   11955                      .dwattr DW$T$79, DW_AT_byte_size(0x04)
   11956              DW$763  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11957                      .dwattr DW$763, DW_AT_name("max_sectors"), DW_AT_symbol_name("_max_sectors")
   11958                      .dwattr DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11959                      .dwattr DW$763, DW_AT_accessibility(DW_ACCESS_public)
   11960              DW$764  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   11961                      .dwattr DW$764, DW_AT_name("sector_per_cluster"), DW_AT_symbol_name("_sector_per_cluster")
   11962                      .dwattr DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11963                      .dwattr DW$764, DW_AT_accessibility(DW_ACCESS_public)
   11964                      .dwendtag DW$T$79
   11965              
   11966              
   11967              DW$T$25 .dwtag  DW_TAG_structure_type
   11968                      .dwattr DW$T$25, DW_AT_byte_size(0x04)
   11969              DW$765  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11970                      .dwattr DW$765, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
   11971                      .dwattr DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11972                      .dwattr DW$765, DW_AT_accessibility(DW_ACCESS_public)
   11973              DW$766  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   11974                      .dwattr DW$766, DW_AT_name("num"), DW_AT_symbol_name("_num")
   11975                      .dwattr DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11976                      .dwattr DW$766, DW_AT_accessibility(DW_ACCESS_public)
   11977                      .dwendtag DW$T$25
   11978              
   11979              
   11980              DW$T$46 .dwtag  DW_TAG_structure_type
   11981                      .dwattr DW$T$46, DW_AT_byte_size(0x10)
   11982              DW$767  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
   11983                      .dwattr DW$767, DW_AT_name("writesector"), DW_AT_symbol_name("_writesector")
   11984                      .dwattr DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11985                      .dwattr DW$767, DW_AT_accessibility(DW_ACCESS_public)
   11986              DW$768  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
   11987                      .dwattr DW$768, DW_AT_name("writemultiplesector"), DW_AT_symbol_name("_writemultiplesector")
   11988                      .dwattr DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11989                      .dwattr DW$768, DW_AT_accessibility(DW_ACCESS_public)
   11990              DW$769  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
   11991                      .dwattr DW$769, DW_AT_name("readsector"), DW_AT_symbol_name("_readsector")
   11992                      .dwattr DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11993                      .dwattr DW$769, DW_AT_accessibility(DW_ACCESS_public)
   11994              DW$770  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
   11995                      .dwattr DW$770, DW_AT_name("readmultiplesector"), DW_AT_symbol_name("_readmultiplesector")
   11996                      .dwattr DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11997                      .dwattr DW$770, DW_AT_accessibility(DW_ACCESS_public)
   11998              DW$771  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
   11999                      .dwattr DW$771, DW_AT_name("getphy"), DW_AT_symbol_name("_getphy")
   12000                      .dwattr DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12001                      .dwattr DW$771, DW_AT_accessibility(DW_ACCESS_public)
   12002              DW$772  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
   12003                      .dwattr DW$772, DW_AT_name("getstatus"), DW_AT_symbol_name("_getstatus")
   12004                      .dwattr DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12005                      .dwattr DW$772, DW_AT_accessibility(DW_ACCESS_public)
   12006              DW$773  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  241

   12007                      .dwattr DW$773, DW_AT_name("delfunc"), DW_AT_symbol_name("_delfunc")
   12008                      .dwattr DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12009                      .dwattr DW$773, DW_AT_accessibility(DW_ACCESS_public)
   12010              DW$774  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   12011                      .dwattr DW$774, DW_AT_name("user_ptr"), DW_AT_symbol_name("_user_ptr")
   12012                      .dwattr DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12013                      .dwattr DW$774, DW_AT_accessibility(DW_ACCESS_public)
   12014                      .dwendtag DW$T$46
   12015              
   12016              
   12017              DW$T$47 .dwtag  DW_TAG_structure_type
   12018                      .dwattr DW$T$47, DW_AT_byte_size(0x06)
   12019              DW$775  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   12020                      .dwattr DW$775, DW_AT_name("clfree"), DW_AT_symbol_name("_clfree")
   12021                      .dwattr DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12022                      .dwattr DW$775, DW_AT_accessibility(DW_ACCESS_public)
   12023              DW$776  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   12024                      .dwattr DW$776, DW_AT_name("clused"), DW_AT_symbol_name("_clused")
   12025                      .dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12026                      .dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
   12027              DW$777  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   12028                      .dwattr DW$777, DW_AT_name("clbad"), DW_AT_symbol_name("_clbad")
   12029                      .dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12030                      .dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
   12031                      .dwendtag DW$T$47
   12032              
   12033              
   12034              DW$T$57 .dwtag  DW_TAG_structure_type
   12035                      .dwattr DW$T$57, DW_AT_byte_size(0x14)
   12036              DW$778  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
   12037                      .dwattr DW$778, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
   12038                      .dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12039                      .dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
   12040                      .dwendtag DW$T$57
   12041              
   12042              
   12043              DW$T$66 .dwtag  DW_TAG_structure_type
   12044                      .dwattr DW$T$66, DW_AT_byte_size(0x186)
   12045              DW$779  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12046                      .dwattr DW$779, DW_AT_name("N"), DW_AT_symbol_name("_N")
   12047                      .dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12048                      .dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
   12049              DW$780  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
   12050                      .dwattr DW$780, DW_AT_name("ptr"), DW_AT_symbol_name("_ptr")
   12051                      .dwattr DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12052                      .dwattr DW$780, DW_AT_accessibility(DW_ACCESS_public)
   12053              DW$781  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
   12054                      .dwattr DW$781, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
   12055                      .dwattr DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12056                      .dwattr DW$781, DW_AT_accessibility(DW_ACCESS_public)
   12057              DW$782  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
   12058                      .dwattr DW$782, DW_AT_name("posbuf"), DW_AT_symbol_name("_posbuf")
   12059                      .dwattr DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12060                      .dwattr DW$782, DW_AT_accessibility(DW_ACCESS_public)
   12061                      .dwendtag DW$T$66
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:08 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
common.asm                                                           PAGE  242

   12062              
   12063              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("F_WRITESECTOR"), DW_AT_type(*DW$T$28)
   12064                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
   12065              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("F_READSECTOR"), DW_AT_type(*DW$T$28)
   12066                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
   12067              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("F_WRITEMULTIPLESECTOR"), DW_AT_type(*DW$T$31)
   12068                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
   12069              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("F_READMULTIPLESECTOR"), DW_AT_type(*DW$T$31)
   12070                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
   12071              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("F_GETPHY"), DW_AT_type(*DW$T$38)
   12072                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
   12073              DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("F_DELFUNC"), DW_AT_type(*DW$T$44)
   12074                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
   12075              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("F_GETSTATUS"), DW_AT_type(*DW$T$41)
   12076                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
   12077              
   12078              DW$T$56 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$52)
   12079                      .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
   12080                      .dwattr DW$T$56, DW_AT_byte_size(0x14)
   12081              DW$783  .dwtag  DW_TAG_subrange_type
   12082                      .dwattr DW$783, DW_AT_upper_bound(0x13)
   12083                      .dwendtag DW$T$56
   12084              
   12085              
   12086              DW$T$65 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$63)
   12087                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
   12088                      .dwattr DW$T$65, DW_AT_byte_size(0x180)
   12089              DW$784  .dwtag  DW_TAG_subrange_type
   12090                      .dwattr DW$784, DW_AT_upper_bound(0x1f)
   12091                      .dwendtag DW$T$65
   12092              
   12093              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
   12094                      .dwattr DW$T$28, DW_AT_address_class(0x16)
   12095              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
   12096                      .dwattr DW$T$31, DW_AT_address_class(0x16)
   12097              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
   12098                      .dwattr DW$T$38, DW_AT_address_class(0x16)
   12099              DW$T$44 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
   12100                      .dwattr DW$T$44, DW_AT_address_class(0x16)
   12101              DW$T$41 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$40)
   12102                      .dwattr DW$T$41, DW_AT_address_class(0x16)
   12103              
   12104              DW$T$27 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
   12105                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
   12106              DW$785  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
   12107              DW$786  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
   12108              DW$787  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
   12109                      .dwendtag DW$T$27
   12110              
   12111              
   12112              DW$T$30 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
