TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:09 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("core.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1809              
    1810              
    1811              DW$T$79 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1812                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    1813              
    1814              DW$T$81 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1815                      .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    1816              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1817                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1818                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1819              DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
    1820                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    1821              DW$137  .dwtag  DW_TAG_far_type
    1822                      .dwattr DW$137, DW_AT_type(*DW$T$99)
    1823              DW$T$100        .dwtag  DW_TAG_volatile_type
    1824                      .dwattr DW$T$100, DW_AT_type(*DW$137)
    1825              DW$T$102        .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$20)
    1826                      .dwattr DW$T$102, DW_AT_language(DW_LANG_C)
    1827              DW$138  .dwtag  DW_TAG_far_type
    1828                      .dwattr DW$138, DW_AT_type(*DW$T$103)
    1829              DW$T$104        .dwtag  DW_TAG_volatile_type
    1830                      .dwattr DW$T$104, DW_AT_type(*DW$138)
    1831              DW$T$106        .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$25)
    1832                      .dwattr DW$T$106, DW_AT_language(DW_LANG_C)
    1833              DW$T$107        .dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$27)
    1834                      .dwattr DW$T$107, DW_AT_language(DW_LANG_C)
    1835              DW$139  .dwtag  DW_TAG_far_type
    1836                      .dwattr DW$139, DW_AT_type(*DW$T$108)
    1837              DW$T$109        .dwtag  DW_TAG_volatile_type
    1838                      .dwattr DW$T$109, DW_AT_type(*DW$139)
    1839              DW$T$112        .dwtag  DW_TAG_typedef, DW_AT_name("reprogramstruct"), DW_AT_type(*DW$T$41)
    1840                      .dwattr DW$T$112, DW_AT_language(DW_LANG_C)
    1841              DW$140  .dwtag  DW_TAG_far_type
    1842                      .dwattr DW$140, DW_AT_type(*DW$T$113)
    1843              DW$T$114        .dwtag  DW_TAG_volatile_type
    1844                      .dwattr DW$T$114, DW_AT_type(*DW$140)
    1845              DW$141  .dwtag  DW_TAG_far_type
    1846                      .dwattr DW$141, DW_AT_type(*DW$T$116)
    1847              DW$T$117        .dwtag  DW_TAG_volatile_type
    1848                      .dwattr DW$T$117, DW_AT_type(*DW$141)
    1849              DW$142  .dwtag  DW_TAG_far_type
    1850                      .dwattr DW$142, DW_AT_type(*DW$T$119)
    1851              DW$T$120        .dwtag  DW_TAG_volatile_type
    1852                      .dwattr DW$T$120, DW_AT_type(*DW$142)
    1853              DW$143  .dwtag  DW_TAG_far_type
    1854                      .dwattr DW$143, DW_AT_type(*DW$T$123)
    1855              DW$T$124        .dwtag  DW_TAG_volatile_type
    1856                      .dwattr DW$T$124, DW_AT_type(*DW$143)
    1857              DW$144  .dwtag  DW_TAG_far_type
    1858                      .dwattr DW$144, DW_AT_type(*DW$T$126)
    1859              DW$T$127        .dwtag  DW_TAG_volatile_type
    1860                      .dwattr DW$T$127, DW_AT_type(*DW$144)
    1861              DW$145  .dwtag  DW_TAG_far_type
    1862                      .dwattr DW$145, DW_AT_type(*DW$T$129)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   42

    1863              DW$T$130        .dwtag  DW_TAG_volatile_type
    1864                      .dwattr DW$T$130, DW_AT_type(*DW$145)
    1865              DW$T$66 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$65)
    1866                      .dwattr DW$T$66, DW_AT_address_class(0x16)
    1867              DW$T$76 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$75)
    1868                      .dwattr DW$T$76, DW_AT_address_class(0x16)
    1869              
    1870              DW$T$132        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$65)
    1871                      .dwattr DW$T$132, DW_AT_language(DW_LANG_C)
    1872                      .dwattr DW$T$132, DW_AT_byte_size(0x64)
    1873              DW$146  .dwtag  DW_TAG_subrange_type
    1874                      .dwattr DW$146, DW_AT_upper_bound(0x63)
    1875                      .dwendtag DW$T$132
    1876              
    1877              DW$147  .dwtag  DW_TAG_far_type
    1878                      .dwattr DW$147, DW_AT_type(*DW$T$135)
    1879              DW$T$136        .dwtag  DW_TAG_volatile_type
    1880                      .dwattr DW$T$136, DW_AT_type(*DW$147)
    1881              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1882                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1883                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1884              DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("uint32"), DW_AT_type(*DW$T$13)
    1885                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    1886              
    1887              DW$T$20 .dwtag  DW_TAG_structure_type
    1888                      .dwattr DW$T$20, DW_AT_name("tag_settingsstruct")
    1889                      .dwattr DW$T$20, DW_AT_byte_size(0x24)
    1890              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1891                      .dwattr DW$148, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    1892                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1894              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1895                      .dwattr DW$149, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    1896                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1897                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1898              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1899                      .dwattr DW$150, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    1900                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1901                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1902              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1903                      .dwattr DW$151, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    1904                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1905                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1906              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1907                      .dwattr DW$152, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    1908                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1909                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1910              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1911                      .dwattr DW$153, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    1912                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1913                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1914              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1915                      .dwattr DW$154, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    1916                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1917                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   43

    1918              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1919                      .dwattr DW$155, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    1920                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1921                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1922              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1923                      .dwattr DW$156, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    1924                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1925                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1926              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1927                      .dwattr DW$157, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    1928                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1929                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1930              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1931                      .dwattr DW$158, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    1932                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1933                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1934              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1935                      .dwattr DW$159, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    1936                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1937                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1938              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1939                      .dwattr DW$160, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    1940                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1941                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1942              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1943                      .dwattr DW$161, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    1944                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1945                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1946              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1947                      .dwattr DW$162, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    1948                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1949                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1950              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1951                      .dwattr DW$163, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    1952                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1953                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1954              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1955                      .dwattr DW$164, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    1956                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1957                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1958              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1959                      .dwattr DW$165, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    1960                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1961                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1962              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1963                      .dwattr DW$166, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    1964                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1965                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1966              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1967                      .dwattr DW$167, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    1968                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1969                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1970              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1971                      .dwattr DW$168, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    1972                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   44

    1973                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1974              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1975                      .dwattr DW$169, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    1976                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1977                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1978              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1979                      .dwattr DW$170, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    1980                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1981                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1982              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1983                      .dwattr DW$171, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    1984                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1985                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1986              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1987                      .dwattr DW$172, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    1988                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1989                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1990              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1991                      .dwattr DW$173, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    1992                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1993                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1994              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1995                      .dwattr DW$174, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    1996                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1997                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1998              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1999                      .dwattr DW$175, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2000                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2001                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2002              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2003                      .dwattr DW$176, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2004                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2005                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2006              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2007                      .dwattr DW$177, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    2008                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2009                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2010              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2011                      .dwattr DW$178, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    2012                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2013                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2014              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2015                      .dwattr DW$179, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    2016                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2017                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2018              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2019                      .dwattr DW$180, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    2020                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2021                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2022              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2023                      .dwattr DW$181, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    2024                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2025                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2026              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2027                      .dwattr DW$182, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   45

    2028                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2029                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2030                      .dwendtag DW$T$20
    2031              
    2032              DW$T$103        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$22)
    2033                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    2034              
    2035              DW$T$25 .dwtag  DW_TAG_structure_type
    2036                      .dwattr DW$T$25, DW_AT_name("tag_allsensorstruct")
    2037                      .dwattr DW$T$25, DW_AT_byte_size(0x2d)
    2038              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2039                      .dwattr DW$183, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    2040                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2042              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2043                      .dwattr DW$184, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    2044                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2045                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2046              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2047                      .dwattr DW$185, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    2048                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2049                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2050              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2051                      .dwattr DW$186, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    2052                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2053                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2054              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2055                      .dwattr DW$187, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    2056                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2057                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2058              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2059                      .dwattr DW$188, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    2060                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2061                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2062              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2063                      .dwattr DW$189, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    2064                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2065                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2066              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2067                      .dwattr DW$190, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    2068                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2069                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2070              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2071                      .dwattr DW$191, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    2072                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2073                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2074              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2075                      .dwattr DW$192, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    2076                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2077                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2078              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2079                      .dwattr DW$193, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2080                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2081                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2082              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   46

    2083                      .dwattr DW$194, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    2084                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2085                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2086              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2087                      .dwattr DW$195, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    2088                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2089                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2090              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2091                      .dwattr DW$196, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    2092                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2093                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2094              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2095                      .dwattr DW$197, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2096                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2097                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2098              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2099                      .dwattr DW$198, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2100                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2101                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2102              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2103                      .dwattr DW$199, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    2104                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2105                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2106              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2107                      .dwattr DW$200, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    2108                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2109                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2110              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2111                      .dwattr DW$201, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    2112                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2113                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2114              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2115                      .dwattr DW$202, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    2116                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2117                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2118              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2119                      .dwattr DW$203, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    2120                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2121                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2122              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2123                      .dwattr DW$204, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    2124                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2125                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2126              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2127                      .dwattr DW$205, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    2128                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2129                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2130              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2131                      .dwattr DW$206, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    2132                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2133                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2134              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2135                      .dwattr DW$207, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    2136                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2137                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   47

    2138              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2139                      .dwattr DW$208, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    2140                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2141                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2142              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2143                      .dwattr DW$209, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    2144                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2145                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2146              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2147                      .dwattr DW$210, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    2148                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2149                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2150              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2151                      .dwattr DW$211, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    2152                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2153                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2154              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2155                      .dwattr DW$212, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2156                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2157                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2158              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2159                      .dwattr DW$213, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    2160                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2161                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2162              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2163                      .dwattr DW$214, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    2164                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2165                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2166                      .dwendtag DW$T$25
    2167              
    2168              
    2169              DW$T$27 .dwtag  DW_TAG_structure_type
    2170                      .dwattr DW$T$27, DW_AT_name("tag_sdsettingsstruct")
    2171                      .dwattr DW$T$27, DW_AT_byte_size(0x04)
    2172              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2173                      .dwattr DW$215, DW_AT_name("present"), DW_AT_symbol_name("_present")
    2174                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2175                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2176              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2177                      .dwattr DW$216, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
    2178                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2179                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2180              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2181                      .dwattr DW$217, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
    2182                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2183                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2184              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2185                      .dwattr DW$218, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
    2186                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2187                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2188                      .dwendtag DW$T$27
    2189              
    2190              DW$T$108        .dwtag  DW_TAG_typedef, DW_AT_name("inputstruct"), DW_AT_type(*DW$T$39)
    2191                      .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
    2192              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   48

    2193              DW$T$41 .dwtag  DW_TAG_structure_type
    2194                      .dwattr DW$T$41, DW_AT_name("tag_reprogramstruct")
    2195                      .dwattr DW$T$41, DW_AT_byte_size(0x10)
    2196              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    2197                      .dwattr DW$219, DW_AT_name("spi"), DW_AT_symbol_name("_spi")
    2198                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2199                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2200              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2201                      .dwattr DW$220, DW_AT_name("programkey"), DW_AT_symbol_name("_programkey")
    2202                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2203                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2204              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2205                      .dwattr DW$221, DW_AT_name("reprogramnow"), DW_AT_symbol_name("_reprogramnow")
    2206                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2207                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2208              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2209                      .dwattr DW$222, DW_AT_name("slavecmdok"), DW_AT_symbol_name("_slavecmdok")
    2210                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2211                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2212              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2213                      .dwattr DW$223, DW_AT_name("slavestatus"), DW_AT_symbol_name("_slavestatus")
    2214                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2215                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2216              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2217                      .dwattr DW$224, DW_AT_name("slavetx"), DW_AT_symbol_name("_slavetx")
    2218                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2219                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2220              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2221                      .dwattr DW$225, DW_AT_name("slaverx"), DW_AT_symbol_name("_slaverx")
    2222                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2223                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2224              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2225                      .dwattr DW$226, DW_AT_name("slaveset"), DW_AT_symbol_name("_slaveset")
    2226                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2227                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2228                      .dwendtag DW$T$41
    2229              
    2230              DW$T$113        .dwtag  DW_TAG_typedef, DW_AT_name("gpaport"), DW_AT_type(*DW$T$44)
    2231                      .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
    2232              DW$T$116        .dwtag  DW_TAG_typedef, DW_AT_name("gpbport"), DW_AT_type(*DW$T$47)
    2233                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
    2234              DW$T$119        .dwtag  DW_TAG_typedef, DW_AT_name("gpdport"), DW_AT_type(*DW$T$50)
    2235                      .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
    2236              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("gpeport"), DW_AT_type(*DW$T$53)
    2237                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    2238              DW$T$126        .dwtag  DW_TAG_typedef, DW_AT_name("gpfport"), DW_AT_type(*DW$T$56)
    2239                      .dwattr DW$T$126, DW_AT_language(DW_LANG_C)
    2240              DW$T$129        .dwtag  DW_TAG_typedef, DW_AT_name("gpgport"), DW_AT_type(*DW$T$59)
    2241                      .dwattr DW$T$129, DW_AT_language(DW_LANG_C)
    2242              DW$T$65 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    2243                      .dwattr DW$T$65, DW_AT_encoding(DW_ATE_signed_char)
    2244                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
    2245              DW$227  .dwtag  DW_TAG_far_type
    2246                      .dwattr DW$227, DW_AT_type(*DW$T$65)
    2247              DW$T$75 .dwtag  DW_TAG_const_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   49

    2248                      .dwattr DW$T$75, DW_AT_type(*DW$227)
    2249              DW$T$135        .dwtag  DW_TAG_typedef, DW_AT_name("ISR_LIST"), DW_AT_type(*DW$T$134)
    2250                      .dwattr DW$T$135, DW_AT_language(DW_LANG_C)
    2251              
    2252              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2253                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2254                      .dwattr DW$T$21, DW_AT_byte_size(0x0e)
    2255              DW$228  .dwtag  DW_TAG_subrange_type
    2256                      .dwattr DW$228, DW_AT_upper_bound(0x0d)
    2257                      .dwendtag DW$T$21
    2258              
    2259              
    2260              DW$T$19 .dwtag  DW_TAG_structure_type
    2261                      .dwattr DW$T$19, DW_AT_byte_size(0x02)
    2262              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2263                      .dwattr DW$229, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    2264                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2265                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2266              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2267                      .dwattr DW$230, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2268                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2269                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2270                      .dwendtag DW$T$19
    2271              
    2272              
    2273              DW$T$22 .dwtag  DW_TAG_structure_type
    2274                      .dwattr DW$T$22, DW_AT_name("tag_timers")
    2275                      .dwattr DW$T$22, DW_AT_byte_size(0x4c)
    2276              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2277                      .dwattr DW$231, DW_AT_name("update"), DW_AT_symbol_name("_update")
    2278                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2279                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2280              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2281                      .dwattr DW$232, DW_AT_name("general"), DW_AT_symbol_name("_general")
    2282                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2283                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2284              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2285                      .dwattr DW$233, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    2286                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2287                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2288              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2289                      .dwattr DW$234, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    2290                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2291                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2292              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2293                      .dwattr DW$235, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    2294                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2295                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2296              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2297                      .dwattr DW$236, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    2298                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2299                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2300              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2301                      .dwattr DW$237, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    2302                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   50

    2303                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2304              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2305                      .dwattr DW$238, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    2306                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2307                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2308              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2309                      .dwattr DW$239, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    2310                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2311                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2312              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2313                      .dwattr DW$240, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    2314                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2315                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2316              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2317                      .dwattr DW$241, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    2318                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2319                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2320              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2321                      .dwattr DW$242, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    2322                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2323                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2324              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2325                      .dwattr DW$243, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    2326                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2327                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2328              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2329                      .dwattr DW$244, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    2330                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2331                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2332              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2333                      .dwattr DW$245, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    2334                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2335                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2336              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2337                      .dwattr DW$246, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2338                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2339                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2340              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2341                      .dwattr DW$247, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    2342                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2343                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2344              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2345                      .dwattr DW$248, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    2346                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2347                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2348              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2349                      .dwattr DW$249, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    2350                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2351                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2352              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2353                      .dwattr DW$250, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    2354                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2355                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2356              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2357                      .dwattr DW$251, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   51

    2358                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2359                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2360              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2361                      .dwattr DW$252, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    2362                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2363                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2364              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2365                      .dwattr DW$253, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    2366                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2367                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2368              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2369                      .dwattr DW$254, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    2370                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2371                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2372              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2373                      .dwattr DW$255, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    2374                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2375                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2376              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2377                      .dwattr DW$256, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    2378                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2379                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2380              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2381                      .dwattr DW$257, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    2382                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2383                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2384              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2385                      .dwattr DW$258, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    2386                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2387                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2388              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2389                      .dwattr DW$259, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    2390                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2391                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2392              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2393                      .dwattr DW$260, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    2394                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2395                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2396              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2397                      .dwattr DW$261, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    2398                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2399                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2400              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2401                      .dwattr DW$262, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    2402                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2403                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2404              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2405                      .dwattr DW$263, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    2406                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    2407                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2408              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2409                      .dwattr DW$264, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    2410                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2411                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2412              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   52

    2413                      .dwattr DW$265, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    2414                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2415                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2416              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2417                      .dwattr DW$266, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    2418                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2419                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2420              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2421                      .dwattr DW$267, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    2422                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2423                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2424              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2425                      .dwattr DW$268, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    2426                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2427                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2428              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2429                      .dwattr DW$269, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    2430                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2431                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2432              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2433                      .dwattr DW$270, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    2434                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2435                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2436              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2437                      .dwattr DW$271, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    2438                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2439                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2440              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2441                      .dwattr DW$272, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    2442                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2443                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2444              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2445                      .dwattr DW$273, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    2446                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2447                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2448                      .dwendtag DW$T$22
    2449              
    2450              
    2451              DW$T$23 .dwtag  DW_TAG_structure_type
    2452                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    2453              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2454                      .dwattr DW$274, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
    2455                      .dwattr DW$274, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2456                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2458              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2459                      .dwattr DW$275, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    2460                      .dwattr DW$275, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2461                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2462                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2463              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2464                      .dwattr DW$276, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
    2465                      .dwattr DW$276, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2466                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   53

    2468              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2469                      .dwattr DW$277, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
    2470                      .dwattr DW$277, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2471                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2473              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2474                      .dwattr DW$278, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    2475                      .dwattr DW$278, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2476                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2477                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2478                      .dwendtag DW$T$23
    2479              
    2480              
    2481              DW$T$24 .dwtag  DW_TAG_structure_type
    2482                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    2483              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2484                      .dwattr DW$279, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
    2485                      .dwattr DW$279, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2486                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2487                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2488              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2489                      .dwattr DW$280, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    2490                      .dwattr DW$280, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    2491                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2492                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2493                      .dwendtag DW$T$24
    2494              
    2495              
    2496              DW$T$26 .dwtag  DW_TAG_structure_type
    2497                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    2498              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2499                      .dwattr DW$281, DW_AT_name("settings"), DW_AT_symbol_name("_settings")
    2500                      .dwattr DW$281, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2501                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2503              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2504                      .dwattr DW$282, DW_AT_name("sensorstatus"), DW_AT_symbol_name("_sensorstatus")
    2505                      .dwattr DW$282, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2506                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2507                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2508              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2509                      .dwattr DW$283, DW_AT_name("offsets"), DW_AT_symbol_name("_offsets")
    2510                      .dwattr DW$283, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2511                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2513              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2514                      .dwattr DW$284, DW_AT_name("mantable"), DW_AT_symbol_name("_mantable")
    2515                      .dwattr DW$284, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2516                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2518              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2519                      .dwattr DW$285, DW_AT_name("calibtd"), DW_AT_symbol_name("_calibtd")
    2520                      .dwattr DW$285, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2521                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2522                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   54

    2523              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2524                      .dwattr DW$286, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    2525                      .dwattr DW$286, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2526                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2527                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2528              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2529                      .dwattr DW$287, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    2530                      .dwattr DW$287, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2531                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2533              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2534                      .dwattr DW$288, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    2535                      .dwattr DW$288, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2536                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2537                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2538              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2539                      .dwattr DW$289, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    2540                      .dwattr DW$289, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2541                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2543              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2544                      .dwattr DW$290, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    2545                      .dwattr DW$290, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2546                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2548              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2549                      .dwattr DW$291, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    2550                      .dwattr DW$291, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2551                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2552                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2553              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2554                      .dwattr DW$292, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    2555                      .dwattr DW$292, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2556                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2558              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2559                      .dwattr DW$293, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    2560                      .dwattr DW$293, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2561                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2563              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2564                      .dwattr DW$294, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    2565                      .dwattr DW$294, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2566                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2567                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2568              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2569                      .dwattr DW$295, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    2570                      .dwattr DW$295, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2571                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2573              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2574                      .dwattr DW$296, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    2575                      .dwattr DW$296, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2576                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   55

    2578                      .dwendtag DW$T$26
    2579              
    2580              
    2581              DW$T$39 .dwtag  DW_TAG_structure_type
    2582                      .dwattr DW$T$39, DW_AT_name("tag_inputstruct")
    2583                      .dwattr DW$T$39, DW_AT_byte_size(0xfe)
    2584              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    2585                      .dwattr DW$297, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    2586                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2587                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2588              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2589                      .dwattr DW$298, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
    2590                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2591                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2592              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2593                      .dwattr DW$299, DW_AT_name("rawresults"), DW_AT_symbol_name("_rawresults")
    2594                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2595                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2596              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2597                      .dwattr DW$300, DW_AT_name("amps"), DW_AT_symbol_name("_amps")
    2598                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2599                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2600              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2601                      .dwattr DW$301, DW_AT_name("prtchan"), DW_AT_symbol_name("_prtchan")
    2602                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2603                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2604              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    2605                      .dwattr DW$302, DW_AT_name("analog"), DW_AT_symbol_name("_analog")
    2606                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2607                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2608                      .dwendtag DW$T$39
    2609              
    2610              
    2611              DW$T$40 .dwtag  DW_TAG_structure_type
    2612                      .dwattr DW$T$40, DW_AT_byte_size(0x08)
    2613              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2614                      .dwattr DW$303, DW_AT_name("programgo"), DW_AT_symbol_name("_programgo")
    2615                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2616                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2617              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2618                      .dwattr DW$304, DW_AT_name("status"), DW_AT_symbol_name("_status")
    2619                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2620                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2621              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2622                      .dwattr DW$305, DW_AT_name("erase"), DW_AT_symbol_name("_erase")
    2623                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2624                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2625              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2626                      .dwattr DW$306, DW_AT_name("address"), DW_AT_symbol_name("_address")
    2627                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2628                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2629              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2630                      .dwattr DW$307, DW_AT_name("size"), DW_AT_symbol_name("_size")
    2631                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2632                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   56

    2633                      .dwendtag DW$T$40
    2634              
    2635              
    2636              DW$T$44 .dwtag  DW_TAG_structure_type
    2637                      .dwattr DW$T$44, DW_AT_name("taggpaport")
    2638                      .dwattr DW$T$44, DW_AT_byte_size(0x01)
    2639              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    2640                      .dwattr DW$308, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2641                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2642                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2643                      .dwendtag DW$T$44
    2644              
    2645              
    2646              DW$T$47 .dwtag  DW_TAG_structure_type
    2647                      .dwattr DW$T$47, DW_AT_name("taggpbport")
    2648                      .dwattr DW$T$47, DW_AT_byte_size(0x01)
    2649              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    2650                      .dwattr DW$309, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2651                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2652                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2653                      .dwendtag DW$T$47
    2654              
    2655              
    2656              DW$T$50 .dwtag  DW_TAG_structure_type
    2657                      .dwattr DW$T$50, DW_AT_name("taggpdport")
    2658                      .dwattr DW$T$50, DW_AT_byte_size(0x01)
    2659              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2660                      .dwattr DW$310, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2661                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2662                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2663                      .dwendtag DW$T$50
    2664              
    2665              
    2666              DW$T$53 .dwtag  DW_TAG_structure_type
    2667                      .dwattr DW$T$53, DW_AT_name("taggpeport")
    2668                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
    2669              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    2670                      .dwattr DW$311, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2671                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2672                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2673                      .dwendtag DW$T$53
    2674              
    2675              
    2676              DW$T$56 .dwtag  DW_TAG_structure_type
    2677                      .dwattr DW$T$56, DW_AT_name("taggpfport")
    2678                      .dwattr DW$T$56, DW_AT_byte_size(0x01)
    2679              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    2680                      .dwattr DW$312, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2681                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2682                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2683                      .dwendtag DW$T$56
    2684              
    2685              
    2686              DW$T$59 .dwtag  DW_TAG_structure_type
    2687                      .dwattr DW$T$59, DW_AT_name("taggpgport")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   57

    2688                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    2689              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    2690                      .dwattr DW$313, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2691                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2692                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2693                      .dwendtag DW$T$59
    2694              
    2695              
    2696              DW$T$134        .dwtag  DW_TAG_enumeration_type
    2697                      .dwattr DW$T$134, DW_AT_byte_size(0x01)
    2698              DW$314  .dwtag  DW_TAG_enumerator, DW_AT_name("NoIsrActive"), DW_AT_const_value(0x00)
    2699              DW$315  .dwtag  DW_TAG_enumerator, DW_AT_name("Isr1Active"), DW_AT_const_value(0x01)
    2700              DW$316  .dwtag  DW_TAG_enumerator, DW_AT_name("Isr13Active"), DW_AT_const_value(0x02)
    2701              DW$317  .dwtag  DW_TAG_enumerator, DW_AT_name("Isr14Active"), DW_AT_const_value(0x03)
    2702                      .dwendtag DW$T$134
    2703              
    2704              
    2705              DW$T$28 .dwtag  DW_TAG_structure_type
    2706                      .dwattr DW$T$28, DW_AT_byte_size(0x39)
    2707              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2708                      .dwattr DW$318, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
    2709                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2710                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2711              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2712                      .dwattr DW$319, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2713                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2714                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2715              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2716                      .dwattr DW$320, DW_AT_name("newrpm"), DW_AT_symbol_name("_newrpm")
    2717                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2718                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2719              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2720                      .dwattr DW$321, DW_AT_name("rpmstart"), DW_AT_symbol_name("_rpmstart")
    2721                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2722                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2723              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2724                      .dwattr DW$322, DW_AT_name("startupcounter"), DW_AT_symbol_name("_startupcounter")
    2725                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2726                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2727                      .dwendtag DW$T$28
    2728              
    2729              
    2730              DW$T$31 .dwtag  DW_TAG_structure_type
    2731                      .dwattr DW$T$31, DW_AT_byte_size(0x2a)
    2732              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2733                      .dwattr DW$323, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2734                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2735                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2736              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    2737                      .dwattr DW$324, DW_AT_name("peakoffset"), DW_AT_symbol_name("_peakoffset")
    2738                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2739                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2740                      .dwendtag DW$T$31
    2741              
    2742              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   58

    2743              DW$T$33 .dwtag  DW_TAG_structure_type
    2744                      .dwattr DW$T$33, DW_AT_byte_size(0x62)
    2745              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2746                      .dwattr DW$325, DW_AT_name("current"), DW_AT_symbol_name("_current")
    2747                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2749              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2750                      .dwattr DW$326, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2751                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2752                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2753              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    2754                      .dwattr DW$327, DW_AT_name("counterA"), DW_AT_symbol_name("_counterA")
    2755                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2756                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2757              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    2758                      .dwattr DW$328, DW_AT_name("counterB"), DW_AT_symbol_name("_counterB")
    2759                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2760                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2761              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2762                      .dwattr DW$329, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2763                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2764                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2765                      .dwendtag DW$T$33
    2766              
    2767              
    2768              DW$T$35 .dwtag  DW_TAG_structure_type
    2769                      .dwattr DW$T$35, DW_AT_byte_size(0x1c)
    2770              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2771                      .dwattr DW$330, DW_AT_name("value"), DW_AT_symbol_name("_value")
    2772                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2773                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2774                      .dwendtag DW$T$35
    2775              
    2776              
    2777              DW$T$38 .dwtag  DW_TAG_structure_type
    2778                      .dwattr DW$T$38, DW_AT_byte_size(0x1a)
    2779              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2780                      .dwattr DW$331, DW_AT_name("value"), DW_AT_symbol_name("_value")
    2781                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2782                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2783              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2784                      .dwattr DW$332, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2785                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2786                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2787              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2788                      .dwattr DW$333, DW_AT_name("scalefactor"), DW_AT_symbol_name("_scalefactor")
    2789                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2790                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2791                      .dwendtag DW$T$38
    2792              
    2793              
    2794              DW$T$43 .dwtag  DW_TAG_union_type
    2795                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    2796              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2797                      .dwattr DW$334, DW_AT_name("port"), DW_AT_symbol_name("_port")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   59

    2798                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2799                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2800              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    2801                      .dwattr DW$335, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2802                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2804                      .dwendtag DW$T$43
    2805              
    2806              
    2807              DW$T$46 .dwtag  DW_TAG_union_type
    2808                      .dwattr DW$T$46, DW_AT_byte_size(0x01)
    2809              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2810                      .dwattr DW$336, DW_AT_name("port"), DW_AT_symbol_name("_port")
    2811                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2813              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    2814                      .dwattr DW$337, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2815                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2816                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2817                      .dwendtag DW$T$46
    2818              
    2819              
    2820              DW$T$49 .dwtag  DW_TAG_union_type
    2821                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
    2822              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2823                      .dwattr DW$338, DW_AT_name("port"), DW_AT_symbol_name("_port")
    2824                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2826              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    2827                      .dwattr DW$339, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2828                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2829                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2830                      .dwendtag DW$T$49
    2831              
    2832              
    2833              DW$T$52 .dwtag  DW_TAG_union_type
    2834                      .dwattr DW$T$52, DW_AT_byte_size(0x01)
    2835              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2836                      .dwattr DW$340, DW_AT_name("port"), DW_AT_symbol_name("_port")
    2837                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2838                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2839              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    2840                      .dwattr DW$341, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2841                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2842                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2843                      .dwendtag DW$T$52
    2844              
    2845              
    2846              DW$T$55 .dwtag  DW_TAG_union_type
    2847                      .dwattr DW$T$55, DW_AT_byte_size(0x01)
    2848              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2849                      .dwattr DW$342, DW_AT_name("port"), DW_AT_symbol_name("_port")
    2850                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2851                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2852              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   60

    2853                      .dwattr DW$343, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2854                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2855                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2856                      .dwendtag DW$T$55
    2857              
    2858              
    2859              DW$T$58 .dwtag  DW_TAG_union_type
    2860                      .dwattr DW$T$58, DW_AT_byte_size(0x01)
    2861              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2862                      .dwattr DW$344, DW_AT_name("port"), DW_AT_symbol_name("_port")
    2863                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2865              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    2866                      .dwattr DW$345, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2867                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2868                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2869                      .dwendtag DW$T$58
    2870              
    2871              
    2872              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    2873                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    2874                      .dwattr DW$T$30, DW_AT_byte_size(0x0e)
    2875              DW$346  .dwtag  DW_TAG_subrange_type
    2876                      .dwattr DW$346, DW_AT_upper_bound(0x0d)
    2877                      .dwendtag DW$T$30
    2878              
    2879              
    2880              DW$T$36 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    2881                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    2882                      .dwattr DW$T$36, DW_AT_byte_size(0x08)
    2883              DW$347  .dwtag  DW_TAG_subrange_type
    2884                      .dwattr DW$347, DW_AT_upper_bound(0x07)
    2885                      .dwendtag DW$T$36
    2886              
    2887              
    2888              DW$T$34 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2889                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    2890                      .dwattr DW$T$34, DW_AT_byte_size(0x1c)
    2891              DW$348  .dwtag  DW_TAG_subrange_type
    2892                      .dwattr DW$348, DW_AT_upper_bound(0x1b)
    2893                      .dwendtag DW$T$34
    2894              
    2895              
    2896              DW$T$32 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
    2897                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    2898                      .dwattr DW$T$32, DW_AT_byte_size(0x1c)
    2899              DW$349  .dwtag  DW_TAG_subrange_type
    2900                      .dwattr DW$349, DW_AT_upper_bound(0x0d)
    2901                      .dwendtag DW$T$32
    2902              
    2903              
    2904              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    2905                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    2906                      .dwattr DW$T$29, DW_AT_byte_size(0x1c)
    2907              DW$350  .dwtag  DW_TAG_subrange_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
core.asm                                                             PAGE   61

    2908                      .dwattr DW$350, DW_AT_upper_bound(0x0d)
    2909                      .dwendtag DW$T$29
    2910              
    2911              
    2912              DW$T$37 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    2913                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    2914                      .dwattr DW$T$37, DW_AT_byte_size(0x10)
    2915              DW$351  .dwtag  DW_TAG_subrange_type
    2916                      .dwattr DW$351, DW_AT_upper_bound(0x07)
    2917                      .dwendtag DW$T$37
    2918              
    2919              
    2920              DW$T$42 .dwtag  DW_TAG_structure_type
    2921                      .dwattr DW$T$42, DW_AT_byte_size(0x01)
    2922              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2923                      .dwattr DW$352, DW_AT_name("anain_select1"), DW_AT_symbol_name("_anain_select1")
    2924                      .dwattr DW$352, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2925                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2926                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2927              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2928                      .dwattr DW$353, DW_AT_name("anain_select2"), DW_AT_symbol_name("_anain_select2")
    2929                      .dwattr DW$353, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2930                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2931                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2932              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2933                      .dwattr DW$354, DW_AT_name("anain_select3"), DW_AT_symbol_name("_anain_select3")
    2934                      .dwattr DW$354, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2935                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2936                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2937              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2938                      .dwattr DW$355, DW_AT_name("program_cs"), DW_AT_symbol_name("_program_cs")
    2939                      .dwattr DW$355, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2940                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2941                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2942              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2943                      .dwattr DW$356, DW_AT_name("com_select"), DW_AT_symbol_name("_com_select")
    2944                      .dwattr DW$356, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2945                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2946                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2947              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2948                      .dwattr DW$357, DW_AT_name("s1"), DW_AT_symbol_name("_s1")
    2949                      .dwattr DW$357, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2950                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2951                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2952              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2953                      .dwattr DW$358, DW_AT_name("s2"), DW_AT_symbol_name("_s2")
    2954                      .dwattr DW$358, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2955                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2956                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2957              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2958                      .dwattr DW$359, DW_AT_name("s3"), DW_AT_symbol_name("_s3")
    2959                      .dwattr DW$359, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2960                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2961                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2962              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:09 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
