TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:11 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("digout.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("CheckBitSet"), DW_AT_symbol_name("_CheckBitSet")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$10)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    1756              DW$130  .dwtag  DW_TAG_subrange_type
    1757                      .dwattr DW$130, DW_AT_upper_bound(0x0d)
    1758                      .dwendtag DW$T$31
    1759              
    1760              
    1761              DW$T$46 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    1762                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    1763                      .dwattr DW$T$46, DW_AT_byte_size(0x02)
    1764              DW$131  .dwtag  DW_TAG_subrange_type
    1765                      .dwattr DW$131, DW_AT_upper_bound(0x01)
    1766                      .dwendtag DW$T$46
    1767              
    1768              
    1769              DW$T$61 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
    1770                      .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    1771              DW$132  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1772              DW$133  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1773                      .dwendtag DW$T$61
    1774              
    1775              DW$T$66 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$65)
    1776                      .dwattr DW$T$66, DW_AT_address_class(0x16)
    1777              
    1778              DW$T$67 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$66)
    1779                      .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    1780              DW$134  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1781                      .dwendtag DW$T$67
    1782              
    1783              
    1784              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$65)
    1785                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1786                      .dwattr DW$T$68, DW_AT_byte_size(0x1c)
    1787              DW$135  .dwtag  DW_TAG_subrange_type
    1788                      .dwattr DW$135, DW_AT_upper_bound(0x1b)
    1789                      .dwendtag DW$T$68
    1790              
    1791              DW$T$73 .dwtag  DW_TAG_typedef, DW_AT_name("waterinoilstruct"), DW_AT_type(*DW$T$22)
    1792                      .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    1793              DW$T$74 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$73)
    1794                      .dwattr DW$T$74, DW_AT_address_class(0x16)
    1795              
    1796              DW$T$75 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$74)
    1797                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
    1798              DW$136  .dwtag  DW_TAG_far_type
    1799                      .dwattr DW$136, DW_AT_type(*DW$T$79)
    1800              DW$T$80 .dwtag  DW_TAG_volatile_type
    1801                      .dwattr DW$T$80, DW_AT_type(*DW$136)
    1802              DW$137  .dwtag  DW_TAG_far_type
    1803                      .dwattr DW$137, DW_AT_type(*DW$T$83)
    1804              DW$T$84 .dwtag  DW_TAG_volatile_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   39

    1805                      .dwattr DW$T$84, DW_AT_type(*DW$137)
    1806              DW$T$87 .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$30)
    1807                      .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    1808              DW$138  .dwtag  DW_TAG_far_type
    1809                      .dwattr DW$138, DW_AT_type(*DW$T$88)
    1810              DW$T$89 .dwtag  DW_TAG_volatile_type
    1811                      .dwattr DW$T$89, DW_AT_type(*DW$138)
    1812              DW$T$91 .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$35)
    1813                      .dwattr DW$T$91, DW_AT_language(DW_LANG_C)
    1814              
    1815              DW$T$93 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$92)
    1816                      .dwattr DW$T$93, DW_AT_language(DW_LANG_C)
    1817                      .dwattr DW$T$93, DW_AT_byte_size(0x38)
    1818              DW$139  .dwtag  DW_TAG_subrange_type
    1819                      .dwattr DW$139, DW_AT_upper_bound(0x0d)
    1820                      .dwendtag DW$T$93
    1821              
    1822              DW$T$96 .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$45)
    1823                      .dwattr DW$T$96, DW_AT_language(DW_LANG_C)
    1824              DW$T$97 .dwtag  DW_TAG_typedef, DW_AT_name("damalarmsstruct"), DW_AT_type(*DW$T$47)
    1825                      .dwattr DW$T$97, DW_AT_language(DW_LANG_C)
    1826              DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("alarmsstruct"), DW_AT_type(*DW$T$48)
    1827                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    1828              DW$T$101        .dwtag  DW_TAG_typedef, DW_AT_name("slemstruct"), DW_AT_type(*DW$T$50)
    1829                      .dwattr DW$T$101, DW_AT_language(DW_LANG_C)
    1830              DW$T$103        .dwtag  DW_TAG_typedef, DW_AT_name("rtcbatstruct"), DW_AT_type(*DW$T$52)
    1831                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    1832              DW$T$104        .dwtag  DW_TAG_typedef, DW_AT_name("digoutstruct"), DW_AT_type(*DW$T$53)
    1833                      .dwattr DW$T$104, DW_AT_language(DW_LANG_C)
    1834              DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("sensoralarmstruct"), DW_AT_type(*DW$T$19)
    1835                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1836              
    1837              DW$T$22 .dwtag  DW_TAG_structure_type
    1838                      .dwattr DW$T$22, DW_AT_name("tag_waterinoilstruct")
    1839                      .dwattr DW$T$22, DW_AT_byte_size(0x0c)
    1840              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1841                      .dwattr DW$140, DW_AT_name("netadd"), DW_AT_symbol_name("_netadd")
    1842                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1844              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1845                      .dwattr DW$141, DW_AT_name("temperature"), DW_AT_symbol_name("_temperature")
    1846                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1847                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1848              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1849                      .dwattr DW$142, DW_AT_name("activity"), DW_AT_symbol_name("_activity")
    1850                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1851                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1852              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1853                      .dwattr DW$143, DW_AT_name("content"), DW_AT_symbol_name("_content")
    1854                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1855                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1856              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1857                      .dwattr DW$144, DW_AT_name("temperature_int"), DW_AT_symbol_name("_temperature_int")
    1858                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1859                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   40

    1860              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1861                      .dwattr DW$145, DW_AT_name("activity_int"), DW_AT_symbol_name("_activity_int")
    1862                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1863                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1864              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1865                      .dwattr DW$146, DW_AT_name("content_int"), DW_AT_symbol_name("_content_int")
    1866                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1867                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1868              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1869                      .dwattr DW$147, DW_AT_name("wioalarms"), DW_AT_symbol_name("_wioalarms")
    1870                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1871                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1872                      .dwendtag DW$T$22
    1873              
    1874              DW$T$79 .dwtag  DW_TAG_typedef, DW_AT_name("gpbport"), DW_AT_type(*DW$T$25)
    1875                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    1876              DW$T$83 .dwtag  DW_TAG_typedef, DW_AT_name("gpfport"), DW_AT_type(*DW$T$28)
    1877                      .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
    1878              
    1879              DW$T$30 .dwtag  DW_TAG_structure_type
    1880                      .dwattr DW$T$30, DW_AT_name("tag_settingsstruct")
    1881                      .dwattr DW$T$30, DW_AT_byte_size(0x24)
    1882              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1883                      .dwattr DW$148, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    1884                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1885                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1886              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1887                      .dwattr DW$149, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    1888                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1889                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1890              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1891                      .dwattr DW$150, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    1892                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1893                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1894              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1895                      .dwattr DW$151, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    1896                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1897                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1898              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1899                      .dwattr DW$152, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    1900                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1901                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1902              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1903                      .dwattr DW$153, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    1904                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1905                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1906              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1907                      .dwattr DW$154, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    1908                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1909                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1910              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1911                      .dwattr DW$155, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    1912                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1913                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1914              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   41

    1915                      .dwattr DW$156, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    1916                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1917                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1918              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1919                      .dwattr DW$157, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    1920                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1921                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1922              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1923                      .dwattr DW$158, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    1924                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1925                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1926              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1927                      .dwattr DW$159, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    1928                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1929                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1930              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1931                      .dwattr DW$160, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    1932                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1933                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1934              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1935                      .dwattr DW$161, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    1936                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1937                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1938              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1939                      .dwattr DW$162, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    1940                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1941                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1942              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1943                      .dwattr DW$163, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    1944                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1945                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1946              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1947                      .dwattr DW$164, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    1948                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1949                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1950              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1951                      .dwattr DW$165, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    1952                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1953                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1954              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1955                      .dwattr DW$166, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    1956                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1957                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1958              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1959                      .dwattr DW$167, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    1960                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1961                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1962              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1963                      .dwattr DW$168, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    1964                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1965                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1966              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1967                      .dwattr DW$169, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    1968                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1969                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   42

    1970              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1971                      .dwattr DW$170, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    1972                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1973                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1974              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1975                      .dwattr DW$171, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    1976                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1977                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1978              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1979                      .dwattr DW$172, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    1980                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1981                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1982              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1983                      .dwattr DW$173, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    1984                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1985                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1986              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1987                      .dwattr DW$174, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    1988                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1989                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1990              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1991                      .dwattr DW$175, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    1992                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1993                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1994              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1995                      .dwattr DW$176, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    1996                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1997                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1998              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1999                      .dwattr DW$177, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    2000                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2001                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2002              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2003                      .dwattr DW$178, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    2004                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2005                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2006              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2007                      .dwattr DW$179, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    2008                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2009                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2010              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2011                      .dwattr DW$180, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    2012                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2013                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2014              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2015                      .dwattr DW$181, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    2016                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2017                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2018              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2019                      .dwattr DW$182, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2020                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2021                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2022                      .dwendtag DW$T$30
    2023              
    2024              DW$T$88 .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$32)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   43

    2025                      .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
    2026              
    2027              DW$T$35 .dwtag  DW_TAG_structure_type
    2028                      .dwattr DW$T$35, DW_AT_name("tag_allsensorstruct")
    2029                      .dwattr DW$T$35, DW_AT_byte_size(0x2d)
    2030              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2031                      .dwattr DW$183, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    2032                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2033                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2034              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2035                      .dwattr DW$184, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    2036                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2037                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2038              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2039                      .dwattr DW$185, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    2040                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2041                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2042              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2043                      .dwattr DW$186, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    2044                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2045                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2046              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2047                      .dwattr DW$187, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    2048                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2049                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2050              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2051                      .dwattr DW$188, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    2052                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2053                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2054              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2055                      .dwattr DW$189, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    2056                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2057                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2058              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2059                      .dwattr DW$190, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    2060                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2061                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2062              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2063                      .dwattr DW$191, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    2064                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2065                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2066              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2067                      .dwattr DW$192, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    2068                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2069                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2070              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2071                      .dwattr DW$193, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2072                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2073                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2074              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2075                      .dwattr DW$194, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    2076                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2077                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2078              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2079                      .dwattr DW$195, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   44

    2080                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2081                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2082              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2083                      .dwattr DW$196, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    2084                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2085                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2086              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2087                      .dwattr DW$197, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2088                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2089                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2090              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2091                      .dwattr DW$198, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2092                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2093                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2094              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2095                      .dwattr DW$199, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    2096                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2097                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2098              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2099                      .dwattr DW$200, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    2100                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2101                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2102              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2103                      .dwattr DW$201, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    2104                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2105                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2106              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2107                      .dwattr DW$202, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    2108                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2109                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2110              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2111                      .dwattr DW$203, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    2112                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2113                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2114              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2115                      .dwattr DW$204, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    2116                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2117                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2118              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2119                      .dwattr DW$205, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    2120                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2121                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2122              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2123                      .dwattr DW$206, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    2124                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2125                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2126              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2127                      .dwattr DW$207, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    2128                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2129                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2130              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2131                      .dwattr DW$208, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    2132                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2133                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2134              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   45

    2135                      .dwattr DW$209, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    2136                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2137                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2138              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2139                      .dwattr DW$210, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    2140                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2141                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2142              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2143                      .dwattr DW$211, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    2144                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2145                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2146              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2147                      .dwattr DW$212, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2148                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2149                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2150              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2151                      .dwattr DW$213, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    2152                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2153                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2154              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2155                      .dwattr DW$214, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    2156                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2157                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2158                      .dwendtag DW$T$35
    2159              
    2160              DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("cylinderstruct"), DW_AT_type(*DW$T$38)
    2161                      .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
    2162              
    2163              DW$T$45 .dwtag  DW_TAG_structure_type
    2164                      .dwattr DW$T$45, DW_AT_name("tag_configstruct")
    2165                      .dwattr DW$T$45, DW_AT_byte_size(0x18)
    2166              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    2167                      .dwattr DW$215, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    2168                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2169                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2170              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    2171                      .dwattr DW$216, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    2172                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2173                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2174              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    2175                      .dwattr DW$217, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    2176                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2177                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2178              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    2179                      .dwattr DW$218, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    2180                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2181                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2182              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    2183                      .dwattr DW$219, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    2184                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2185                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2186              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    2187                      .dwattr DW$220, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    2188                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2189                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   46

    2190                      .dwendtag DW$T$45
    2191              
    2192              
    2193              DW$T$47 .dwtag  DW_TAG_structure_type
    2194                      .dwattr DW$T$47, DW_AT_name("tag_damalarmsstruct")
    2195                      .dwattr DW$T$47, DW_AT_byte_size(0x04)
    2196              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    2197                      .dwattr DW$221, DW_AT_name("single"), DW_AT_symbol_name("_single")
    2198                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2199                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2200              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2201                      .dwattr DW$222, DW_AT_name("cylinder"), DW_AT_symbol_name("_cylinder")
    2202                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2203                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2204              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2205                      .dwattr DW$223, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
    2206                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2207                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2208                      .dwendtag DW$T$47
    2209              
    2210              
    2211              DW$T$48 .dwtag  DW_TAG_structure_type
    2212                      .dwattr DW$T$48, DW_AT_name("tag_alarmsstruct")
    2213                      .dwattr DW$T$48, DW_AT_byte_size(0x01)
    2214              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2215                      .dwattr DW$224, DW_AT_name("slavefailure"), DW_AT_symbol_name("_slavefailure")
    2216                      .dwattr DW$224, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2217                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2218                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2219              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2220                      .dwattr DW$225, DW_AT_name("slavefailurelatched"), DW_AT_symbol_name("_slavefailurelatched")
    2221                      .dwattr DW$225, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2222                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2223                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2224              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2225                      .dwattr DW$226, DW_AT_name("framfailure"), DW_AT_symbol_name("_framfailure")
    2226                      .dwattr DW$226, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2227                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2229              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2230                      .dwattr DW$227, DW_AT_name("framfailurelatched"), DW_AT_symbol_name("_framfailurelatched")
    2231                      .dwattr DW$227, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2232                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2233                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2234              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2235                      .dwattr DW$228, DW_AT_name("pccommsfailure"), DW_AT_symbol_name("_pccommsfailure")
    2236                      .dwattr DW$228, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2237                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2239              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2240                      .dwattr DW$229, DW_AT_name("pccommsfailurelatched"), DW_AT_symbol_name("_pccommsfailurelatched")
    2241                      .dwattr DW$229, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2242                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2244              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   47

    2245                      .dwattr DW$230, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    2246                      .dwattr DW$230, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2247                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2249              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2250                      .dwattr DW$231, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    2251                      .dwattr DW$231, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2252                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2253                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2254              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2255                      .dwattr DW$232, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    2256                      .dwattr DW$232, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2257                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2259              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2260                      .dwattr DW$233, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    2261                      .dwattr DW$233, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2262                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2263                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2264              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2265                      .dwattr DW$234, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    2266                      .dwattr DW$234, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2267                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2269              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2270                      .dwattr DW$235, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    2271                      .dwattr DW$235, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2272                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2273                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2274              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2275                      .dwattr DW$236, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    2276                      .dwattr DW$236, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2277                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2279              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2280                      .dwattr DW$237, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    2281                      .dwattr DW$237, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2282                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2283                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2284              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2285                      .dwattr DW$238, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    2286                      .dwattr DW$238, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2287                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2288                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2289              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2290                      .dwattr DW$239, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    2291                      .dwattr DW$239, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2292                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2293                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2294                      .dwendtag DW$T$48
    2295              
    2296              
    2297              DW$T$50 .dwtag  DW_TAG_structure_type
    2298                      .dwattr DW$T$50, DW_AT_name("tag_slemsstruct")
    2299                      .dwattr DW$T$50, DW_AT_byte_size(0x03)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   48

    2300              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2301                      .dwattr DW$240, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
    2302                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2303                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2304              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2305                      .dwattr DW$241, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    2306                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2307                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2308              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2309                      .dwattr DW$242, DW_AT_name("levelcount"), DW_AT_symbol_name("_levelcount")
    2310                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2311                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2312                      .dwendtag DW$T$50
    2313              
    2314              
    2315              DW$T$52 .dwtag  DW_TAG_structure_type
    2316                      .dwattr DW$T$52, DW_AT_name("tag_rtcbatstruct")
    2317                      .dwattr DW$T$52, DW_AT_byte_size(0x02)
    2318              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2319                      .dwattr DW$243, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
    2320                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2322              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    2323                      .dwattr DW$244, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    2324                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2325                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2326                      .dwendtag DW$T$52
    2327              
    2328              
    2329              DW$T$53 .dwtag  DW_TAG_structure_type
    2330                      .dwattr DW$T$53, DW_AT_byte_size(0x07)
    2331              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2332                      .dwattr DW$245, DW_AT_name("outputtestmode"), DW_AT_symbol_name("_outputtestmode")
    2333                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2334                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2335              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2336                      .dwattr DW$246, DW_AT_name("previousstatus"), DW_AT_symbol_name("_previousstatus")
    2337                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2338                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2339              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2340                      .dwattr DW$247, DW_AT_name("previousslowdown"), DW_AT_symbol_name("_previousslowdown")
    2341                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2342                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2343              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2344                      .dwattr DW$248, DW_AT_name("previousalarm"), DW_AT_symbol_name("_previousalarm")
    2345                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2346                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2347              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2348                      .dwattr DW$249, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    2349                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2350                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2351              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2352                      .dwattr DW$250, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    2353                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2354                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   49

    2355              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2356                      .dwattr DW$251, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    2357                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2358                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2359                      .dwendtag DW$T$53
    2360              
    2361              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    2362                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    2363                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    2364              
    2365              DW$T$19 .dwtag  DW_TAG_structure_type
    2366                      .dwattr DW$T$19, DW_AT_name("tag_sensoralarmstruct")
    2367                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    2368              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2369                      .dwattr DW$252, DW_AT_name("failure"), DW_AT_symbol_name("_failure")
    2370                      .dwattr DW$252, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2371                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2373              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2374                      .dwattr DW$253, DW_AT_name("failurelatched"), DW_AT_symbol_name("_failurelatched")
    2375                      .dwattr DW$253, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2376                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2378              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2379                      .dwattr DW$254, DW_AT_name("slowdown"), DW_AT_symbol_name("_slowdown")
    2380                      .dwattr DW$254, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2381                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2382                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2383              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2384                      .dwattr DW$255, DW_AT_name("slowdownlatched"), DW_AT_symbol_name("_slowdownlatched")
    2385                      .dwattr DW$255, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2386                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2387                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2388              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2389                      .dwattr DW$256, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
    2390                      .dwattr DW$256, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2391                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2392                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2393              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2394                      .dwattr DW$257, DW_AT_name("alarmlatched"), DW_AT_symbol_name("_alarmlatched")
    2395                      .dwattr DW$257, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2396                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2397                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2398              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2399                      .dwattr DW$258, DW_AT_name("devalarm"), DW_AT_symbol_name("_devalarm")
    2400                      .dwattr DW$258, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2401                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2403              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2404                      .dwattr DW$259, DW_AT_name("devalarmlatched"), DW_AT_symbol_name("_devalarmlatched")
    2405                      .dwattr DW$259, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2406                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2407                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2408              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2409                      .dwattr DW$260, DW_AT_name("devslow"), DW_AT_symbol_name("_devslow")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   50

    2410                      .dwattr DW$260, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2411                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2413              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2414                      .dwattr DW$261, DW_AT_name("devslowlatched"), DW_AT_symbol_name("_devslowlatched")
    2415                      .dwattr DW$261, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2416                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2418              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2419                      .dwattr DW$262, DW_AT_name("calibration"), DW_AT_symbol_name("_calibration")
    2420                      .dwattr DW$262, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2421                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2422                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2423              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2424                      .dwattr DW$263, DW_AT_name("calibrationlatched"), DW_AT_symbol_name("_calibrationlatched")
    2425                      .dwattr DW$263, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2426                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2428              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2429                      .dwattr DW$264, DW_AT_name("prewarning"), DW_AT_symbol_name("_prewarning")
    2430                      .dwattr DW$264, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2431                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2433              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2434                      .dwattr DW$265, DW_AT_name("prewarninglatched"), DW_AT_symbol_name("_prewarninglatched")
    2435                      .dwattr DW$265, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2436                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2438              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2439                      .dwattr DW$266, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    2440                      .dwattr DW$266, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2441                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2443              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2444                      .dwattr DW$267, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    2445                      .dwattr DW$267, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2446                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2448                      .dwendtag DW$T$19
    2449              
    2450              DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("wioalarmstruct"), DW_AT_type(*DW$T$20)
    2451                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2452              
    2453              DW$T$25 .dwtag  DW_TAG_structure_type
    2454                      .dwattr DW$T$25, DW_AT_name("taggpbport")
    2455                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    2456              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2457                      .dwattr DW$268, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2458                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2459                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2460                      .dwendtag DW$T$25
    2461              
    2462              
    2463              DW$T$28 .dwtag  DW_TAG_structure_type
    2464                      .dwattr DW$T$28, DW_AT_name("taggpfport")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   51

    2465                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    2466              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2467                      .dwattr DW$269, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2468                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2469                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2470                      .dwendtag DW$T$28
    2471              
    2472              
    2473              DW$T$29 .dwtag  DW_TAG_structure_type
    2474                      .dwattr DW$T$29, DW_AT_byte_size(0x02)
    2475              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2476                      .dwattr DW$270, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    2477                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2478                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2479              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2480                      .dwattr DW$271, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2481                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2482                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2483                      .dwendtag DW$T$29
    2484              
    2485              
    2486              DW$T$32 .dwtag  DW_TAG_structure_type
    2487                      .dwattr DW$T$32, DW_AT_name("tag_timers")
    2488                      .dwattr DW$T$32, DW_AT_byte_size(0x4c)
    2489              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2490                      .dwattr DW$272, DW_AT_name("update"), DW_AT_symbol_name("_update")
    2491                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2492                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2493              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2494                      .dwattr DW$273, DW_AT_name("general"), DW_AT_symbol_name("_general")
    2495                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2496                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2497              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2498                      .dwattr DW$274, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    2499                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2500                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2501              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2502                      .dwattr DW$275, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    2503                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2504                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2505              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2506                      .dwattr DW$276, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    2507                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2508                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2509              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2510                      .dwattr DW$277, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    2511                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2512                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2513              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2514                      .dwattr DW$278, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    2515                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2516                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2517              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2518                      .dwattr DW$279, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    2519                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   52

    2520                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2521              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2522                      .dwattr DW$280, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    2523                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2524                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2525              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2526                      .dwattr DW$281, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    2527                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2528                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2529              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2530                      .dwattr DW$282, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    2531                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2532                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2533              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2534                      .dwattr DW$283, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    2535                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2536                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2537              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2538                      .dwattr DW$284, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    2539                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2540                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2541              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2542                      .dwattr DW$285, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    2543                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2544                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2545              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2546                      .dwattr DW$286, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    2547                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2548                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2549              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2550                      .dwattr DW$287, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2551                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2552                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2553              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2554                      .dwattr DW$288, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    2555                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2556                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2557              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2558                      .dwattr DW$289, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    2559                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2560                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2561              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2562                      .dwattr DW$290, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    2563                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2564                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2565              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2566                      .dwattr DW$291, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    2567                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2568                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2569              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2570                      .dwattr DW$292, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    2571                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2572                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2573              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2574                      .dwattr DW$293, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   53

    2575                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2576                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2577              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2578                      .dwattr DW$294, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    2579                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2580                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2581              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2582                      .dwattr DW$295, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    2583                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2584                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2585              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2586                      .dwattr DW$296, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    2587                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2588                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2589              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2590                      .dwattr DW$297, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    2591                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2592                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2593              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2594                      .dwattr DW$298, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    2595                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2596                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2597              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2598                      .dwattr DW$299, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    2599                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2600                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2601              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2602                      .dwattr DW$300, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    2603                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2604                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2605              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2606                      .dwattr DW$301, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    2607                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2608                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2609              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2610                      .dwattr DW$302, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    2611                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2612                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2613              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2614                      .dwattr DW$303, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    2615                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2616                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2617              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2618                      .dwattr DW$304, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    2619                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    2620                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2621              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2622                      .dwattr DW$305, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    2623                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2624                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2625              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2626                      .dwattr DW$306, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    2627                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2628                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2629              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   54

    2630                      .dwattr DW$307, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    2631                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2632                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2633              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2634                      .dwattr DW$308, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    2635                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2636                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2637              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2638                      .dwattr DW$309, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    2639                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2640                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2641              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2642                      .dwattr DW$310, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    2643                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2644                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2645              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2646                      .dwattr DW$311, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    2647                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2648                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2649              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2650                      .dwattr DW$312, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    2651                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2652                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2653              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2654                      .dwattr DW$313, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    2655                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2656                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2657              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2658                      .dwattr DW$314, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    2659                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2660                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2661                      .dwendtag DW$T$32
    2662              
    2663              
    2664              DW$T$33 .dwtag  DW_TAG_structure_type
    2665                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
    2666              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2667                      .dwattr DW$315, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
    2668                      .dwattr DW$315, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2669                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2671              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2672                      .dwattr DW$316, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    2673                      .dwattr DW$316, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2674                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2675                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2676              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2677                      .dwattr DW$317, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
    2678                      .dwattr DW$317, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2679                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2680                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2681              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2682                      .dwattr DW$318, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
    2683                      .dwattr DW$318, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2684                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   55

    2685                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2686              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2687                      .dwattr DW$319, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    2688                      .dwattr DW$319, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2689                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2691                      .dwendtag DW$T$33
    2692              
    2693              
    2694              DW$T$34 .dwtag  DW_TAG_structure_type
    2695                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    2696              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2697                      .dwattr DW$320, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
    2698                      .dwattr DW$320, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2699                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2701              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2702                      .dwattr DW$321, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    2703                      .dwattr DW$321, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    2704                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2706                      .dwendtag DW$T$34
    2707              
    2708              
    2709              DW$T$38 .dwtag  DW_TAG_structure_type
    2710                      .dwattr DW$T$38, DW_AT_name("tag_cylinderstruct")
    2711                      .dwattr DW$T$38, DW_AT_byte_size(0x04)
    2712              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2713                      .dwattr DW$322, DW_AT_name("status1"), DW_AT_symbol_name("_status1")
    2714                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2715                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2716              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2717                      .dwattr DW$323, DW_AT_name("status2"), DW_AT_symbol_name("_status2")
    2718                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2719                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2720              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2721                      .dwattr DW$324, DW_AT_name("average"), DW_AT_symbol_name("_average")
    2722                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2723                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2724              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2725                      .dwattr DW$325, DW_AT_name("deviation"), DW_AT_symbol_name("_deviation")
    2726                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2727                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2728                      .dwendtag DW$T$38
    2729              
    2730              
    2731              DW$T$39 .dwtag  DW_TAG_structure_type
    2732                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    2733              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2734                      .dwattr DW$326, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    2735                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2736                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2737                      .dwendtag DW$T$39
    2738              
    2739              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   56

    2740              DW$T$40 .dwtag  DW_TAG_structure_type
    2741                      .dwattr DW$T$40, DW_AT_byte_size(0x01)
    2742              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2743                      .dwattr DW$327, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    2744                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2745                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2746                      .dwendtag DW$T$40
    2747              
    2748              
    2749              DW$T$41 .dwtag  DW_TAG_structure_type
    2750                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    2751              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2752                      .dwattr DW$328, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    2753                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2754                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2755                      .dwendtag DW$T$41
    2756              
    2757              
    2758              DW$T$42 .dwtag  DW_TAG_structure_type
    2759                      .dwattr DW$T$42, DW_AT_byte_size(0x03)
    2760              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2761                      .dwattr DW$329, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    2762                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2763                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2764              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2765                      .dwattr DW$330, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    2766                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2767                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2768              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2769                      .dwattr DW$331, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    2770                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2771                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2772                      .dwendtag DW$T$42
    2773              
    2774              
    2775              DW$T$43 .dwtag  DW_TAG_structure_type
    2776                      .dwattr DW$T$43, DW_AT_byte_size(0x02)
    2777              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2778                      .dwattr DW$332, DW_AT_name("shortlrate"), DW_AT_symbol_name("_shortlrate")
    2779                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2780                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2781              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2782                      .dwattr DW$333, DW_AT_name("longlrate"), DW_AT_symbol_name("_longlrate")
    2783                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2784                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2785                      .dwendtag DW$T$43
    2786              
    2787              
    2788              DW$T$44 .dwtag  DW_TAG_structure_type
    2789                      .dwattr DW$T$44, DW_AT_byte_size(0x10)
    2790              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2791                      .dwattr DW$334, DW_AT_name("wiorequest"), DW_AT_symbol_name("_wiorequest")
    2792                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2793                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2794              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   57

    2795                      .dwattr DW$335, DW_AT_name("wiocancelled"), DW_AT_symbol_name("_wiocancelled")
    2796                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2797                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2798              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2799                      .dwattr DW$336, DW_AT_name("wioreceived"), DW_AT_symbol_name("_wioreceived")
    2800                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2801                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2802              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2803                      .dwattr DW$337, DW_AT_name("slaverequest"), DW_AT_symbol_name("_slaverequest")
    2804                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2805                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2806              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2807                      .dwattr DW$338, DW_AT_name("slavereceived"), DW_AT_symbol_name("_slavereceived")
    2808                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2809                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2810              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2811                      .dwattr DW$339, DW_AT_name("slaveretry"), DW_AT_symbol_name("_slaveretry")
    2812                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2813                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2814              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2815                      .dwattr DW$340, DW_AT_name("pcrequest"), DW_AT_symbol_name("_pcrequest")
    2816                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2817                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2818              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2819                      .dwattr DW$341, DW_AT_name("pcreqtimeout"), DW_AT_symbol_name("_pcreqtimeout")
    2820                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2821                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2822                      .dwendtag DW$T$44
    2823              
    2824              
    2825              DW$T$49 .dwtag  DW_TAG_structure_type
    2826                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
    2827              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2828                      .dwattr DW$342, DW_AT_name("oor"), DW_AT_symbol_name("_oor")
    2829                      .dwattr DW$342, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2830                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2832              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2833                      .dwattr DW$343, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
    2834                      .dwattr DW$343, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2835                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2836                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2837              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2838                      .dwattr DW$344, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    2839                      .dwattr DW$344, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2840                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2841                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2842                      .dwendtag DW$T$49
    2843              
    2844              
    2845              DW$T$51 .dwtag  DW_TAG_structure_type
    2846                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    2847              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2848                      .dwattr DW$345, DW_AT_name("low"), DW_AT_symbol_name("_low")
    2849                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:11 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
digout.asm                                                           PAGE   58

    2850                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2851                      .dwendtag DW$T$51
    2852              
    2853              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    2854                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2855                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    2856              
    2857              DW$T$20 .dwtag  DW_TAG_structure_type
    2858                      .dwattr DW$T$20, DW_AT_name("tag_wioalarmstruct")
    2859                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    2860              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2861                      .dwattr DW$346, DW_AT_name("alarmupper"), DW_AT_symbol_name("_alarmupper")
    2862                      .dwattr DW$346, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2863                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2865              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2866                      .dwattr DW$347, DW_AT_name("alarmupperlatched"), DW_AT_symbol_name("_alarmupperlatched")
    2867                      .dwattr DW$347, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2868                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2869                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2870              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2871                      .dwattr DW$348, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
    2872                      .dwattr DW$348, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2873                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2874                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2875              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2876                      .dwattr DW$349, DW_AT_name("alarmlatched"), DW_AT_symbol_name("_alarmlatched")
