TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:13 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("fat.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("memcpy"), DW_AT_symbol_name("_memcpy")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$3)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    8964                      .dwattr DW$T$223, DW_AT_language(DW_LANG_C)
    8965                      .dwattr DW$T$223, DW_AT_byte_size(0x200)
    8966              DW$695  .dwtag  DW_TAG_subrange_type
    8967                      .dwattr DW$695, DW_AT_upper_bound(0x1ff)
    8968                      .dwendtag DW$T$223
    8969              
    8970              DW$T$117        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$116)
    8971                      .dwattr DW$T$117, DW_AT_address_class(0x16)
    8972              DW$T$210        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$69)
    8973                      .dwattr DW$T$210, DW_AT_address_class(0x16)
    8974              
    8975              DW$T$231        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$210)
    8976                      .dwattr DW$T$231, DW_AT_language(DW_LANG_C)
    8977              DW$696  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$117)
    8978              DW$697  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
    8979              DW$698  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
    8980                      .dwendtag DW$T$231
    8981              
    8982              
    8983              DW$T$232        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$210)
    8984                      .dwattr DW$T$232, DW_AT_language(DW_LANG_C)
    8985              DW$699  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$117)
    8986              DW$700  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$146)
    8987              DW$701  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    8988                      .dwendtag DW$T$232
    8989              
    8990              DW$T$89 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$78)
    8991                      .dwattr DW$T$89, DW_AT_address_class(0x16)
    8992              DW$T$126        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$89)
    8993                      .dwattr DW$T$126, DW_AT_address_class(0x16)
    8994              DW$T$66 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$65)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  179

    8995                      .dwattr DW$T$66, DW_AT_address_class(0x16)
    8996              DW$T$93 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$92)
    8997                      .dwattr DW$T$93, DW_AT_address_class(0x16)
    8998              DW$T$152        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$93)
    8999                      .dwattr DW$T$152, DW_AT_address_class(0x16)
    9000              DW$T$100        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$80)
    9001                      .dwattr DW$T$100, DW_AT_address_class(0x16)
    9002              
    9003              DW$T$252        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$100)
    9004                      .dwattr DW$T$252, DW_AT_language(DW_LANG_C)
    9005              DW$T$149        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
    9006                      .dwattr DW$T$149, DW_AT_address_class(0x16)
    9007              DW$T$163        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$162)
    9008                      .dwattr DW$T$163, DW_AT_address_class(0x16)
    9009              DW$T$264        .dwtag  DW_TAG_typedef, DW_AT_name("F_FILESYSTEM"), DW_AT_type(*DW$T$82)
    9010                      .dwattr DW$T$264, DW_AT_language(DW_LANG_C)
    9011              DW$702  .dwtag  DW_TAG_far_type
    9012              DW$T$83 .dwtag  DW_TAG_const_type
    9013                      .dwattr DW$T$83, DW_AT_type(*DW$702)
    9014              DW$T$19 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    9015                      .dwattr DW$T$19, DW_AT_encoding(DW_ATE_signed_char)
    9016                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    9017              DW$703  .dwtag  DW_TAG_far_type
    9018                      .dwattr DW$703, DW_AT_type(*DW$T$19)
    9019              DW$T$145        .dwtag  DW_TAG_const_type
    9020                      .dwattr DW$T$145, DW_AT_type(*DW$703)
    9021              DW$T$116        .dwtag  DW_TAG_typedef, DW_AT_name("F_MULTI"), DW_AT_type(*DW$T$24)
    9022                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
    9023              DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("F_FILE"), DW_AT_type(*DW$T$25)
    9024                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    9025              DW$T$78 .dwtag  DW_TAG_typedef, DW_AT_name("F_VOLUME"), DW_AT_type(*DW$T$61)
    9026                      .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
    9027              DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("F_POS"), DW_AT_type(*DW$T$62)
    9028                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    9029              DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("F_DIRENTRY"), DW_AT_type(*DW$T$64)
    9030                      .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
    9031              DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("F_FILEINT"), DW_AT_type(*DW$T$72)
    9032                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    9033              DW$T$76 .dwtag  DW_TAG_typedef, DW_AT_name("F_NAME"), DW_AT_type(*DW$T$75)
    9034                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    9035              DW$T$162        .dwtag  DW_TAG_typedef, DW_AT_name("F_FIND"), DW_AT_type(*DW$T$77)
    9036                      .dwattr DW$T$162, DW_AT_language(DW_LANG_C)
    9037              
    9038              DW$T$82 .dwtag  DW_TAG_structure_type
    9039                      .dwattr DW$T$82, DW_AT_byte_size(0xa4a)
    9040              DW$704  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    9041                      .dwattr DW$704, DW_AT_name("volumes"), DW_AT_symbol_name("_volumes")
    9042                      .dwattr DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9043                      .dwattr DW$704, DW_AT_accessibility(DW_ACCESS_public)
    9044              DW$705  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
    9045                      .dwattr DW$705, DW_AT_name("files"), DW_AT_symbol_name("_files")
    9046                      .dwattr DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x47c]
    9047                      .dwattr DW$705, DW_AT_accessibility(DW_ACCESS_public)
    9048              DW$706  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    9049                      .dwattr DW$706, DW_AT_name("sectorbuffer"), DW_AT_symbol_name("_sectorbuffer")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  180

    9050                      .dwattr DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x84a]
    9051                      .dwattr DW$706, DW_AT_accessibility(DW_ACCESS_public)
    9052                      .dwendtag DW$T$82
    9053              
    9054              
    9055              DW$T$57 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    9056                      .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
    9057                      .dwattr DW$T$57, DW_AT_byte_size(0x200)
    9058              DW$707  .dwtag  DW_TAG_subrange_type
    9059                      .dwattr DW$707, DW_AT_upper_bound(0x1ff)
    9060                      .dwendtag DW$T$57
    9061              
    9062              
    9063              DW$T$24 .dwtag  DW_TAG_structure_type
    9064                      .dwattr DW$T$24, DW_AT_byte_size(0x1a)
    9065              DW$708  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    9066                      .dwattr DW$708, DW_AT_name("ID"), DW_AT_symbol_name("_ID")
    9067                      .dwattr DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9068                      .dwattr DW$708, DW_AT_accessibility(DW_ACCESS_public)
    9069              DW$709  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9070                      .dwattr DW$709, DW_AT_name("f_curdrive"), DW_AT_symbol_name("_f_curdrive")
    9071                      .dwattr DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9072                      .dwattr DW$709, DW_AT_accessibility(DW_ACCESS_public)
    9073              DW$710  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    9074                      .dwattr DW$710, DW_AT_name("f_vols"), DW_AT_symbol_name("_f_vols")
    9075                      .dwattr DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9076                      .dwattr DW$710, DW_AT_accessibility(DW_ACCESS_public)
    9077              DW$711  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9078                      .dwattr DW$711, DW_AT_name("pmutex"), DW_AT_symbol_name("_pmutex")
    9079                      .dwattr DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9080                      .dwattr DW$711, DW_AT_accessibility(DW_ACCESS_public)
    9081                      .dwendtag DW$T$24
    9082              
    9083              
    9084              DW$T$25 .dwtag  DW_TAG_structure_type
    9085                      .dwattr DW$T$25, DW_AT_byte_size(0x02)
    9086              DW$712  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    9087                      .dwattr DW$712, DW_AT_name("reference"), DW_AT_symbol_name("_reference")
    9088                      .dwattr DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9089                      .dwattr DW$712, DW_AT_accessibility(DW_ACCESS_public)
    9090                      .dwendtag DW$T$25
    9091              
    9092              
    9093              DW$T$61 .dwtag  DW_TAG_structure_type
    9094                      .dwattr DW$T$61, DW_AT_byte_size(0x47c)
    9095              DW$713  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    9096                      .dwattr DW$713, DW_AT_name("state"), DW_AT_symbol_name("_state")
    9097                      .dwattr DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9098                      .dwattr DW$713, DW_AT_accessibility(DW_ACCESS_public)
    9099              DW$714  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    9100                      .dwattr DW$714, DW_AT_name("bootrecord"), DW_AT_symbol_name("_bootrecord")
    9101                      .dwattr DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9102                      .dwattr DW$714, DW_AT_accessibility(DW_ACCESS_public)
    9103              DW$715  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    9104                      .dwattr DW$715, DW_AT_name("firstfat"), DW_AT_symbol_name("_firstfat")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  181

    9105                      .dwattr DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    9106                      .dwattr DW$715, DW_AT_accessibility(DW_ACCESS_public)
    9107              DW$716  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    9108                      .dwattr DW$716, DW_AT_name("root"), DW_AT_symbol_name("_root")
    9109                      .dwattr DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    9110                      .dwattr DW$716, DW_AT_accessibility(DW_ACCESS_public)
    9111              DW$717  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    9112                      .dwattr DW$717, DW_AT_name("data"), DW_AT_symbol_name("_data")
    9113                      .dwattr DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    9114                      .dwattr DW$717, DW_AT_accessibility(DW_ACCESS_public)
    9115              DW$718  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    9116                      .dwattr DW$718, DW_AT_name("fat"), DW_AT_symbol_name("_fat")
    9117                      .dwattr DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    9118                      .dwattr DW$718, DW_AT_accessibility(DW_ACCESS_public)
    9119              DW$719  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9120                      .dwattr DW$719, DW_AT_name("fatsector"), DW_AT_symbol_name("_fatsector")
    9121                      .dwattr DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x256]
    9122                      .dwattr DW$719, DW_AT_accessibility(DW_ACCESS_public)
    9123              DW$720  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    9124                      .dwattr DW$720, DW_AT_name("fatmodified"), DW_AT_symbol_name("_fatmodified")
    9125                      .dwattr DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x258]
    9126                      .dwattr DW$720, DW_AT_accessibility(DW_ACCESS_public)
    9127              DW$721  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    9128                      .dwattr DW$721, DW_AT_name("direntry"), DW_AT_symbol_name("_direntry")
    9129                      .dwattr DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x25a]
    9130                      .dwattr DW$721, DW_AT_accessibility(DW_ACCESS_public)
    9131              DW$722  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9132                      .dwattr DW$722, DW_AT_name("direntrysector"), DW_AT_symbol_name("_direntrysector")
    9133                      .dwattr DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x45a]
    9134                      .dwattr DW$722, DW_AT_accessibility(DW_ACCESS_public)
    9135              DW$723  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9136                      .dwattr DW$723, DW_AT_name("lastalloccluster"), DW_AT_symbol_name("_lastalloccluster")
    9137                      .dwattr DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x45c]
    9138                      .dwattr DW$723, DW_AT_accessibility(DW_ACCESS_public)
    9139              DW$724  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    9140                      .dwattr DW$724, DW_AT_name("func"), DW_AT_symbol_name("_func")
    9141                      .dwattr DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x45e]
    9142                      .dwattr DW$724, DW_AT_accessibility(DW_ACCESS_public)
    9143              DW$725  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    9144                      .dwattr DW$725, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
    9145                      .dwattr DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
    9146                      .dwattr DW$725, DW_AT_accessibility(DW_ACCESS_public)
    9147              DW$726  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    9148                      .dwattr DW$726, DW_AT_name("mediatype"), DW_AT_symbol_name("_mediatype")
    9149                      .dwattr DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x470]
    9150                      .dwattr DW$726, DW_AT_accessibility(DW_ACCESS_public)
    9151              DW$727  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    9152                      .dwattr DW$727, DW_AT_name("clspace"), DW_AT_symbol_name("_clspace")
    9153                      .dwattr DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x472]
    9154                      .dwattr DW$727, DW_AT_accessibility(DW_ACCESS_public)
    9155              DW$728  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    9156                      .dwattr DW$728, DW_AT_name("cspaceok"), DW_AT_symbol_name("_cspaceok")
    9157                      .dwattr DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x478]
    9158                      .dwattr DW$728, DW_AT_accessibility(DW_ACCESS_public)
    9159              DW$729  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  182

    9160                      .dwattr DW$729, DW_AT_name("mutex"), DW_AT_symbol_name("_mutex")
    9161                      .dwattr DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x47a]
    9162                      .dwattr DW$729, DW_AT_accessibility(DW_ACCESS_public)
    9163                      .dwendtag DW$T$61
    9164              
    9165              
    9166              DW$T$79 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$78)
    9167                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    9168                      .dwattr DW$T$79, DW_AT_byte_size(0x47c)
    9169              DW$730  .dwtag  DW_TAG_subrange_type
    9170                      .dwattr DW$730, DW_AT_upper_bound(0x00)
    9171                      .dwendtag DW$T$79
    9172              
    9173              
    9174              DW$T$62 .dwtag  DW_TAG_structure_type
    9175                      .dwattr DW$T$62, DW_AT_byte_size(0x0c)
    9176              DW$731  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9177                      .dwattr DW$731, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
    9178                      .dwattr DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9179                      .dwattr DW$731, DW_AT_accessibility(DW_ACCESS_public)
    9180              DW$732  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9181                      .dwattr DW$732, DW_AT_name("prevcluster"), DW_AT_symbol_name("_prevcluster")
    9182                      .dwattr DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9183                      .dwattr DW$732, DW_AT_accessibility(DW_ACCESS_public)
    9184              DW$733  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9185                      .dwattr DW$733, DW_AT_name("sectorbegin"), DW_AT_symbol_name("_sectorbegin")
    9186                      .dwattr DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9187                      .dwattr DW$733, DW_AT_accessibility(DW_ACCESS_public)
    9188              DW$734  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9189                      .dwattr DW$734, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
    9190                      .dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9191                      .dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
    9192              DW$735  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9193                      .dwattr DW$735, DW_AT_name("sectorend"), DW_AT_symbol_name("_sectorend")
    9194                      .dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9195                      .dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
    9196              DW$736  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9197                      .dwattr DW$736, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
    9198                      .dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9199                      .dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
    9200                      .dwendtag DW$T$62
    9201              
    9202              
    9203              DW$T$64 .dwtag  DW_TAG_structure_type
    9204                      .dwattr DW$T$64, DW_AT_byte_size(0x20)
    9205              DW$737  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    9206                      .dwattr DW$737, DW_AT_name("name"), DW_AT_symbol_name("_name")
    9207                      .dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9208                      .dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
    9209              DW$738  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    9210                      .dwattr DW$738, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
    9211                      .dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9212                      .dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
    9213              DW$739  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9214                      .dwattr DW$739, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  183

    9215                      .dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9216                      .dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
    9217              DW$740  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9218                      .dwattr DW$740, DW_AT_name("ntres"), DW_AT_symbol_name("_ntres")
    9219                      .dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9220                      .dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
    9221              DW$741  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9222                      .dwattr DW$741, DW_AT_name("crttimetenth"), DW_AT_symbol_name("_crttimetenth")
    9223                      .dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9224                      .dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
    9225              DW$742  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9226                      .dwattr DW$742, DW_AT_name("crttime"), DW_AT_symbol_name("_crttime")
    9227                      .dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9228                      .dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
    9229              DW$743  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9230                      .dwattr DW$743, DW_AT_name("crtdate"), DW_AT_symbol_name("_crtdate")
    9231                      .dwattr DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9232                      .dwattr DW$743, DW_AT_accessibility(DW_ACCESS_public)
    9233              DW$744  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9234                      .dwattr DW$744, DW_AT_name("lastaccessdate"), DW_AT_symbol_name("_lastaccessdate")
    9235                      .dwattr DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9236                      .dwattr DW$744, DW_AT_accessibility(DW_ACCESS_public)
    9237              DW$745  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9238                      .dwattr DW$745, DW_AT_name("clusterhi"), DW_AT_symbol_name("_clusterhi")
    9239                      .dwattr DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9240                      .dwattr DW$745, DW_AT_accessibility(DW_ACCESS_public)
    9241              DW$746  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9242                      .dwattr DW$746, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
    9243                      .dwattr DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9244                      .dwattr DW$746, DW_AT_accessibility(DW_ACCESS_public)
    9245              DW$747  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9246                      .dwattr DW$747, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
    9247                      .dwattr DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9248                      .dwattr DW$747, DW_AT_accessibility(DW_ACCESS_public)
    9249              DW$748  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9250                      .dwattr DW$748, DW_AT_name("clusterlo"), DW_AT_symbol_name("_clusterlo")
    9251                      .dwattr DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9252                      .dwattr DW$748, DW_AT_accessibility(DW_ACCESS_public)
    9253              DW$749  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    9254                      .dwattr DW$749, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
    9255                      .dwattr DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9256                      .dwattr DW$749, DW_AT_accessibility(DW_ACCESS_public)
    9257                      .dwendtag DW$T$64
    9258              
    9259              
    9260              DW$T$72 .dwtag  DW_TAG_structure_type
    9261                      .dwattr DW$T$72, DW_AT_byte_size(0x3ce)
    9262              DW$750  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    9263                      .dwattr DW$750, DW_AT_name("file"), DW_AT_symbol_name("_file")
    9264                      .dwattr DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9265                      .dwattr DW$750, DW_AT_accessibility(DW_ACCESS_public)
    9266              DW$751  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    9267                      .dwattr DW$751, DW_AT_name("modified"), DW_AT_symbol_name("_modified")
    9268                      .dwattr DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9269                      .dwattr DW$751, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  184

    9270              DW$752  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    9271                      .dwattr DW$752, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
    9272                      .dwattr DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9273                      .dwattr DW$752, DW_AT_accessibility(DW_ACCESS_public)
    9274              DW$753  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9275                      .dwattr DW$753, DW_AT_name("drivenum"), DW_AT_symbol_name("_drivenum")
    9276                      .dwattr DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9277                      .dwattr DW$753, DW_AT_accessibility(DW_ACCESS_public)
    9278              DW$754  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9279                      .dwattr DW$754, DW_AT_name("abspos"), DW_AT_symbol_name("_abspos")
    9280                      .dwattr DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9281                      .dwattr DW$754, DW_AT_accessibility(DW_ACCESS_public)
    9282              DW$755  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9283                      .dwattr DW$755, DW_AT_name("relpos"), DW_AT_symbol_name("_relpos")
    9284                      .dwattr DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9285                      .dwattr DW$755, DW_AT_accessibility(DW_ACCESS_public)
    9286              DW$756  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9287                      .dwattr DW$756, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
    9288                      .dwattr DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9289                      .dwattr DW$756, DW_AT_accessibility(DW_ACCESS_public)
    9290              DW$757  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    9291                      .dwattr DW$757, DW_AT_name("data"), DW_AT_symbol_name("_data")
    9292                      .dwattr DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9293                      .dwattr DW$757, DW_AT_accessibility(DW_ACCESS_public)
    9294              DW$758  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    9295                      .dwattr DW$758, DW_AT_name("WrDataCache"), DW_AT_symbol_name("_WrDataCache")
    9296                      .dwattr DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
    9297                      .dwattr DW$758, DW_AT_accessibility(DW_ACCESS_public)
    9298              DW$759  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9299                      .dwattr DW$759, DW_AT_name("startcluster"), DW_AT_symbol_name("_startcluster")
    9300                      .dwattr DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x392]
    9301                      .dwattr DW$759, DW_AT_accessibility(DW_ACCESS_public)
    9302              DW$760  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    9303                      .dwattr DW$760, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
    9304                      .dwattr DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x394]
    9305                      .dwattr DW$760, DW_AT_accessibility(DW_ACCESS_public)
    9306              DW$761  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    9307                      .dwattr DW$761, DW_AT_name("dirpos"), DW_AT_symbol_name("_dirpos")
    9308                      .dwattr DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a0]
    9309                      .dwattr DW$761, DW_AT_accessibility(DW_ACCESS_public)
    9310              DW$762  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    9311                      .dwattr DW$762, DW_AT_name("seekpos"), DW_AT_symbol_name("_seekpos")
    9312                      .dwattr DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x3ac]
    9313                      .dwattr DW$762, DW_AT_accessibility(DW_ACCESS_public)
    9314              DW$763  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    9315                      .dwattr DW$763, DW_AT_name("seekprev"), DW_AT_symbol_name("_seekprev")
    9316                      .dwattr DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x3bc]
    9317                      .dwattr DW$763, DW_AT_accessibility(DW_ACCESS_public)
    9318              DW$764  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    9319                      .dwattr DW$764, DW_AT_name("seekshift"), DW_AT_symbol_name("_seekshift")
    9320                      .dwattr DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x3cc]
    9321                      .dwattr DW$764, DW_AT_accessibility(DW_ACCESS_public)
    9322                      .dwendtag DW$T$72
    9323              
    9324              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  185

    9325              DW$T$81 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$80)
    9326                      .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    9327                      .dwattr DW$T$81, DW_AT_byte_size(0x3ce)
    9328              DW$765  .dwtag  DW_TAG_subrange_type
    9329                      .dwattr DW$765, DW_AT_upper_bound(0x00)
    9330                      .dwendtag DW$T$81
    9331              
    9332              
    9333              DW$T$75 .dwtag  DW_TAG_structure_type
    9334                      .dwattr DW$T$75, DW_AT_byte_size(0x20)
    9335              DW$766  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9336                      .dwattr DW$766, DW_AT_name("drivenum"), DW_AT_symbol_name("_drivenum")
    9337                      .dwattr DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9338                      .dwattr DW$766, DW_AT_accessibility(DW_ACCESS_public)
    9339              DW$767  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    9340                      .dwattr DW$767, DW_AT_name("path"), DW_AT_symbol_name("_path")
    9341                      .dwattr DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9342                      .dwattr DW$767, DW_AT_accessibility(DW_ACCESS_public)
    9343              DW$768  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    9344                      .dwattr DW$768, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
    9345                      .dwattr DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    9346                      .dwattr DW$768, DW_AT_accessibility(DW_ACCESS_public)
    9347              DW$769  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    9348                      .dwattr DW$769, DW_AT_name("fileext"), DW_AT_symbol_name("_fileext")
    9349                      .dwattr DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    9350                      .dwattr DW$769, DW_AT_accessibility(DW_ACCESS_public)
    9351                      .dwendtag DW$T$75
    9352              
    9353              
    9354              DW$T$77 .dwtag  DW_TAG_structure_type
    9355                      .dwattr DW$T$77, DW_AT_byte_size(0x52)
    9356              DW$770  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    9357                      .dwattr DW$770, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
    9358                      .dwattr DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9359                      .dwattr DW$770, DW_AT_accessibility(DW_ACCESS_public)
    9360              DW$771  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    9361                      .dwattr DW$771, DW_AT_name("name"), DW_AT_symbol_name("_name")
    9362                      .dwattr DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9363                      .dwattr DW$771, DW_AT_accessibility(DW_ACCESS_public)
    9364              DW$772  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    9365                      .dwattr DW$772, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
    9366                      .dwattr DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9367                      .dwattr DW$772, DW_AT_accessibility(DW_ACCESS_public)
    9368              DW$773  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    9369                      .dwattr DW$773, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
    9370                      .dwattr DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    9371                      .dwattr DW$773, DW_AT_accessibility(DW_ACCESS_public)
    9372              DW$774  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9373                      .dwattr DW$774, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
    9374                      .dwattr DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9375                      .dwattr DW$774, DW_AT_accessibility(DW_ACCESS_public)
    9376              DW$775  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9377                      .dwattr DW$775, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
    9378                      .dwattr DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    9379                      .dwattr DW$775, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  186

    9380              DW$776  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9381                      .dwattr DW$776, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
    9382                      .dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9383                      .dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
    9384              DW$777  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    9385                      .dwattr DW$777, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
    9386                      .dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    9387                      .dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
    9388              DW$778  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    9389                      .dwattr DW$778, DW_AT_name("findfsname"), DW_AT_symbol_name("_findfsname")
    9390                      .dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9391                      .dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
    9392              DW$779  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    9393                      .dwattr DW$779, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
    9394                      .dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9395                      .dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
    9396                      .dwendtag DW$T$77
    9397              
    9398              
    9399              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    9400                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    9401                      .dwattr DW$T$26, DW_AT_byte_size(0x03)
    9402              DW$780  .dwtag  DW_TAG_subrange_type
    9403                      .dwattr DW$780, DW_AT_upper_bound(0x02)
    9404                      .dwendtag DW$T$26
    9405              
    9406              
    9407              DW$T$27 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    9408                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    9409                      .dwattr DW$T$27, DW_AT_byte_size(0x08)
    9410              DW$781  .dwtag  DW_TAG_subrange_type
    9411                      .dwattr DW$781, DW_AT_upper_bound(0x07)
    9412                      .dwendtag DW$T$27
    9413              
    9414              
    9415              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    9416                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    9417                      .dwattr DW$T$30, DW_AT_byte_size(0x02)
    9418              DW$782  .dwtag  DW_TAG_subrange_type
    9419                      .dwattr DW$782, DW_AT_upper_bound(0x01)
    9420                      .dwendtag DW$T$30
    9421              
    9422              
    9423              DW$T$63 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    9424                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    9425                      .dwattr DW$T$63, DW_AT_byte_size(0x04)
    9426              DW$783  .dwtag  DW_TAG_subrange_type
    9427                      .dwattr DW$783, DW_AT_upper_bound(0x03)
    9428                      .dwendtag DW$T$63
    9429              
    9430              
    9431              DW$T$71 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
    9432                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
    9433                      .dwattr DW$T$71, DW_AT_byte_size(0x10)
    9434              DW$784  .dwtag  DW_TAG_subrange_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  187

    9435                      .dwattr DW$784, DW_AT_upper_bound(0x07)
    9436                      .dwendtag DW$T$71
    9437              
    9438              
    9439              DW$T$20 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    9440                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    9441                      .dwattr DW$T$20, DW_AT_byte_size(0x14)
    9442              DW$785  .dwtag  DW_TAG_subrange_type
    9443                      .dwattr DW$785, DW_AT_upper_bound(0x13)
    9444                      .dwendtag DW$T$20
    9445              
    9446              
    9447              DW$T$73 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    9448                      .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    9449                      .dwattr DW$T$73, DW_AT_byte_size(0x08)
    9450              DW$786  .dwtag  DW_TAG_subrange_type
    9451                      .dwattr DW$786, DW_AT_upper_bound(0x07)
    9452                      .dwendtag DW$T$73
    9453              
    9454              
    9455              DW$T$74 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    9456                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    9457                      .dwattr DW$T$74, DW_AT_byte_size(0x03)
    9458              DW$787  .dwtag  DW_TAG_subrange_type
    9459                      .dwattr DW$787, DW_AT_upper_bound(0x02)
    9460                      .dwendtag DW$T$74
    9461              
    9462              
    9463              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$21)
    9464                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    9465                      .dwattr DW$T$22, DW_AT_byte_size(0x14)
    9466              DW$788  .dwtag  DW_TAG_subrange_type
    9467                      .dwattr DW$788, DW_AT_upper_bound(0x00)
    9468                      .dwendtag DW$T$22
    9469              
    9470              DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("F_BOOTRECORD"), DW_AT_type(*DW$T$31)
    9471                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
    9472              DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("F_SECTOR"), DW_AT_type(*DW$T$32)
    9473                      .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    9474              DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$53)
    9475                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    9476              DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("F_CLSPACE"), DW_AT_type(*DW$T$54)
    9477                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    9478              DW$T$70 .dwtag  DW_TAG_typedef, DW_AT_name("t_WrDataCache"), DW_AT_type(*DW$T$68)
    9479                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    9480              
    9481              DW$T$21 .dwtag  DW_TAG_structure_type
    9482                      .dwattr DW$T$21, DW_AT_byte_size(0x14)
    9483              DW$789  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    9484                      .dwattr DW$789, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
    9485                      .dwattr DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9486                      .dwattr DW$789, DW_AT_accessibility(DW_ACCESS_public)
    9487                      .dwendtag DW$T$21
    9488              
    9489              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  188

    9490              DW$T$31 .dwtag  DW_TAG_structure_type
    9491                      .dwattr DW$T$31, DW_AT_byte_size(0x48)
    9492              DW$790  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    9493                      .dwattr DW$790, DW_AT_name("jump_code"), DW_AT_symbol_name("_jump_code")
    9494                      .dwattr DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9495                      .dwattr DW$790, DW_AT_accessibility(DW_ACCESS_public)
    9496              DW$791  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    9497                      .dwattr DW$791, DW_AT_name("OEM_name"), DW_AT_symbol_name("_OEM_name")
    9498                      .dwattr DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9499                      .dwattr DW$791, DW_AT_accessibility(DW_ACCESS_public)
    9500              DW$792  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9501                      .dwattr DW$792, DW_AT_name("bytes_per_sector"), DW_AT_symbol_name("_bytes_per_sector")
    9502                      .dwattr DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9503                      .dwattr DW$792, DW_AT_accessibility(DW_ACCESS_public)
    9504              DW$793  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9505                      .dwattr DW$793, DW_AT_name("sector_per_cluster"), DW_AT_symbol_name("_sector_per_cluster")
    9506                      .dwattr DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9507                      .dwattr DW$793, DW_AT_accessibility(DW_ACCESS_public)
    9508              DW$794  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9509                      .dwattr DW$794, DW_AT_name("reserved_sectors"), DW_AT_symbol_name("_reserved_sectors")
    9510                      .dwattr DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9511                      .dwattr DW$794, DW_AT_accessibility(DW_ACCESS_public)
    9512              DW$795  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9513                      .dwattr DW$795, DW_AT_name("number_of_FATs"), DW_AT_symbol_name("_number_of_FATs")
    9514                      .dwattr DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9515                      .dwattr DW$795, DW_AT_accessibility(DW_ACCESS_public)
    9516              DW$796  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9517                      .dwattr DW$796, DW_AT_name("max_root_entry"), DW_AT_symbol_name("_max_root_entry")
    9518                      .dwattr DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    9519                      .dwattr DW$796, DW_AT_accessibility(DW_ACCESS_public)
    9520              DW$797  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9521                      .dwattr DW$797, DW_AT_name("number_of_sectors_less32"), DW_AT_symbol_name("_number_of_sectors_less32"
    9522                      .dwattr DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9523                      .dwattr DW$797, DW_AT_accessibility(DW_ACCESS_public)
    9524              DW$798  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9525                      .dwattr DW$798, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
    9526                      .dwattr DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    9527                      .dwattr DW$798, DW_AT_accessibility(DW_ACCESS_public)
    9528              DW$799  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9529                      .dwattr DW$799, DW_AT_name("sector_per_FAT"), DW_AT_symbol_name("_sector_per_FAT")
    9530                      .dwattr DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9531                      .dwattr DW$799, DW_AT_accessibility(DW_ACCESS_public)
    9532              DW$800  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9533                      .dwattr DW$800, DW_AT_name("sector_per_Track"), DW_AT_symbol_name("_sector_per_Track")
    9534                      .dwattr DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    9535                      .dwattr DW$800, DW_AT_accessibility(DW_ACCESS_public)
    9536              DW$801  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9537                      .dwattr DW$801, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
    9538                      .dwattr DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9539                      .dwattr DW$801, DW_AT_accessibility(DW_ACCESS_public)
    9540              DW$802  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9541                      .dwattr DW$802, DW_AT_name("number_of_hidden_sectors"), DW_AT_symbol_name("_number_of_hidden_sectors"
    9542                      .dwattr DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9543                      .dwattr DW$802, DW_AT_accessibility(DW_ACCESS_public)
    9544              DW$803  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  189

    9545                      .dwattr DW$803, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
    9546                      .dwattr DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9547                      .dwattr DW$803, DW_AT_accessibility(DW_ACCESS_public)
    9548              DW$804  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9549                      .dwattr DW$804, DW_AT_name("sector_per_FAT32"), DW_AT_symbol_name("_sector_per_FAT32")
    9550                      .dwattr DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9551                      .dwattr DW$804, DW_AT_accessibility(DW_ACCESS_public)
    9552              DW$805  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9553                      .dwattr DW$805, DW_AT_name("extflags"), DW_AT_symbol_name("_extflags")
    9554                      .dwattr DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9555                      .dwattr DW$805, DW_AT_accessibility(DW_ACCESS_public)
    9556              DW$806  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9557                      .dwattr DW$806, DW_AT_name("fsversion"), DW_AT_symbol_name("_fsversion")
    9558                      .dwattr DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    9559                      .dwattr DW$806, DW_AT_accessibility(DW_ACCESS_public)
    9560              DW$807  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9561                      .dwattr DW$807, DW_AT_name("rootcluster"), DW_AT_symbol_name("_rootcluster")
    9562                      .dwattr DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9563                      .dwattr DW$807, DW_AT_accessibility(DW_ACCESS_public)
    9564              DW$808  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9565                      .dwattr DW$808, DW_AT_name("fsinfo"), DW_AT_symbol_name("_fsinfo")
    9566                      .dwattr DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9567                      .dwattr DW$808, DW_AT_accessibility(DW_ACCESS_public)
    9568              DW$809  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9569                      .dwattr DW$809, DW_AT_name("bkbootsec"), DW_AT_symbol_name("_bkbootsec")
    9570                      .dwattr DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    9571                      .dwattr DW$809, DW_AT_accessibility(DW_ACCESS_public)
    9572              DW$810  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    9573                      .dwattr DW$810, DW_AT_name("reserved"), DW_AT_symbol_name("_reserved")
    9574                      .dwattr DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9575                      .dwattr DW$810, DW_AT_accessibility(DW_ACCESS_public)
    9576              DW$811  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9577                      .dwattr DW$811, DW_AT_name("logical_drive_num"), DW_AT_symbol_name("_logical_drive_num")
    9578                      .dwattr DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9579                      .dwattr DW$811, DW_AT_accessibility(DW_ACCESS_public)
    9580              DW$812  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9581                      .dwattr DW$812, DW_AT_name("extended_signature"), DW_AT_symbol_name("_extended_signature")
    9582                      .dwattr DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    9583                      .dwattr DW$812, DW_AT_accessibility(DW_ACCESS_public)
    9584              DW$813  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9585                      .dwattr DW$813, DW_AT_name("serial_number"), DW_AT_symbol_name("_serial_number")
    9586                      .dwattr DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9587                      .dwattr DW$813, DW_AT_accessibility(DW_ACCESS_public)
    9588              DW$814  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    9589                      .dwattr DW$814, DW_AT_name("volume_name"), DW_AT_symbol_name("_volume_name")
    9590                      .dwattr DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9591                      .dwattr DW$814, DW_AT_accessibility(DW_ACCESS_public)
    9592              DW$815  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    9593                      .dwattr DW$815, DW_AT_name("FAT_name"), DW_AT_symbol_name("_FAT_name")
    9594                      .dwattr DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    9595                      .dwattr DW$815, DW_AT_accessibility(DW_ACCESS_public)
    9596              DW$816  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9597                      .dwattr DW$816, DW_AT_name("executable_marker"), DW_AT_symbol_name("_executable_marker")
    9598                      .dwattr DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    9599                      .dwattr DW$816, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  190

    9600                      .dwendtag DW$T$31
    9601              
    9602              
    9603              DW$T$32 .dwtag  DW_TAG_structure_type
    9604                      .dwattr DW$T$32, DW_AT_byte_size(0x04)
    9605              DW$817  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9606                      .dwattr DW$817, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
    9607                      .dwattr DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9608                      .dwattr DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9609              DW$818  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9610                      .dwattr DW$818, DW_AT_name("num"), DW_AT_symbol_name("_num")
    9611                      .dwattr DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9612                      .dwattr DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9613                      .dwendtag DW$T$32
    9614              
    9615              
    9616              DW$T$53 .dwtag  DW_TAG_structure_type
    9617                      .dwattr DW$T$53, DW_AT_byte_size(0x10)
    9618              DW$819  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    9619                      .dwattr DW$819, DW_AT_name("writesector"), DW_AT_symbol_name("_writesector")
    9620                      .dwattr DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9621                      .dwattr DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9622              DW$820  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    9623                      .dwattr DW$820, DW_AT_name("writemultiplesector"), DW_AT_symbol_name("_writemultiplesector")
    9624                      .dwattr DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9625                      .dwattr DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9626              DW$821  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    9627                      .dwattr DW$821, DW_AT_name("readsector"), DW_AT_symbol_name("_readsector")
    9628                      .dwattr DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9629                      .dwattr DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9630              DW$822  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    9631                      .dwattr DW$822, DW_AT_name("readmultiplesector"), DW_AT_symbol_name("_readmultiplesector")
    9632                      .dwattr DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9633                      .dwattr DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9634              DW$823  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    9635                      .dwattr DW$823, DW_AT_name("getphy"), DW_AT_symbol_name("_getphy")
    9636                      .dwattr DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9637                      .dwattr DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9638              DW$824  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    9639                      .dwattr DW$824, DW_AT_name("getstatus"), DW_AT_symbol_name("_getstatus")
    9640                      .dwattr DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9641                      .dwattr DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9642              DW$825  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    9643                      .dwattr DW$825, DW_AT_name("delfunc"), DW_AT_symbol_name("_delfunc")
    9644                      .dwattr DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9645                      .dwattr DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9646              DW$826  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    9647                      .dwattr DW$826, DW_AT_name("user_ptr"), DW_AT_symbol_name("_user_ptr")
    9648                      .dwattr DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9649                      .dwattr DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9650                      .dwendtag DW$T$53
    9651              
    9652              
    9653              DW$T$54 .dwtag  DW_TAG_structure_type
    9654                      .dwattr DW$T$54, DW_AT_byte_size(0x06)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  191

    9655              DW$827  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9656                      .dwattr DW$827, DW_AT_name("clfree"), DW_AT_symbol_name("_clfree")
    9657                      .dwattr DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9658                      .dwattr DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9659              DW$828  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9660                      .dwattr DW$828, DW_AT_name("clused"), DW_AT_symbol_name("_clused")
    9661                      .dwattr DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9662                      .dwattr DW$828, DW_AT_accessibility(DW_ACCESS_public)
    9663              DW$829  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9664                      .dwattr DW$829, DW_AT_name("clbad"), DW_AT_symbol_name("_clbad")
    9665                      .dwattr DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9666                      .dwattr DW$829, DW_AT_accessibility(DW_ACCESS_public)
    9667                      .dwendtag DW$T$54
    9668              
    9669              
    9670              DW$T$68 .dwtag  DW_TAG_structure_type
    9671                      .dwattr DW$T$68, DW_AT_byte_size(0x186)
    9672              DW$830  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9673                      .dwattr DW$830, DW_AT_name("N"), DW_AT_symbol_name("_N")
    9674                      .dwattr DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9675                      .dwattr DW$830, DW_AT_accessibility(DW_ACCESS_public)
    9676              DW$831  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    9677                      .dwattr DW$831, DW_AT_name("ptr"), DW_AT_symbol_name("_ptr")
    9678                      .dwattr DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9679                      .dwattr DW$831, DW_AT_accessibility(DW_ACCESS_public)
    9680              DW$832  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    9681                      .dwattr DW$832, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
    9682                      .dwattr DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9683                      .dwattr DW$832, DW_AT_accessibility(DW_ACCESS_public)
    9684              DW$833  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    9685                      .dwattr DW$833, DW_AT_name("posbuf"), DW_AT_symbol_name("_posbuf")
    9686                      .dwattr DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9687                      .dwattr DW$833, DW_AT_accessibility(DW_ACCESS_public)
    9688                      .dwendtag DW$T$68
    9689              
    9690              
    9691              DW$T$28 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    9692                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    9693                      .dwattr DW$T$28, DW_AT_byte_size(0x0c)
    9694              DW$834  .dwtag  DW_TAG_subrange_type
    9695                      .dwattr DW$834, DW_AT_upper_bound(0x0b)
    9696                      .dwendtag DW$T$28
    9697              
    9698              
    9699              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    9700                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    9701                      .dwattr DW$T$29, DW_AT_byte_size(0x0b)
    9702              DW$835  .dwtag  DW_TAG_subrange_type
    9703                      .dwattr DW$835, DW_AT_upper_bound(0x0a)
    9704                      .dwendtag DW$T$29
    9705              
    9706              DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("F_WRITESECTOR"), DW_AT_type(*DW$T$35)
    9707                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    9708              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("F_READSECTOR"), DW_AT_type(*DW$T$35)
    9709                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  192

    9710              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("F_WRITEMULTIPLESECTOR"), DW_AT_type(*DW$T$38)
    9711                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    9712              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("F_READMULTIPLESECTOR"), DW_AT_type(*DW$T$38)
    9713                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    9714              DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("F_GETPHY"), DW_AT_type(*DW$T$45)
    9715                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    9716              DW$T$52 .dwtag  DW_TAG_typedef, DW_AT_name("F_DELFUNC"), DW_AT_type(*DW$T$51)
    9717                      .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
    9718              DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("F_GETSTATUS"), DW_AT_type(*DW$T$48)
    9719                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
    9720              
    9721              DW$T$67 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$65)
    9722                      .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    9723                      .dwattr DW$T$67, DW_AT_byte_size(0x180)
    9724              DW$836  .dwtag  DW_TAG_subrange_type
    9725                      .dwattr DW$836, DW_AT_upper_bound(0x1f)
    9726                      .dwendtag DW$T$67
    9727              
    9728              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    9729                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    9730              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    9731                      .dwattr DW$T$38, DW_AT_address_class(0x16)
    9732              DW$T$45 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$44)
    9733                      .dwattr DW$T$45, DW_AT_address_class(0x16)
    9734              DW$T$51 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
    9735                      .dwattr DW$T$51, DW_AT_address_class(0x16)
    9736              DW$T$48 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
    9737                      .dwattr DW$T$48, DW_AT_address_class(0x16)
    9738              
    9739              DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    9740                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    9741              DW$837  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    9742              DW$838  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    9743              DW$839  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    9744                      .dwendtag DW$T$34
    9745              
    9746              
    9747              DW$T$37 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    9748                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    9749              DW$840  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    9750              DW$841  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    9751              DW$842  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    9752              DW$843  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    9753                      .dwendtag DW$T$37
    9754              
    9755              
    9756              DW$T$44 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    9757                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
    9758              DW$844  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
    9759              DW$845  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    9760                      .dwendtag DW$T$44
    9761              
    9762              
    9763              DW$T$50 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    9764                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  193

    9765              DW$846  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    9766                      .dwendtag DW$T$50
    9767              
    9768              
    9769              DW$T$47 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    9770                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    9771              DW$847  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    9772                      .dwendtag DW$T$47
    9773              
    9774              DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
    9775                      .dwattr DW$T$43, DW_AT_address_class(0x16)
    9776              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("F_PHY"), DW_AT_type(*DW$T$33)
    9777                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    9778              
    9779              DW$T$33 .dwtag  DW_TAG_structure_type
    9780                      .dwattr DW$T$33, DW_AT_byte_size(0x08)
    9781              DW$848  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9782                      .dwattr DW$848, DW_AT_name("number_of_cylinders"), DW_AT_symbol_name("_number_of_cylinders")
    9783                      .dwattr DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9784                      .dwattr DW$848, DW_AT_accessibility(DW_ACCESS_public)
    9785              DW$849  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9786                      .dwattr DW$849, DW_AT_name("sector_per_track"), DW_AT_symbol_name("_sector_per_track")
    9787                      .dwattr DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9788                      .dwattr DW$849, DW_AT_accessibility(DW_ACCESS_public)
    9789              DW$850  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9790                      .dwattr DW$850, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
    9791                      .dwattr DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9792                      .dwattr DW$850, DW_AT_accessibility(DW_ACCESS_public)
    9793              DW$851  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9794                      .dwattr DW$851, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
    9795                      .dwattr DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9796                      .dwattr DW$851, DW_AT_accessibility(DW_ACCESS_public)
    9797              DW$852  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9798                      .dwattr DW$852, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
    9799                      .dwattr DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9800                      .dwattr DW$852, DW_AT_accessibility(DW_ACCESS_public)
    9801                      .dwendtag DW$T$33
    9802              
    9803              
    9804                      .dwattr DW$407, DW_AT_external(0x01)
    9805                      .dwattr DW$407, DW_AT_type(*DW$T$10)
    9806                      .dwattr DW$108, DW_AT_type(*DW$T$12)
    9807                      .dwattr DW$144, DW_AT_type(*DW$T$12)
    9808                      .dwattr DW$254, DW_AT_external(0x01)
    9809                      .dwattr DW$254, DW_AT_type(*DW$T$10)
    9810                      .dwattr DW$220, DW_AT_type(*DW$T$10)
    9811                      .dwattr DW$289, DW_AT_type(*DW$T$10)
    9812                      .dwattr DW$328, DW_AT_type(*DW$T$10)
    9813                      .dwattr DW$103, DW_AT_external(0x01)
    9814                      .dwattr DW$103, DW_AT_type(*DW$T$10)
    9815                      .dwattr DW$403, DW_AT_type(*DW$T$100)
    9816                      .dwattr DW$185, DW_AT_type(*DW$T$10)
    9817                      .dwattr DW$155, DW_AT_type(*DW$T$10)
    9818                      .dwattr DW$106, DW_AT_external(0x01)
    9819                      .dwattr DW$106, DW_AT_type(*DW$T$10)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:14 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat.asm                                                              PAGE  194

    9820                      .dwattr DW$388, DW_AT_external(0x01)
    9821                      .dwattr DW$388, DW_AT_type(*DW$T$10)
    9822                      .dwattr DW$477, DW_AT_external(0x01)
    9823                      .dwattr DW$477, DW_AT_type(*DW$T$10)
    9824                      .dwattr DW$460, DW_AT_external(0x01)
    9825                      .dwattr DW$460, DW_AT_type(*DW$T$12)
    9826                      .dwattr DW$377, DW_AT_external(0x01)
    9827                      .dwattr DW$377, DW_AT_type(*DW$T$10)
    9828                      .dwattr DW$381, DW_AT_external(0x01)
    9829                      .dwattr DW$381, DW_AT_type(*DW$T$10)
    9830                      .dwattr DW$480, DW_AT_external(0x01)
    9831                      .dwattr DW$480, DW_AT_type(*DW$T$10)
    9832                      .dwattr DW$370, DW_AT_external(0x01)
    9833                      .dwattr DW$370, DW_AT_type(*DW$T$10)
    9834                      .dwattr DW$362, DW_AT_external(0x01)
    9835                      .dwattr DW$362, DW_AT_type(*DW$T$10)
    9836                      .dwattr DW$501, DW_AT_external(0x01)
    9837                      .dwattr DW$501, DW_AT_type(*DW$T$10)
    9838                      .dwattr DW$472, DW_AT_external(0x01)
    9839                      .dwattr DW$472, DW_AT_type(*DW$T$10)
    9840                      .dwattr DW$446, DW_AT_external(0x01)
    9841                      .dwattr DW$446, DW_AT_type(*DW$T$10)
    9842                      .dwattr DW$463, DW_AT_external(0x01)
    9843                      .dwattr DW$463, DW_AT_type(*DW$T$210)
    9844                      .dwattr DW$395, DW_AT_external(0x01)
    9845                      .dwattr DW$395, DW_AT_type(*DW$T$10)
    9846                      .dwattr DW$488, DW_AT_external(0x01)
    9847                      .dwattr DW$488, DW_AT_type(*DW$T$10)
    9848                      .dwattr DW$484, DW_AT_external(0x01)
    9849                      .dwattr DW$484, DW_AT_type(*DW$T$10)
    9850                      .dwattr DW$530, DW_AT_external(0x01)
    9851                      .dwattr DW$530, DW_AT_type(*DW$T$10)
    9852                      .dwattr DW$467, DW_AT_external(0x01)
    9853                      .dwattr DW$467, DW_AT_type(*DW$T$10)
    9854                      .dwattr DW$559, DW_AT_external(0x01)
    9855                      .dwattr DW$559, DW_AT_type(*DW$T$210)
