TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:15 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("fat_m.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$3)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    3493              DW$T$179        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$95)
    3494                      .dwattr DW$T$179, DW_AT_language(DW_LANG_C)
    3495              DW$T$107        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$106)
    3496                      .dwattr DW$T$107, DW_AT_address_class(0x16)
    3497              DW$T$63 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$62)
    3498                      .dwattr DW$T$63, DW_AT_address_class(0x16)
    3499              DW$T$140        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    3500                      .dwattr DW$T$140, DW_AT_address_class(0x16)
    3501              
    3502              DW$T$182        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$62)
    3503                      .dwattr DW$T$182, DW_AT_language(DW_LANG_C)
    3504                      .dwattr DW$T$182, DW_AT_byte_size(0x1a)
    3505              DW$395  .dwtag  DW_TAG_subrange_type
    3506                      .dwattr DW$395, DW_AT_upper_bound(0x00)
    3507                      .dwendtag DW$T$182
    3508              
    3509              DW$T$103        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$102)
    3510                      .dwattr DW$T$103, DW_AT_address_class(0x16)
    3511              DW$T$111        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$110)
    3512                      .dwattr DW$T$111, DW_AT_address_class(0x16)
    3513              DW$T$119        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$118)
    3514                      .dwattr DW$T$119, DW_AT_address_class(0x16)
    3515              
    3516              DW$T$192        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$119)
    3517                      .dwattr DW$T$192, DW_AT_language(DW_LANG_C)
    3518              DW$396  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$63)
    3519              DW$397  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
    3520              DW$398  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
    3521                      .dwendtag DW$T$192
    3522              
    3523              
    3524              DW$T$193        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$119)
    3525                      .dwattr DW$T$193, DW_AT_language(DW_LANG_C)
    3526              DW$399  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$63)
    3527              DW$400  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
    3528              DW$401  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    3529                      .dwendtag DW$T$193
    3530              
    3531              
    3532              DW$T$194        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$119)
    3533                      .dwattr DW$T$194, DW_AT_language(DW_LANG_C)
    3534              DW$402  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE   68

    3535              DW$403  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
    3536                      .dwendtag DW$T$194
    3537              
    3538              
    3539              DW$T$195        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$119)
    3540                      .dwattr DW$T$195, DW_AT_language(DW_LANG_C)
    3541              DW$404  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$107)
    3542              DW$405  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    3543                      .dwendtag DW$T$195
    3544              
    3545              DW$406  .dwtag  DW_TAG_far_type
    3546              DW$T$59 .dwtag  DW_TAG_const_type
    3547                      .dwattr DW$T$59, DW_AT_type(*DW$406)
    3548              DW$T$79 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$78)
    3549                      .dwattr DW$T$79, DW_AT_address_class(0x16)
    3550              DW$T$19 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    3551                      .dwattr DW$T$19, DW_AT_encoding(DW_ATE_signed_char)
    3552                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    3553              DW$407  .dwtag  DW_TAG_far_type
    3554                      .dwattr DW$407, DW_AT_type(*DW$T$19)
    3555              DW$T$106        .dwtag  DW_TAG_const_type
    3556                      .dwattr DW$T$106, DW_AT_type(*DW$407)
    3557              DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("F_MULTI"), DW_AT_type(*DW$T$24)
    3558                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    3559              DW$T$102        .dwtag  DW_TAG_typedef, DW_AT_name("F_SPACE"), DW_AT_type(*DW$T$46)
    3560                      .dwattr DW$T$102, DW_AT_language(DW_LANG_C)
    3561              DW$T$110        .dwtag  DW_TAG_typedef, DW_AT_name("F_FIND"), DW_AT_type(*DW$T$53)
    3562                      .dwattr DW$T$110, DW_AT_language(DW_LANG_C)
    3563              DW$T$118        .dwtag  DW_TAG_typedef, DW_AT_name("F_FILE"), DW_AT_type(*DW$T$54)
    3564                      .dwattr DW$T$118, DW_AT_language(DW_LANG_C)
    3565              
    3566              DW$T$78 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    3567                      .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
    3568              DW$408  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$77)
    3569              DW$409  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3570                      .dwendtag DW$T$78
    3571              
    3572              
    3573              DW$T$24 .dwtag  DW_TAG_structure_type
    3574                      .dwattr DW$T$24, DW_AT_byte_size(0x1a)
    3575              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3576                      .dwattr DW$410, DW_AT_name("ID"), DW_AT_symbol_name("_ID")
    3577                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3578                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3579              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3580                      .dwattr DW$411, DW_AT_name("f_curdrive"), DW_AT_symbol_name("_f_curdrive")
    3581                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3582                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3583              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3584                      .dwattr DW$412, DW_AT_name("f_vols"), DW_AT_symbol_name("_f_vols")
    3585                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3586                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3587              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3588                      .dwattr DW$413, DW_AT_name("pmutex"), DW_AT_symbol_name("_pmutex")
    3589                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE   69

    3590                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3591                      .dwendtag DW$T$24
    3592              
    3593              DW$T$77 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
    3594                      .dwattr DW$T$77, DW_AT_address_class(0x16)
    3595              
    3596              DW$T$46 .dwtag  DW_TAG_structure_type
    3597                      .dwattr DW$T$46, DW_AT_byte_size(0x10)
    3598              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3599                      .dwattr DW$414, DW_AT_name("total"), DW_AT_symbol_name("_total")
    3600                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3601                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3602              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3603                      .dwattr DW$415, DW_AT_name("free"), DW_AT_symbol_name("_free")
    3604                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3605                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3606              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3607                      .dwattr DW$416, DW_AT_name("used"), DW_AT_symbol_name("_used")
    3608                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3609                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3610              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3611                      .dwattr DW$417, DW_AT_name("bad"), DW_AT_symbol_name("_bad")
    3612                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3613                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3614              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3615                      .dwattr DW$418, DW_AT_name("total_high"), DW_AT_symbol_name("_total_high")
    3616                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3617                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3618              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3619                      .dwattr DW$419, DW_AT_name("free_high"), DW_AT_symbol_name("_free_high")
    3620                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3621                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3622              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3623                      .dwattr DW$420, DW_AT_name("used_high"), DW_AT_symbol_name("_used_high")
    3624                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3625                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3626              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3627                      .dwattr DW$421, DW_AT_name("bad_high"), DW_AT_symbol_name("_bad_high")
    3628                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3629                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3630                      .dwendtag DW$T$46
    3631              
    3632              
    3633              DW$T$53 .dwtag  DW_TAG_structure_type
    3634                      .dwattr DW$T$53, DW_AT_byte_size(0x52)
    3635              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3636                      .dwattr DW$422, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
    3637                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3638                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3639              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3640                      .dwattr DW$423, DW_AT_name("name"), DW_AT_symbol_name("_name")
    3641                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3642                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3643              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3644                      .dwattr DW$424, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE   70

    3645                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3646                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3647              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3648                      .dwattr DW$425, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
    3649                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3650                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3651              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3652                      .dwattr DW$426, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
    3653                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3654                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3655              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3656                      .dwattr DW$427, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
    3657                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3658                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3659              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3660                      .dwattr DW$428, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
    3661                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3662                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3663              DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3664                      .dwattr DW$429, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
    3665                      .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3666                      .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3667              DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3668                      .dwattr DW$430, DW_AT_name("findfsname"), DW_AT_symbol_name("_findfsname")
    3669                      .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3670                      .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3671              DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    3672                      .dwattr DW$431, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
    3673                      .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3674                      .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3675                      .dwendtag DW$T$53
    3676              
    3677              
    3678              DW$T$54 .dwtag  DW_TAG_structure_type
    3679                      .dwattr DW$T$54, DW_AT_byte_size(0x02)
    3680              DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    3681                      .dwattr DW$432, DW_AT_name("reference"), DW_AT_symbol_name("_reference")
    3682                      .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3683                      .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3684                      .dwendtag DW$T$54
    3685              
    3686              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
    3687                      .dwattr DW$T$23, DW_AT_address_class(0x16)
    3688              
    3689              DW$T$20 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3690                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    3691                      .dwattr DW$T$20, DW_AT_byte_size(0x14)
    3692              DW$433  .dwtag  DW_TAG_subrange_type
    3693                      .dwattr DW$433, DW_AT_upper_bound(0x13)
    3694                      .dwendtag DW$T$20
    3695              
    3696              
    3697              DW$T$47 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3698                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    3699                      .dwattr DW$T$47, DW_AT_byte_size(0x08)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE   71

    3700              DW$434  .dwtag  DW_TAG_subrange_type
    3701                      .dwattr DW$434, DW_AT_upper_bound(0x07)
    3702                      .dwendtag DW$T$47
    3703              
    3704              
    3705              DW$T$48 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3706                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    3707                      .dwattr DW$T$48, DW_AT_byte_size(0x03)
    3708              DW$435  .dwtag  DW_TAG_subrange_type
    3709                      .dwattr DW$435, DW_AT_upper_bound(0x02)
    3710                      .dwendtag DW$T$48
    3711              
    3712              
    3713              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$21)
    3714                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    3715                      .dwattr DW$T$22, DW_AT_byte_size(0x14)
    3716              DW$436  .dwtag  DW_TAG_subrange_type
    3717                      .dwattr DW$436, DW_AT_upper_bound(0x00)
    3718                      .dwendtag DW$T$22
    3719              
    3720              DW$T$76 .dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$45)
    3721                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    3722              DW$T$51 .dwtag  DW_TAG_typedef, DW_AT_name("F_NAME"), DW_AT_type(*DW$T$49)
    3723                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
    3724              DW$T$52 .dwtag  DW_TAG_typedef, DW_AT_name("F_POS"), DW_AT_type(*DW$T$50)
    3725                      .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
    3726              
    3727              DW$T$21 .dwtag  DW_TAG_structure_type
    3728                      .dwattr DW$T$21, DW_AT_byte_size(0x14)
    3729              DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3730                      .dwattr DW$437, DW_AT_name("cwd"), DW_AT_symbol_name("_cwd")
    3731                      .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3732                      .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3733                      .dwendtag DW$T$21
    3734              
    3735              
    3736              DW$T$45 .dwtag  DW_TAG_structure_type
    3737                      .dwattr DW$T$45, DW_AT_byte_size(0x10)
    3738              DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3739                      .dwattr DW$438, DW_AT_name("writesector"), DW_AT_symbol_name("_writesector")
    3740                      .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3741                      .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3742              DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3743                      .dwattr DW$439, DW_AT_name("writemultiplesector"), DW_AT_symbol_name("_writemultiplesector")
    3744                      .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3745                      .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3746              DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    3747                      .dwattr DW$440, DW_AT_name("readsector"), DW_AT_symbol_name("_readsector")
    3748                      .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3749                      .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3750              DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    3751                      .dwattr DW$441, DW_AT_name("readmultiplesector"), DW_AT_symbol_name("_readmultiplesector")
    3752                      .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3753                      .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3754              DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE   72

    3755                      .dwattr DW$442, DW_AT_name("getphy"), DW_AT_symbol_name("_getphy")
    3756                      .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3757                      .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3758              DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3759                      .dwattr DW$443, DW_AT_name("getstatus"), DW_AT_symbol_name("_getstatus")
    3760                      .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3761                      .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3762              DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3763                      .dwattr DW$444, DW_AT_name("delfunc"), DW_AT_symbol_name("_delfunc")
    3764                      .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3765                      .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3766              DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    3767                      .dwattr DW$445, DW_AT_name("user_ptr"), DW_AT_symbol_name("_user_ptr")
    3768                      .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3769                      .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3770                      .dwendtag DW$T$45
    3771              
    3772              
    3773              DW$T$49 .dwtag  DW_TAG_structure_type
    3774                      .dwattr DW$T$49, DW_AT_byte_size(0x20)
    3775              DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3776                      .dwattr DW$446, DW_AT_name("drivenum"), DW_AT_symbol_name("_drivenum")
    3777                      .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3778                      .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3779              DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3780                      .dwattr DW$447, DW_AT_name("path"), DW_AT_symbol_name("_path")
    3781                      .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3782                      .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3783              DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3784                      .dwattr DW$448, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
    3785                      .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3786                      .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3787              DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3788                      .dwattr DW$449, DW_AT_name("fileext"), DW_AT_symbol_name("_fileext")
    3789                      .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3790                      .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3791                      .dwendtag DW$T$49
    3792              
    3793              
    3794              DW$T$50 .dwtag  DW_TAG_structure_type
    3795                      .dwattr DW$T$50, DW_AT_byte_size(0x0c)
    3796              DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3797                      .dwattr DW$450, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
    3798                      .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3799                      .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3800              DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3801                      .dwattr DW$451, DW_AT_name("prevcluster"), DW_AT_symbol_name("_prevcluster")
    3802                      .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3803                      .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3804              DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3805                      .dwattr DW$452, DW_AT_name("sectorbegin"), DW_AT_symbol_name("_sectorbegin")
    3806                      .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3807                      .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3808              DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3809                      .dwattr DW$453, DW_AT_name("sector"), DW_AT_symbol_name("_sector")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE   73

    3810                      .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3811                      .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3812              DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3813                      .dwattr DW$454, DW_AT_name("sectorend"), DW_AT_symbol_name("_sectorend")
    3814                      .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3815                      .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3816              DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3817                      .dwattr DW$455, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
    3818                      .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3819                      .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3820                      .dwendtag DW$T$50
    3821              
    3822              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("F_WRITESECTOR"), DW_AT_type(*DW$T$27)
    3823                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    3824              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("F_READSECTOR"), DW_AT_type(*DW$T$27)
    3825                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    3826              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("F_WRITEMULTIPLESECTOR"), DW_AT_type(*DW$T$30)
    3827                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    3828              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("F_READMULTIPLESECTOR"), DW_AT_type(*DW$T$30)
    3829                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    3830              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("F_GETPHY"), DW_AT_type(*DW$T$37)
    3831                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    3832              DW$T$44 .dwtag  DW_TAG_typedef, DW_AT_name("F_DELFUNC"), DW_AT_type(*DW$T$43)
    3833                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
    3834              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("F_GETSTATUS"), DW_AT_type(*DW$T$40)
    3835                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    3836              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    3837                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    3838              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    3839                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    3840              DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
    3841                      .dwattr DW$T$37, DW_AT_address_class(0x16)
    3842              DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
    3843                      .dwattr DW$T$43, DW_AT_address_class(0x16)
    3844              DW$T$40 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$39)
    3845                      .dwattr DW$T$40, DW_AT_address_class(0x16)
    3846              
    3847              DW$T$26 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    3848                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    3849              DW$456  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3850              DW$457  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    3851              DW$458  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3852                      .dwendtag DW$T$26
    3853              
    3854              
    3855              DW$T$29 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    3856                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    3857              DW$459  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3858              DW$460  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    3859              DW$461  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    3860              DW$462  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3861                      .dwendtag DW$T$29
    3862              
    3863              
    3864              DW$T$36 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE   74

    3865                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    3866              DW$463  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
    3867              DW$464  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3868                      .dwendtag DW$T$36
    3869              
    3870              
    3871              DW$T$42 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    3872                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    3873              DW$465  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3874                      .dwendtag DW$T$42
    3875              
    3876              
    3877              DW$T$39 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
    3878                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    3879              DW$466  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3880                      .dwendtag DW$T$39
    3881              
    3882              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    3883                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    3884              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("F_PHY"), DW_AT_type(*DW$T$25)
    3885                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    3886              
    3887              DW$T$25 .dwtag  DW_TAG_structure_type
    3888                      .dwattr DW$T$25, DW_AT_byte_size(0x08)
    3889              DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3890                      .dwattr DW$467, DW_AT_name("number_of_cylinders"), DW_AT_symbol_name("_number_of_cylinders")
    3891                      .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3892                      .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3893              DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3894                      .dwattr DW$468, DW_AT_name("sector_per_track"), DW_AT_symbol_name("_sector_per_track")
    3895                      .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3896                      .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3897              DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3898                      .dwattr DW$469, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
    3899                      .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3900                      .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3901              DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3902                      .dwattr DW$470, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
    3903                      .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3904                      .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3905              DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3906                      .dwattr DW$471, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
    3907                      .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3908                      .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3909                      .dwendtag DW$T$25
    3910              
    3911              
    3912                      .dwattr DW$187, DW_AT_external(0x01)
    3913                      .dwattr DW$187, DW_AT_type(*DW$T$10)
    3914                      .dwattr DW$181, DW_AT_external(0x01)
    3915                      .dwattr DW$181, DW_AT_type(*DW$T$10)
    3916                      .dwattr DW$161, DW_AT_external(0x01)
    3917                      .dwattr DW$161, DW_AT_type(*DW$T$10)
    3918                      .dwattr DW$203, DW_AT_external(0x01)
    3919                      .dwattr DW$203, DW_AT_type(*DW$T$10)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:15 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
fat_m.asm                                                            PAGE   75

    3920                      .dwattr DW$243, DW_AT_external(0x01)
    3921                      .dwattr DW$243, DW_AT_type(*DW$T$10)
    3922                      .dwattr DW$163, DW_AT_external(0x01)
    3923                      .dwattr DW$163, DW_AT_type(*DW$T$10)
    3924                      .dwattr DW$233, DW_AT_external(0x01)
    3925                      .dwattr DW$233, DW_AT_type(*DW$T$10)
    3926                      .dwattr DW$201, DW_AT_external(0x01)
    3927                      .dwattr DW$201, DW_AT_type(*DW$T$12)
    3928                      .dwattr DW$193, DW_AT_external(0x01)
    3929                      .dwattr DW$193, DW_AT_type(*DW$T$10)
    3930                      .dwattr DW$196, DW_AT_external(0x01)
    3931                      .dwattr DW$196, DW_AT_type(*DW$T$10)
    3932                      .dwattr DW$205, DW_AT_external(0x01)
    3933                      .dwattr DW$205, DW_AT_type(*DW$T$10)
    3934                      .dwattr DW$171, DW_AT_external(0x01)
    3935                      .dwattr DW$171, DW_AT_type(*DW$T$10)
    3936                      .dwattr DW$261, DW_AT_external(0x01)
    3937                      .dwattr DW$261, DW_AT_type(*DW$T$10)
    3938                      .dwattr DW$165, DW_AT_external(0x01)
    3939                      .dwattr DW$165, DW_AT_type(*DW$T$10)
    3940                      .dwattr DW$166, DW_AT_external(0x01)
    3941                      .dwattr DW$166, DW_AT_type(*DW$T$10)
    3942                      .dwattr DW$245, DW_AT_external(0x01)
    3943                      .dwattr DW$245, DW_AT_type(*DW$T$10)
    3944                      .dwattr DW$226, DW_AT_external(0x01)
    3945                      .dwattr DW$226, DW_AT_type(*DW$T$10)
    3946                      .dwattr DW$174, DW_AT_external(0x01)
    3947                      .dwattr DW$174, DW_AT_type(*DW$T$10)
    3948                      .dwattr DW$177, DW_AT_external(0x01)
    3949                      .dwattr DW$177, DW_AT_type(*DW$T$10)
    3950                      .dwattr DW$183, DW_AT_external(0x01)
    3951                      .dwattr DW$183, DW_AT_type(*DW$T$10)
    3952                      .dwattr DW$184, DW_AT_external(0x01)
    3953                      .dwattr DW$184, DW_AT_type(*DW$T$10)
    3954                      .dwattr DW$251, DW_AT_external(0x01)
    3955                      .dwattr DW$251, DW_AT_type(*DW$T$10)
    3956                      .dwattr DW$235, DW_AT_external(0x01)
    3957                      .dwattr DW$235, DW_AT_type(*DW$T$10)
    3958                      .dwattr DW$156, DW_AT_external(0x01)
    3959                      .dwattr DW$156, DW_AT_type(*DW$T$95)
    3960                      .dwattr DW$168, DW_AT_external(0x01)
    3961                      .dwattr DW$168, DW_AT_type(*DW$T$10)
    3962                      .dwattr DW$157, DW_AT_external(0x01)
    3963                      .dwattr DW$157, DW_AT_type(*DW$T$10)
