TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:17 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
logging.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:17 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("logging.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("SDEventLogDelete"), DW_AT_symbol_name("_SDEventLogDelete")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$10)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)

     471 0000005e 9A00          MOVB      AL,#0
     472 0000005f 56CF          BF        L7,UNC                ; |300| 
         00000060 0005 
     473                      ; branch occurs ; |300| 
     474 00000061       L6:    
     475 00000061 8F00!         MOVL      XAR4,#_transferbuffer ; |300| 
         00000062 0000 
     476 00000063 9294          MOV       AL,*+XAR4[AR0]        ; |300| 
     477              L7:    
     478                      .dwpsn  "logging.c",303,1
     479 00000064 0006          LRETR
     480                      ; return occurs
     481                      .dwattr DW$26, DW_AT_end_file("logging.c")
     482                      .dwattr DW$26, DW_AT_end_line(0x12f)
     483                      .dwattr DW$26, DW_AT_end_column(0x01)
     484                      .dwendtag DW$26
     485              
     486              ;***************************************************************
     487              ;* UNDEFINED EXTERNAL REFERENCES                               *
     488              ;***************************************************************
     489                      .global _SDEventLogDelete
     490                      .global _SDReadEvent
     491                      .global _WriteNVMemory
     492                      .global _ReadNVMemory
     493                      .global _ClearEventCodeListArea
     494                      .global _settings
     495                      .global _transferbuffer
     496              
     497              ;***************************************************************
     498              ;* TYPE INFORMATION                                            *
     499              ;***************************************************************
     500              
     501              DW$T$28 .dwtag  DW_TAG_subroutine_type
     502                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     503              
     504              DW$T$30 .dwtag  DW_TAG_subroutine_type
     505                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     506              DW$28   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     507                      .dwendtag DW$T$30
     508              
     509              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     510                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     511                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     512              
     513              DW$T$31 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     514                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     515              
     516              DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     517                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:17 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
logging.asm                                                          PAGE   11

     518              DW$29   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     519              DW$30   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
     520                      .dwendtag DW$T$34
     521              
     522              
     523              DW$T$36 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     524                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     525              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     526                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     527                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     528              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
     529                      .dwattr DW$T$33, DW_AT_address_class(0x16)
     530              
     531              DW$T$38 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
     532                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     533              
     534              DW$T$39 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
     535                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     536              DW$31   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     537                      .dwendtag DW$T$39
     538              
     539              
     540              DW$T$40 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     541                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     542                      .dwattr DW$T$40, DW_AT_byte_size(0x80)
     543              DW$32   .dwtag  DW_TAG_subrange_type
     544                      .dwattr DW$32, DW_AT_upper_bound(0x7f)
     545                      .dwendtag DW$T$40
     546              
     547              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$20)
     548                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     549              DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("loggingstruct"), DW_AT_type(*DW$T$21)
     550                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     551              DW$T$44 .dwtag  DW_TAG_typedef, DW_AT_name("eventlogvarsstruct"), DW_AT_type(*DW$T$22)
     552                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     553              DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("eventlogstruct"), DW_AT_type(*DW$T$27)
     554                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     555              
     556              DW$T$20 .dwtag  DW_TAG_structure_type
     557                      .dwattr DW$T$20, DW_AT_name("tag_settingsstruct")
     558                      .dwattr DW$T$20, DW_AT_byte_size(0x24)
     559              DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     560                      .dwattr DW$33, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
     561                      .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     563              DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     564                      .dwattr DW$34, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
     565                      .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     566                      .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     567              DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     568                      .dwattr DW$35, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
     569                      .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     570                      .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     571              DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     572                      .dwattr DW$36, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:17 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
logging.asm                                                          PAGE   12

     573                      .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     574                      .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     575              DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     576                      .dwattr DW$37, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
     577                      .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     578                      .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     579              DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     580                      .dwattr DW$38, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
     581                      .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     582                      .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     583              DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     584                      .dwattr DW$39, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
     585                      .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     586                      .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     587              DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     588                      .dwattr DW$40, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
     589                      .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     590                      .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     591              DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     592                      .dwattr DW$41, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
     593                      .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     594                      .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     595              DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     596                      .dwattr DW$42, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
     597                      .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     598                      .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     599              DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     600                      .dwattr DW$43, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
     601                      .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     602                      .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     603              DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     604                      .dwattr DW$44, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
     605                      .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     606                      .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     607              DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     608                      .dwattr DW$45, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
     609                      .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     610                      .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     611              DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     612                      .dwattr DW$46, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
     613                      .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     614                      .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     615              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     616                      .dwattr DW$47, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
     617                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     618                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     619              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     620                      .dwattr DW$48, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
     621                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     622                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     623              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     624                      .dwattr DW$49, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
     625                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     626                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     627              DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:17 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
logging.asm                                                          PAGE   13

     628                      .dwattr DW$50, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
     629                      .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     630                      .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     631              DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     632                      .dwattr DW$51, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
     633                      .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     634                      .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     635              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     636                      .dwattr DW$52, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
     637                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     638                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     639              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     640                      .dwattr DW$53, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
     641                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     642                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     643              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     644                      .dwattr DW$54, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
     645                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     646                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     647              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     648                      .dwattr DW$55, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
     649                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     650                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     651              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     652                      .dwattr DW$56, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
     653                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     654                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     655              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     656                      .dwattr DW$57, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
     657                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     658                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     659              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     660                      .dwattr DW$58, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
     661                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     662                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     663              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     664                      .dwattr DW$59, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
     665                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     666                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     667              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     668                      .dwattr DW$60, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
     669                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     670                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     671              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     672                      .dwattr DW$61, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
     673                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     674                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     675              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     676                      .dwattr DW$62, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
     677                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     678                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     679              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     680                      .dwattr DW$63, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
     681                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     682                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:17 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
logging.asm                                                          PAGE   14

     683              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     684                      .dwattr DW$64, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
     685                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     686                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     687              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     688                      .dwattr DW$65, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
     689                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     690                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     691              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     692                      .dwattr DW$66, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
     693                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     694                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     695              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     696                      .dwattr DW$67, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
     697                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     698                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     699                      .dwendtag DW$T$20
     700              
     701              
     702              DW$T$21 .dwtag  DW_TAG_structure_type
     703                      .dwattr DW$T$21, DW_AT_name("tag_loggingstruct")
     704                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
     705              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     706                      .dwattr DW$68, DW_AT_name("nothing"), DW_AT_symbol_name("_nothing")
     707                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     708                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     709                      .dwendtag DW$T$21
     710              
     711              
     712              DW$T$22 .dwtag  DW_TAG_structure_type
     713                      .dwattr DW$T$22, DW_AT_name("tag_eventlogvarsstruct")
     714                      .dwattr DW$T$22, DW_AT_byte_size(0x03)
     715              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     716                      .dwattr DW$69, DW_AT_name("eventlogid"), DW_AT_symbol_name("_eventlogid")
     717                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     718                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     719              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     720                      .dwattr DW$70, DW_AT_name("msgqueue"), DW_AT_symbol_name("_msgqueue")
     721                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     722                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     723              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     724                      .dwattr DW$71, DW_AT_name("eventlogwrapflag"), DW_AT_symbol_name("_eventlogwrapflag")
     725                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     726                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     727                      .dwendtag DW$T$22
     728              
     729              
     730              DW$T$27 .dwtag  DW_TAG_structure_type
     731                      .dwattr DW$T$27, DW_AT_name("tag_eventlogstruct")
     732                      .dwattr DW$T$27, DW_AT_byte_size(0x44)
     733              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     734                      .dwattr DW$72, DW_AT_name("eventid"), DW_AT_symbol_name("_eventid")
     735                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     737              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:17 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
logging.asm                                                          PAGE   15

     738                      .dwattr DW$73, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
     739                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     740                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     741              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     742                      .dwattr DW$74, DW_AT_name("msgstring"), DW_AT_symbol_name("_msgstring")
     743                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     744                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     745              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     746                      .dwattr DW$75, DW_AT_name("msgstring2"), DW_AT_symbol_name("_msgstring2")
     747                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     748                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     749              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     750                      .dwattr DW$76, DW_AT_name("ackdatetime"), DW_AT_symbol_name("_ackdatetime")
     751                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
     752                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     753              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     754                      .dwattr DW$77, DW_AT_name("ackstring"), DW_AT_symbol_name("_ackstring")
     755                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     756                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     757              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     758                      .dwattr DW$78, DW_AT_name("newalarmeventflag"), DW_AT_symbol_name("_newalarmeventflag")
     759                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
     760                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     761              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     762                      .dwattr DW$79, DW_AT_name("eventcodestatus"), DW_AT_symbol_name("_eventcodestatus")
     763                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     764                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     765              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     766                      .dwattr DW$80, DW_AT_name("eventcode"), DW_AT_symbol_name("_eventcode")
     767                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
     768                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     769              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     770                      .dwattr DW$81, DW_AT_name("currentindex"), DW_AT_symbol_name("_currentindex")
     771                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     772                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     773              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     774                      .dwattr DW$82, DW_AT_name("txalarmevents"), DW_AT_symbol_name("_txalarmevents")
     775                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
     776                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     777                      .dwendtag DW$T$27
     778              
     779              
     780              DW$T$23 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     781                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     782                      .dwattr DW$T$23, DW_AT_byte_size(0x09)
     783              DW$83   .dwtag  DW_TAG_subrange_type
     784                      .dwattr DW$83, DW_AT_upper_bound(0x08)
     785                      .dwendtag DW$T$23
     786              
     787              
     788              DW$T$24 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     789                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     790                      .dwattr DW$T$24, DW_AT_byte_size(0x18)
     791              DW$84   .dwtag  DW_TAG_subrange_type
     792                      .dwattr DW$84, DW_AT_upper_bound(0x17)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:17 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
logging.asm                                                          PAGE   16

     793                      .dwendtag DW$T$24
     794              
     795              
     796              DW$T$25 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     797                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
     798                      .dwattr DW$T$25, DW_AT_byte_size(0x0f)
     799              DW$85   .dwtag  DW_TAG_subrange_type
     800                      .dwattr DW$85, DW_AT_upper_bound(0x0e)
     801                      .dwendtag DW$T$25
     802              
     803              
     804              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     805                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     806                      .dwattr DW$T$26, DW_AT_byte_size(0x05)
     807              DW$86   .dwtag  DW_TAG_subrange_type
     808                      .dwattr DW$86, DW_AT_upper_bound(0x04)
     809                      .dwendtag DW$T$26
     810              
     811              
     812              DW$T$19 .dwtag  DW_TAG_structure_type
     813                      .dwattr DW$T$19, DW_AT_byte_size(0x02)
     814              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     815                      .dwattr DW$87, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
     816                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     818              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     819                      .dwattr DW$88, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
     820                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     821                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     822                      .dwendtag DW$T$19
     823              
     824              
     825                      .dwattr DW$18, DW_AT_external(0x01)
     826                      .dwattr DW$15, DW_AT_external(0x01)
     827                      .dwattr DW$16, DW_AT_external(0x01)
     828                      .dwattr DW$26, DW_AT_external(0x01)
     829                      .dwattr DW$26, DW_AT_type(*DW$T$11)
     830                      .dwattr DW$19, DW_AT_external(0x01)
     831                      .dwattr DW$19, DW_AT_type(*DW$T$11)
     832                      .dwattr DW$14, DW_AT_external(0x01)
     833                      .dwattr DW$21, DW_AT_external(0x01)
     834                      .dwattr DW$21, DW_AT_type(*DW$T$11)
     835                      .dwattr DW$20, DW_AT_external(0x01)
     836                      .dwattr DW$20, DW_AT_type(*DW$T$11)
     837                      .dwattr DW$22, DW_AT_external(0x01)
     838                      .dwattr DW$13, DW_AT_external(0x01)
     839                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     840              
     841              ;***************************************************************
     842              ;* DWARF REGISTER MAP                                          *
     843              ;***************************************************************
     844              
     845              DW$89   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     846                      .dwattr DW$89, DW_AT_location[DW_OP_reg0]
     847              DW$90   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:17 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
logging.asm                                                          PAGE   17

     848                      .dwattr DW$90, DW_AT_location[DW_OP_reg1]
     849              DW$91   .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
     850                      .dwattr DW$91, DW_AT_location[DW_OP_reg2]
     851              DW$92   .dwtag  DW_TAG_assign_register, DW_AT_name("PH")
     852                      .dwattr DW$92, DW_AT_location[DW_OP_reg3]
     853              DW$93   .dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
     854                      .dwattr DW$93, DW_AT_location[DW_OP_reg4]
     855              DW$94   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
     856                      .dwattr DW$94, DW_AT_location[DW_OP_reg5]
     857              DW$95   .dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
     858                      .dwattr DW$95, DW_AT_location[DW_OP_reg6]
     859              DW$96   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
     860                      .dwattr DW$96, DW_AT_location[DW_OP_reg7]
     861              DW$97   .dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
     862                      .dwattr DW$97, DW_AT_location[DW_OP_reg8]
     863              DW$98   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
     864                      .dwattr DW$98, DW_AT_location[DW_OP_reg9]
     865              DW$99   .dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
     866                      .dwattr DW$99, DW_AT_location[DW_OP_reg10]
     867              DW$100  .dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
     868                      .dwattr DW$100, DW_AT_location[DW_OP_reg11]
     869              DW$101  .dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
     870                      .dwattr DW$101, DW_AT_location[DW_OP_reg12]
     871              DW$102  .dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
     872                      .dwattr DW$102, DW_AT_location[DW_OP_reg13]
