TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Sep 14 09:00:56 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("man.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

   12247              DW$T$172        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$171)
   12248                      .dwattr DW$T$172, DW_AT_language(DW_LANG_C)
   12249                      .dwattr DW$T$172, DW_AT_byte_size(0x38)
   12250              DW$634  .dwtag  DW_TAG_subrange_type
   12251                      .dwattr DW$634, DW_AT_upper_bound(0x0d)
   12252                      .dwendtag DW$T$172
   12253              
   12254              DW$T$175        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$42)
   12255                      .dwattr DW$T$175, DW_AT_language(DW_LANG_C)
   12256              DW$T$176        .dwtag  DW_TAG_typedef, DW_AT_name("calibrationstruct"), DW_AT_type(*DW$T$52)
   12257                      .dwattr DW$T$176, DW_AT_language(DW_LANG_C)
   12258              DW$T$178        .dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$53)
   12259                      .dwattr DW$T$178, DW_AT_language(DW_LANG_C)
   12260              DW$T$180        .dwtag  DW_TAG_typedef, DW_AT_name("alarmsstruct"), DW_AT_type(*DW$T$54)
   12261                      .dwattr DW$T$180, DW_AT_language(DW_LANG_C)
   12262              DW$T$104        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
   12263                      .dwattr DW$T$104, DW_AT_address_class(0x16)
   12264              DW$635  .dwtag  DW_TAG_far_type
   12265                      .dwattr DW$635, DW_AT_type(*DW$T$183)
   12266              DW$T$184        .dwtag  DW_TAG_const_type
   12267                      .dwattr DW$T$184, DW_AT_type(*DW$635)
   12268              DW$T$187        .dwtag  DW_TAG_typedef, DW_AT_name("slavecmdstruct"), DW_AT_type(*DW$T$59)
   12269                      .dwattr DW$T$187, DW_AT_language(DW_LANG_C)
   12270              DW$T$188        .dwtag  DW_TAG_typedef, DW_AT_name("mbupdatestruct"), DW_AT_type(*DW$T$60)
   12271                      .dwattr DW$T$188, DW_AT_language(DW_LANG_C)
   12272              
   12273              DW$T$190        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$189)
   12274                      .dwattr DW$T$190, DW_AT_language(DW_LANG_C)
   12275                      .dwattr DW$T$190, DW_AT_byte_size(0x1f8)
   12276              DW$636  .dwtag  DW_TAG_subrange_type
   12277                      .dwattr DW$636, DW_AT_upper_bound(0x1b)
   12278                      .dwendtag DW$T$190
   12279              
   12280              DW$T$193        .dwtag  DW_TAG_typedef, DW_AT_name("functionstruct"), DW_AT_type(*DW$T$65)
   12281                      .dwattr DW$T$193, DW_AT_language(DW_LANG_C)
   12282              DW$T$194        .dwtag  DW_TAG_typedef, DW_AT_name("prewarnstruct"), DW_AT_type(*DW$T$66)
   12283                      .dwattr DW$T$194, DW_AT_language(DW_LANG_C)
   12284              DW$T$196        .dwtag  DW_TAG_typedef, DW_AT_name("enginestruct"), DW_AT_type(*DW$T$67)
   12285                      .dwattr DW$T$196, DW_AT_language(DW_LANG_C)
   12286              DW$T$198        .dwtag  DW_TAG_typedef, DW_AT_name("offsetstruct"), DW_AT_type(*DW$T$68)
   12287                      .dwattr DW$T$198, DW_AT_language(DW_LANG_C)
   12288              
   12289              DW$T$201        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$200)
   12290                      .dwattr DW$T$201, DW_AT_language(DW_LANG_C)
   12291                      .dwattr DW$T$201, DW_AT_byte_size(0x1c)
   12292              DW$637  .dwtag  DW_TAG_subrange_type
   12293                      .dwattr DW$637, DW_AT_upper_bound(0x0d)
   12294                      .dwendtag DW$T$201
   12295              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  261

   12296              
   12297              DW$T$205        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$204)
   12298                      .dwattr DW$T$205, DW_AT_language(DW_LANG_C)
   12299                      .dwattr DW$T$205, DW_AT_byte_size(0x118)
   12300              DW$638  .dwtag  DW_TAG_subrange_type
   12301                      .dwattr DW$638, DW_AT_upper_bound(0x1b)
   12302                      .dwendtag DW$T$205
   12303              
   12304              DW$T$208        .dwtag  DW_TAG_typedef, DW_AT_name("damagemonstruct"), DW_AT_type(*DW$T$71)
   12305                      .dwattr DW$T$208, DW_AT_language(DW_LANG_C)
   12306              DW$T$210        .dwtag  DW_TAG_typedef, DW_AT_name("dynamicalarmsstruct"), DW_AT_type(*DW$T$72)
   12307                      .dwattr DW$T$210, DW_AT_language(DW_LANG_C)
   12308              DW$T$211        .dwtag  DW_TAG_typedef, DW_AT_name("damalarmsstruct"), DW_AT_type(*DW$T$73)
   12309                      .dwattr DW$T$211, DW_AT_language(DW_LANG_C)
   12310              DW$T$94 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$10)
   12311                      .dwattr DW$T$94, DW_AT_address_class(0x16)
   12312              DW$T$144        .dwtag  DW_TAG_typedef, DW_AT_name("status3struct"), DW_AT_type(*DW$T$19)
   12313                      .dwattr DW$T$144, DW_AT_language(DW_LANG_C)
   12314              DW$T$152        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
   12315                      .dwattr DW$T$152, DW_AT_address_class(0x16)
   12316              DW$T$157        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$62)
   12317                      .dwattr DW$T$157, DW_AT_address_class(0x16)
   12318              
   12319              DW$T$22 .dwtag  DW_TAG_structure_type
   12320                      .dwattr DW$T$22, DW_AT_name("tag_cppsettingsstruct")
   12321                      .dwattr DW$T$22, DW_AT_byte_size(0x10)
   12322              DW$639  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12323                      .dwattr DW$639, DW_AT_name("iCppEnable"), DW_AT_symbol_name("_iCppEnable")
   12324                      .dwattr DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12325                      .dwattr DW$639, DW_AT_accessibility(DW_ACCESS_public)
   12326              DW$640  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12327                      .dwattr DW$640, DW_AT_name("iCppLowLimit"), DW_AT_symbol_name("_iCppLowLimit")
   12328                      .dwattr DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12329                      .dwattr DW$640, DW_AT_accessibility(DW_ACCESS_public)
   12330              DW$641  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12331                      .dwattr DW$641, DW_AT_name("iCppHighLimit"), DW_AT_symbol_name("_iCppHighLimit")
   12332                      .dwattr DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12333                      .dwattr DW$641, DW_AT_accessibility(DW_ACCESS_public)
   12334              DW$642  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12335                      .dwattr DW$642, DW_AT_name("cppkvalue"), DW_AT_symbol_name("_cppkvalue")
   12336                      .dwattr DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12337                      .dwattr DW$642, DW_AT_accessibility(DW_ACCESS_public)
   12338              DW$643  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12339                      .dwattr DW$643, DW_AT_name("gammavalue"), DW_AT_symbol_name("_gammavalue")
   12340                      .dwattr DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12341                      .dwattr DW$643, DW_AT_accessibility(DW_ACCESS_public)
   12342              DW$644  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12343                      .dwattr DW$644, DW_AT_name("cpplevelx"), DW_AT_symbol_name("_cpplevelx")
   12344                      .dwattr DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12345                      .dwattr DW$644, DW_AT_accessibility(DW_ACCESS_public)
   12346              DW$645  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12347                      .dwattr DW$645, DW_AT_name("delatRpmPauseDelay"), DW_AT_symbol_name("_delatRpmPauseDelay")
   12348                      .dwattr DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12349                      .dwattr DW$645, DW_AT_accessibility(DW_ACCESS_public)
   12350              DW$646  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  262

   12351                      .dwattr DW$646, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
   12352                      .dwattr DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12353                      .dwattr DW$646, DW_AT_accessibility(DW_ACCESS_public)
   12354              DW$647  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12355                      .dwattr DW$647, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
   12356                      .dwattr DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12357                      .dwattr DW$647, DW_AT_accessibility(DW_ACCESS_public)
   12358              DW$648  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12359                      .dwattr DW$648, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
   12360                      .dwattr DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   12361                      .dwattr DW$648, DW_AT_accessibility(DW_ACCESS_public)
   12362              DW$649  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12363                      .dwattr DW$649, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
   12364                      .dwattr DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12365                      .dwattr DW$649, DW_AT_accessibility(DW_ACCESS_public)
   12366              DW$650  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12367                      .dwattr DW$650, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
   12368                      .dwattr DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   12369                      .dwattr DW$650, DW_AT_accessibility(DW_ACCESS_public)
   12370              DW$651  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12371                      .dwattr DW$651, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
   12372                      .dwattr DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12373                      .dwattr DW$651, DW_AT_accessibility(DW_ACCESS_public)
   12374              DW$652  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12375                      .dwattr DW$652, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
   12376                      .dwattr DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   12377                      .dwattr DW$652, DW_AT_accessibility(DW_ACCESS_public)
   12378              DW$653  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12379                      .dwattr DW$653, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
   12380                      .dwattr DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12381                      .dwattr DW$653, DW_AT_accessibility(DW_ACCESS_public)
   12382              DW$654  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12383                      .dwattr DW$654, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
   12384                      .dwattr DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   12385                      .dwattr DW$654, DW_AT_accessibility(DW_ACCESS_public)
   12386                      .dwendtag DW$T$22
   12387              
   12388              
   12389              DW$T$23 .dwtag  DW_TAG_structure_type
   12390                      .dwattr DW$T$23, DW_AT_name("tag_cppstruct")
   12391                      .dwattr DW$T$23, DW_AT_byte_size(0x06)
   12392              DW$655  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12393                      .dwattr DW$655, DW_AT_name("iAtodValue"), DW_AT_symbol_name("_iAtodValue")
   12394                      .dwattr DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12395                      .dwattr DW$655, DW_AT_accessibility(DW_ACCESS_public)
   12396              DW$656  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   12397                      .dwattr DW$656, DW_AT_name("fmAinput"), DW_AT_symbol_name("_fmAinput")
   12398                      .dwattr DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12399                      .dwattr DW$656, DW_AT_accessibility(DW_ACCESS_public)
   12400              DW$657  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   12401                      .dwattr DW$657, DW_AT_name("fLoadPercent"), DW_AT_symbol_name("_fLoadPercent")
   12402                      .dwattr DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12403                      .dwattr DW$657, DW_AT_accessibility(DW_ACCESS_public)
   12404                      .dwendtag DW$T$23
   12405              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  263

   12406              
   12407              DW$T$25 .dwtag  DW_TAG_structure_type
   12408                      .dwattr DW$T$25, DW_AT_name("tag_settingsstruct")
   12409                      .dwattr DW$T$25, DW_AT_byte_size(0x24)
   12410              DW$658  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12411                      .dwattr DW$658, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
   12412                      .dwattr DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12413                      .dwattr DW$658, DW_AT_accessibility(DW_ACCESS_public)
   12414              DW$659  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12415                      .dwattr DW$659, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
   12416                      .dwattr DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12417                      .dwattr DW$659, DW_AT_accessibility(DW_ACCESS_public)
   12418              DW$660  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12419                      .dwattr DW$660, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
   12420                      .dwattr DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12421                      .dwattr DW$660, DW_AT_accessibility(DW_ACCESS_public)
   12422              DW$661  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12423                      .dwattr DW$661, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
   12424                      .dwattr DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12425                      .dwattr DW$661, DW_AT_accessibility(DW_ACCESS_public)
   12426              DW$662  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12427                      .dwattr DW$662, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
   12428                      .dwattr DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12429                      .dwattr DW$662, DW_AT_accessibility(DW_ACCESS_public)
   12430              DW$663  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12431                      .dwattr DW$663, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
   12432                      .dwattr DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12433                      .dwattr DW$663, DW_AT_accessibility(DW_ACCESS_public)
   12434              DW$664  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12435                      .dwattr DW$664, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
   12436                      .dwattr DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12437                      .dwattr DW$664, DW_AT_accessibility(DW_ACCESS_public)
   12438              DW$665  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12439                      .dwattr DW$665, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
   12440                      .dwattr DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12441                      .dwattr DW$665, DW_AT_accessibility(DW_ACCESS_public)
   12442              DW$666  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12443                      .dwattr DW$666, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
   12444                      .dwattr DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12445                      .dwattr DW$666, DW_AT_accessibility(DW_ACCESS_public)
   12446              DW$667  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12447                      .dwattr DW$667, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
   12448                      .dwattr DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   12449                      .dwattr DW$667, DW_AT_accessibility(DW_ACCESS_public)
   12450              DW$668  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12451                      .dwattr DW$668, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
   12452                      .dwattr DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12453                      .dwattr DW$668, DW_AT_accessibility(DW_ACCESS_public)
   12454              DW$669  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12455                      .dwattr DW$669, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
   12456                      .dwattr DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   12457                      .dwattr DW$669, DW_AT_accessibility(DW_ACCESS_public)
   12458              DW$670  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12459                      .dwattr DW$670, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
   12460                      .dwattr DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  264

   12461                      .dwattr DW$670, DW_AT_accessibility(DW_ACCESS_public)
   12462              DW$671  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12463                      .dwattr DW$671, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
   12464                      .dwattr DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   12465                      .dwattr DW$671, DW_AT_accessibility(DW_ACCESS_public)
   12466              DW$672  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12467                      .dwattr DW$672, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
   12468                      .dwattr DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12469                      .dwattr DW$672, DW_AT_accessibility(DW_ACCESS_public)
   12470              DW$673  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12471                      .dwattr DW$673, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
   12472                      .dwattr DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   12473                      .dwattr DW$673, DW_AT_accessibility(DW_ACCESS_public)
   12474              DW$674  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12475                      .dwattr DW$674, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
   12476                      .dwattr DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12477                      .dwattr DW$674, DW_AT_accessibility(DW_ACCESS_public)
   12478              DW$675  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12479                      .dwattr DW$675, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
   12480                      .dwattr DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   12481                      .dwattr DW$675, DW_AT_accessibility(DW_ACCESS_public)
   12482              DW$676  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12483                      .dwattr DW$676, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
   12484                      .dwattr DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12485                      .dwattr DW$676, DW_AT_accessibility(DW_ACCESS_public)
   12486              DW$677  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12487                      .dwattr DW$677, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
   12488                      .dwattr DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   12489                      .dwattr DW$677, DW_AT_accessibility(DW_ACCESS_public)
   12490              DW$678  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12491                      .dwattr DW$678, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
   12492                      .dwattr DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12493                      .dwattr DW$678, DW_AT_accessibility(DW_ACCESS_public)
   12494              DW$679  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12495                      .dwattr DW$679, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
   12496                      .dwattr DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   12497                      .dwattr DW$679, DW_AT_accessibility(DW_ACCESS_public)
   12498              DW$680  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12499                      .dwattr DW$680, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
   12500                      .dwattr DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12501                      .dwattr DW$680, DW_AT_accessibility(DW_ACCESS_public)
   12502              DW$681  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12503                      .dwattr DW$681, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
   12504                      .dwattr DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   12505                      .dwattr DW$681, DW_AT_accessibility(DW_ACCESS_public)
   12506              DW$682  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12507                      .dwattr DW$682, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
   12508                      .dwattr DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12509                      .dwattr DW$682, DW_AT_accessibility(DW_ACCESS_public)
   12510              DW$683  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12511                      .dwattr DW$683, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
   12512                      .dwattr DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   12513                      .dwattr DW$683, DW_AT_accessibility(DW_ACCESS_public)
   12514              DW$684  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12515                      .dwattr DW$684, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  265

   12516                      .dwattr DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   12517                      .dwattr DW$684, DW_AT_accessibility(DW_ACCESS_public)
   12518              DW$685  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12519                      .dwattr DW$685, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
   12520                      .dwattr DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
   12521                      .dwattr DW$685, DW_AT_accessibility(DW_ACCESS_public)
   12522              DW$686  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12523                      .dwattr DW$686, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
   12524                      .dwattr DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12525                      .dwattr DW$686, DW_AT_accessibility(DW_ACCESS_public)
   12526              DW$687  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12527                      .dwattr DW$687, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
   12528                      .dwattr DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   12529                      .dwattr DW$687, DW_AT_accessibility(DW_ACCESS_public)
   12530              DW$688  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12531                      .dwattr DW$688, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
   12532                      .dwattr DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   12533                      .dwattr DW$688, DW_AT_accessibility(DW_ACCESS_public)
   12534              DW$689  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   12535                      .dwattr DW$689, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
   12536                      .dwattr DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
   12537                      .dwattr DW$689, DW_AT_accessibility(DW_ACCESS_public)
   12538              DW$690  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12539                      .dwattr DW$690, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
   12540                      .dwattr DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   12541                      .dwattr DW$690, DW_AT_accessibility(DW_ACCESS_public)
   12542              DW$691  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12543                      .dwattr DW$691, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
   12544                      .dwattr DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   12545                      .dwattr DW$691, DW_AT_accessibility(DW_ACCESS_public)
   12546              DW$692  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12547                      .dwattr DW$692, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
   12548                      .dwattr DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
   12549                      .dwattr DW$692, DW_AT_accessibility(DW_ACCESS_public)
   12550                      .dwendtag DW$T$25
   12551              
   12552              
   12553              DW$T$27 .dwtag  DW_TAG_structure_type
   12554                      .dwattr DW$T$27, DW_AT_name("tag_motionstruct")
   12555                      .dwattr DW$T$27, DW_AT_byte_size(0x09)
   12556              DW$693  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12557                      .dwattr DW$693, DW_AT_name("counter"), DW_AT_symbol_name("_counter")
   12558                      .dwattr DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12559                      .dwattr DW$693, DW_AT_accessibility(DW_ACCESS_public)
   12560              DW$694  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12561                      .dwattr DW$694, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
   12562                      .dwattr DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12563                      .dwattr DW$694, DW_AT_accessibility(DW_ACCESS_public)
   12564              DW$695  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   12565                      .dwattr DW$695, DW_AT_name("order"), DW_AT_symbol_name("_order")
   12566                      .dwattr DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12567                      .dwattr DW$695, DW_AT_accessibility(DW_ACCESS_public)
   12568              DW$696  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12569                      .dwattr DW$696, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
   12570                      .dwattr DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  266

   12571                      .dwattr DW$696, DW_AT_accessibility(DW_ACCESS_public)
   12572              DW$697  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12573                      .dwattr DW$697, DW_AT_name("forwardasternflagprev"), DW_AT_symbol_name("_forwardasternflagprev")
   12574                      .dwattr DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12575                      .dwattr DW$697, DW_AT_accessibility(DW_ACCESS_public)
   12576              DW$698  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12577                      .dwattr DW$698, DW_AT_name("recalnow"), DW_AT_symbol_name("_recalnow")
   12578                      .dwattr DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12579                      .dwattr DW$698, DW_AT_accessibility(DW_ACCESS_public)
   12580              DW$699  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12581                      .dwattr DW$699, DW_AT_name("calerror"), DW_AT_symbol_name("_calerror")
   12582                      .dwattr DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12583                      .dwattr DW$699, DW_AT_accessibility(DW_ACCESS_public)
   12584              DW$700  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12585                      .dwattr DW$700, DW_AT_name("recheckdir"), DW_AT_symbol_name("_recheckdir")
   12586                      .dwattr DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12587                      .dwattr DW$700, DW_AT_accessibility(DW_ACCESS_public)
   12588                      .dwendtag DW$T$27
   12589              
   12590              DW$T$165        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$29)
   12591                      .dwattr DW$T$165, DW_AT_language(DW_LANG_C)
   12592              
   12593              DW$T$32 .dwtag  DW_TAG_structure_type
   12594                      .dwattr DW$T$32, DW_AT_name("tag_allsensorstruct")
   12595                      .dwattr DW$T$32, DW_AT_byte_size(0x2d)
   12596              DW$701  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12597                      .dwattr DW$701, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
   12598                      .dwattr DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12599                      .dwattr DW$701, DW_AT_accessibility(DW_ACCESS_public)
   12600              DW$702  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12601                      .dwattr DW$702, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
   12602                      .dwattr DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12603                      .dwattr DW$702, DW_AT_accessibility(DW_ACCESS_public)
   12604              DW$703  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12605                      .dwattr DW$703, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
   12606                      .dwattr DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12607                      .dwattr DW$703, DW_AT_accessibility(DW_ACCESS_public)
   12608              DW$704  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12609                      .dwattr DW$704, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
   12610                      .dwattr DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12611                      .dwattr DW$704, DW_AT_accessibility(DW_ACCESS_public)
   12612              DW$705  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12613                      .dwattr DW$705, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
   12614                      .dwattr DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12615                      .dwattr DW$705, DW_AT_accessibility(DW_ACCESS_public)
   12616              DW$706  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12617                      .dwattr DW$706, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
   12618                      .dwattr DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12619                      .dwattr DW$706, DW_AT_accessibility(DW_ACCESS_public)
   12620              DW$707  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12621                      .dwattr DW$707, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
   12622                      .dwattr DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12623                      .dwattr DW$707, DW_AT_accessibility(DW_ACCESS_public)
   12624              DW$708  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12625                      .dwattr DW$708, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  267

   12626                      .dwattr DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12627                      .dwattr DW$708, DW_AT_accessibility(DW_ACCESS_public)
   12628              DW$709  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12629                      .dwattr DW$709, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
   12630                      .dwattr DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12631                      .dwattr DW$709, DW_AT_accessibility(DW_ACCESS_public)
   12632              DW$710  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12633                      .dwattr DW$710, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
   12634                      .dwattr DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   12635                      .dwattr DW$710, DW_AT_accessibility(DW_ACCESS_public)
   12636              DW$711  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12637                      .dwattr DW$711, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
   12638                      .dwattr DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12639                      .dwattr DW$711, DW_AT_accessibility(DW_ACCESS_public)
   12640              DW$712  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12641                      .dwattr DW$712, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
   12642                      .dwattr DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   12643                      .dwattr DW$712, DW_AT_accessibility(DW_ACCESS_public)
   12644              DW$713  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12645                      .dwattr DW$713, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
   12646                      .dwattr DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12647                      .dwattr DW$713, DW_AT_accessibility(DW_ACCESS_public)
   12648              DW$714  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12649                      .dwattr DW$714, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
   12650                      .dwattr DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   12651                      .dwattr DW$714, DW_AT_accessibility(DW_ACCESS_public)
   12652              DW$715  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12653                      .dwattr DW$715, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
   12654                      .dwattr DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12655                      .dwattr DW$715, DW_AT_accessibility(DW_ACCESS_public)
   12656              DW$716  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12657                      .dwattr DW$716, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
   12658                      .dwattr DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   12659                      .dwattr DW$716, DW_AT_accessibility(DW_ACCESS_public)
   12660              DW$717  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
   12661                      .dwattr DW$717, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
   12662                      .dwattr DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12663                      .dwattr DW$717, DW_AT_accessibility(DW_ACCESS_public)
   12664              DW$718  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12665                      .dwattr DW$718, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
   12666                      .dwattr DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   12667                      .dwattr DW$718, DW_AT_accessibility(DW_ACCESS_public)
   12668              DW$719  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12669                      .dwattr DW$719, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
   12670                      .dwattr DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12671                      .dwattr DW$719, DW_AT_accessibility(DW_ACCESS_public)
   12672              DW$720  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12673                      .dwattr DW$720, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
   12674                      .dwattr DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   12675                      .dwattr DW$720, DW_AT_accessibility(DW_ACCESS_public)
   12676              DW$721  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12677                      .dwattr DW$721, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
   12678                      .dwattr DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12679                      .dwattr DW$721, DW_AT_accessibility(DW_ACCESS_public)
   12680              DW$722  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  268

   12681                      .dwattr DW$722, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
   12682                      .dwattr DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   12683                      .dwattr DW$722, DW_AT_accessibility(DW_ACCESS_public)
   12684              DW$723  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12685                      .dwattr DW$723, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
   12686                      .dwattr DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
   12687                      .dwattr DW$723, DW_AT_accessibility(DW_ACCESS_public)
   12688              DW$724  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12689                      .dwattr DW$724, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
   12690                      .dwattr DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   12691                      .dwattr DW$724, DW_AT_accessibility(DW_ACCESS_public)
   12692              DW$725  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12693                      .dwattr DW$725, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
   12694                      .dwattr DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
   12695                      .dwattr DW$725, DW_AT_accessibility(DW_ACCESS_public)
   12696              DW$726  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12697                      .dwattr DW$726, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
   12698                      .dwattr DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   12699                      .dwattr DW$726, DW_AT_accessibility(DW_ACCESS_public)
   12700              DW$727  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12701                      .dwattr DW$727, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
   12702                      .dwattr DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   12703                      .dwattr DW$727, DW_AT_accessibility(DW_ACCESS_public)
   12704              DW$728  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12705                      .dwattr DW$728, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
   12706                      .dwattr DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   12707                      .dwattr DW$728, DW_AT_accessibility(DW_ACCESS_public)
   12708              DW$729  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12709                      .dwattr DW$729, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
   12710                      .dwattr DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
   12711                      .dwattr DW$729, DW_AT_accessibility(DW_ACCESS_public)
   12712              DW$730  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   12713                      .dwattr DW$730, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
   12714                      .dwattr DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   12715                      .dwattr DW$730, DW_AT_accessibility(DW_ACCESS_public)
   12716              DW$731  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12717                      .dwattr DW$731, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
   12718                      .dwattr DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
   12719                      .dwattr DW$731, DW_AT_accessibility(DW_ACCESS_public)
   12720              DW$732  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12721                      .dwattr DW$732, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
   12722                      .dwattr DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   12723                      .dwattr DW$732, DW_AT_accessibility(DW_ACCESS_public)
   12724                      .dwendtag DW$T$32
   12725              
   12726              DW$T$171        .dwtag  DW_TAG_typedef, DW_AT_name("cylinderstruct"), DW_AT_type(*DW$T$35)
   12727                      .dwattr DW$T$171, DW_AT_language(DW_LANG_C)
   12728              
   12729              DW$T$42 .dwtag  DW_TAG_structure_type
   12730                      .dwattr DW$T$42, DW_AT_name("tag_configstruct")
   12731                      .dwattr DW$T$42, DW_AT_byte_size(0x18)
   12732              DW$733  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
   12733                      .dwattr DW$733, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
   12734                      .dwattr DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12735                      .dwattr DW$733, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  269

   12736              DW$734  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
   12737                      .dwattr DW$734, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
   12738                      .dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12739                      .dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
   12740              DW$735  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
   12741                      .dwattr DW$735, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
   12742                      .dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12743                      .dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
   12744              DW$736  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
   12745                      .dwattr DW$736, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
   12746                      .dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12747                      .dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
   12748              DW$737  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
   12749                      .dwattr DW$737, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
   12750                      .dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12751                      .dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
   12752              DW$738  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
   12753                      .dwattr DW$738, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
   12754                      .dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12755                      .dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
   12756                      .dwendtag DW$T$42
   12757              
   12758              
   12759              DW$T$52 .dwtag  DW_TAG_structure_type
   12760                      .dwattr DW$T$52, DW_AT_name("tag_calibrationstruct")
   12761                      .dwattr DW$T$52, DW_AT_byte_size(0x31a)
   12762              DW$739  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12763                      .dwattr DW$739, DW_AT_name("rpmpoints"), DW_AT_symbol_name("_rpmpoints")
   12764                      .dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12765                      .dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
   12766              DW$740  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
   12767                      .dwattr DW$740, DW_AT_name("speedcalpoints"), DW_AT_symbol_name("_speedcalpoints")
   12768                      .dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12769                      .dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
   12770              DW$741  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
   12771                      .dwattr DW$741, DW_AT_name("roughnumpoints"), DW_AT_symbol_name("_roughnumpoints")
   12772                      .dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12773                      .dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
   12774              DW$742  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
   12775                      .dwattr DW$742, DW_AT_name("numpoints"), DW_AT_symbol_name("_numpoints")
   12776                      .dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12777                      .dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
   12778              DW$743  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
   12779                      .dwattr DW$743, DW_AT_name("averagespeedacc"), DW_AT_symbol_name("_averagespeedacc")
   12780                      .dwattr DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
   12781                      .dwattr DW$743, DW_AT_accessibility(DW_ACCESS_public)
   12782              DW$744  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
   12783                      .dwattr DW$744, DW_AT_name("averagevalacc"), DW_AT_symbol_name("_averagevalacc")
   12784                      .dwattr DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e2]
   12785                      .dwattr DW$744, DW_AT_accessibility(DW_ACCESS_public)
   12786              DW$745  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12787                      .dwattr DW$745, DW_AT_name("validpoints"), DW_AT_symbol_name("_validpoints")
   12788                      .dwattr DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x28a]
   12789                      .dwattr DW$745, DW_AT_accessibility(DW_ACCESS_public)
   12790              DW$746  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  270

   12791                      .dwattr DW$746, DW_AT_name("rpmatcal"), DW_AT_symbol_name("_rpmatcal")
   12792                      .dwattr DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x28b]
   12793                      .dwattr DW$746, DW_AT_accessibility(DW_ACCESS_public)
   12794              DW$747  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
   12795                      .dwattr DW$747, DW_AT_name("manroughcalpts"), DW_AT_symbol_name("_manroughcalpts")
   12796                      .dwattr DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x28e]
   12797                      .dwattr DW$747, DW_AT_accessibility(DW_ACCESS_public)
   12798              DW$748  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   12799                      .dwattr DW$748, DW_AT_name("manroughmin"), DW_AT_symbol_name("_manroughmin")
   12800                      .dwattr DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e2]
   12801                      .dwattr DW$748, DW_AT_accessibility(DW_ACCESS_public)
   12802              DW$749  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   12803                      .dwattr DW$749, DW_AT_name("manroughmax"), DW_AT_symbol_name("_manroughmax")
   12804                      .dwattr DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2fe]
   12805                      .dwattr DW$749, DW_AT_accessibility(DW_ACCESS_public)
   12806                      .dwendtag DW$T$52
   12807              
   12808              
   12809              DW$T$53 .dwtag  DW_TAG_structure_type
   12810                      .dwattr DW$T$53, DW_AT_name("tag_speedcompstruct")
   12811                      .dwattr DW$T$53, DW_AT_byte_size(0x19)
   12812              DW$750  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12813                      .dwattr DW$750, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
   12814                      .dwattr DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12815                      .dwattr DW$750, DW_AT_accessibility(DW_ACCESS_public)
   12816              DW$751  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12817                      .dwattr DW$751, DW_AT_name("status"), DW_AT_symbol_name("_status")
   12818                      .dwattr DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12819                      .dwattr DW$751, DW_AT_accessibility(DW_ACCESS_public)
   12820              DW$752  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
   12821                      .dwattr DW$752, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
   12822                      .dwattr DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12823                      .dwattr DW$752, DW_AT_accessibility(DW_ACCESS_public)
   12824              DW$753  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12825                      .dwattr DW$753, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
   12826                      .dwattr DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12827                      .dwattr DW$753, DW_AT_accessibility(DW_ACCESS_public)
   12828              DW$754  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12829                      .dwattr DW$754, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
   12830                      .dwattr DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   12831                      .dwattr DW$754, DW_AT_accessibility(DW_ACCESS_public)
   12832              DW$755  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12833                      .dwattr DW$755, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
   12834                      .dwattr DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12835                      .dwattr DW$755, DW_AT_accessibility(DW_ACCESS_public)
   12836              DW$756  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12837                      .dwattr DW$756, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
   12838                      .dwattr DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   12839                      .dwattr DW$756, DW_AT_accessibility(DW_ACCESS_public)
   12840              DW$757  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12841                      .dwattr DW$757, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
   12842                      .dwattr DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12843                      .dwattr DW$757, DW_AT_accessibility(DW_ACCESS_public)
   12844              DW$758  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12845                      .dwattr DW$758, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  271

   12846                      .dwattr DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   12847                      .dwattr DW$758, DW_AT_accessibility(DW_ACCESS_public)
   12848              DW$759  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12849                      .dwattr DW$759, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
   12850                      .dwattr DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12851                      .dwattr DW$759, DW_AT_accessibility(DW_ACCESS_public)
   12852              DW$760  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12853                      .dwattr DW$760, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
   12854                      .dwattr DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   12855                      .dwattr DW$760, DW_AT_accessibility(DW_ACCESS_public)
   12856              DW$761  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12857                      .dwattr DW$761, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
   12858                      .dwattr DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12859                      .dwattr DW$761, DW_AT_accessibility(DW_ACCESS_public)
   12860              DW$762  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12861                      .dwattr DW$762, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
   12862                      .dwattr DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   12863                      .dwattr DW$762, DW_AT_accessibility(DW_ACCESS_public)
   12864              DW$763  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12865                      .dwattr DW$763, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
   12866                      .dwattr DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12867                      .dwattr DW$763, DW_AT_accessibility(DW_ACCESS_public)
   12868              DW$764  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12869                      .dwattr DW$764, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
   12870                      .dwattr DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   12871                      .dwattr DW$764, DW_AT_accessibility(DW_ACCESS_public)
   12872              DW$765  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12873                      .dwattr DW$765, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
   12874                      .dwattr DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12875                      .dwattr DW$765, DW_AT_accessibility(DW_ACCESS_public)
   12876              DW$766  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12877                      .dwattr DW$766, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
   12878                      .dwattr DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   12879                      .dwattr DW$766, DW_AT_accessibility(DW_ACCESS_public)
   12880              DW$767  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12881                      .dwattr DW$767, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
   12882                      .dwattr DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12883                      .dwattr DW$767, DW_AT_accessibility(DW_ACCESS_public)
   12884              DW$768  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12885                      .dwattr DW$768, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
   12886                      .dwattr DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   12887                      .dwattr DW$768, DW_AT_accessibility(DW_ACCESS_public)
   12888              DW$769  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12889                      .dwattr DW$769, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
   12890                      .dwattr DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12891                      .dwattr DW$769, DW_AT_accessibility(DW_ACCESS_public)
   12892                      .dwendtag DW$T$53
   12893              
   12894              
   12895              DW$T$54 .dwtag  DW_TAG_structure_type
   12896                      .dwattr DW$T$54, DW_AT_name("tag_alarmsstruct")
   12897                      .dwattr DW$T$54, DW_AT_byte_size(0x01)
   12898              DW$770  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12899                      .dwattr DW$770, DW_AT_name("slavefailure"), DW_AT_symbol_name("_slavefailure")
   12900                      .dwattr DW$770, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  272

   12901                      .dwattr DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12902                      .dwattr DW$770, DW_AT_accessibility(DW_ACCESS_public)
   12903              DW$771  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12904                      .dwattr DW$771, DW_AT_name("slavefailurelatched"), DW_AT_symbol_name("_slavefailurelatched")
   12905                      .dwattr DW$771, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
   12906                      .dwattr DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12907                      .dwattr DW$771, DW_AT_accessibility(DW_ACCESS_public)
   12908              DW$772  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12909                      .dwattr DW$772, DW_AT_name("framfailure"), DW_AT_symbol_name("_framfailure")
   12910                      .dwattr DW$772, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
   12911                      .dwattr DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12912                      .dwattr DW$772, DW_AT_accessibility(DW_ACCESS_public)
   12913              DW$773  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12914                      .dwattr DW$773, DW_AT_name("framfailurelatched"), DW_AT_symbol_name("_framfailurelatched")
   12915                      .dwattr DW$773, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
   12916                      .dwattr DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12917                      .dwattr DW$773, DW_AT_accessibility(DW_ACCESS_public)
   12918              DW$774  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12919                      .dwattr DW$774, DW_AT_name("pccommsfailure"), DW_AT_symbol_name("_pccommsfailure")
   12920                      .dwattr DW$774, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
   12921                      .dwattr DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12922                      .dwattr DW$774, DW_AT_accessibility(DW_ACCESS_public)
   12923              DW$775  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12924                      .dwattr DW$775, DW_AT_name("pccommsfailurelatched"), DW_AT_symbol_name("_pccommsfailurelatched")
   12925                      .dwattr DW$775, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
   12926                      .dwattr DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12927                      .dwattr DW$775, DW_AT_accessibility(DW_ACCESS_public)
   12928              DW$776  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12929                      .dwattr DW$776, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
   12930                      .dwattr DW$776, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
   12931                      .dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12932                      .dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
   12933              DW$777  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12934                      .dwattr DW$777, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
   12935                      .dwattr DW$777, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
   12936                      .dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12937                      .dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
   12938              DW$778  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12939                      .dwattr DW$778, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
   12940                      .dwattr DW$778, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
   12941                      .dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12942                      .dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
   12943              DW$779  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12944                      .dwattr DW$779, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
   12945                      .dwattr DW$779, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
   12946                      .dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12947                      .dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
   12948              DW$780  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12949                      .dwattr DW$780, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
   12950                      .dwattr DW$780, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
   12951                      .dwattr DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12952                      .dwattr DW$780, DW_AT_accessibility(DW_ACCESS_public)
   12953              DW$781  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12954                      .dwattr DW$781, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
   12955                      .dwattr DW$781, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  273

   12956                      .dwattr DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12957                      .dwattr DW$781, DW_AT_accessibility(DW_ACCESS_public)
   12958              DW$782  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12959                      .dwattr DW$782, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
   12960                      .dwattr DW$782, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
   12961                      .dwattr DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12962                      .dwattr DW$782, DW_AT_accessibility(DW_ACCESS_public)
   12963              DW$783  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12964                      .dwattr DW$783, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
   12965                      .dwattr DW$783, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
   12966                      .dwattr DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12967                      .dwattr DW$783, DW_AT_accessibility(DW_ACCESS_public)
   12968              DW$784  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12969                      .dwattr DW$784, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
   12970                      .dwattr DW$784, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
   12971                      .dwattr DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12972                      .dwattr DW$784, DW_AT_accessibility(DW_ACCESS_public)
   12973              DW$785  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12974                      .dwattr DW$785, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
   12975                      .dwattr DW$785, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
   12976                      .dwattr DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12977                      .dwattr DW$785, DW_AT_accessibility(DW_ACCESS_public)
   12978                      .dwendtag DW$T$54
   12979              
   12980              DW$786  .dwtag  DW_TAG_far_type
   12981                      .dwattr DW$786, DW_AT_type(*DW$T$55)
   12982              DW$T$103        .dwtag  DW_TAG_const_type
   12983                      .dwattr DW$T$103, DW_AT_type(*DW$786)
   12984              DW$T$183        .dwtag  DW_TAG_typedef, DW_AT_name("sdcarddirstruct"), DW_AT_type(*DW$T$57)
   12985                      .dwattr DW$T$183, DW_AT_language(DW_LANG_C)
   12986              
   12987              DW$T$59 .dwtag  DW_TAG_structure_type
   12988                      .dwattr DW$T$59, DW_AT_name("tag_slavecmdstruct")
   12989                      .dwattr DW$T$59, DW_AT_byte_size(0x48)
   12990              DW$787  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12991                      .dwattr DW$787, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
   12992                      .dwattr DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12993                      .dwattr DW$787, DW_AT_accessibility(DW_ACCESS_public)
   12994              DW$788  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12995                      .dwattr DW$788, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
   12996                      .dwattr DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12997                      .dwattr DW$788, DW_AT_accessibility(DW_ACCESS_public)
   12998              DW$789  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12999                      .dwattr DW$789, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
   13000                      .dwattr DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13001                      .dwattr DW$789, DW_AT_accessibility(DW_ACCESS_public)
   13002              DW$790  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13003                      .dwattr DW$790, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
   13004                      .dwattr DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13005                      .dwattr DW$790, DW_AT_accessibility(DW_ACCESS_public)
   13006              DW$791  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13007                      .dwattr DW$791, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
   13008                      .dwattr DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13009                      .dwattr DW$791, DW_AT_accessibility(DW_ACCESS_public)
   13010              DW$792  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  274

   13011                      .dwattr DW$792, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
   13012                      .dwattr DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13013                      .dwattr DW$792, DW_AT_accessibility(DW_ACCESS_public)
   13014              DW$793  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13015                      .dwattr DW$793, DW_AT_name("txmode"), DW_AT_symbol_name("_txmode")
   13016                      .dwattr DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   13017                      .dwattr DW$793, DW_AT_accessibility(DW_ACCESS_public)
   13018              DW$794  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13019                      .dwattr DW$794, DW_AT_name("slavelost"), DW_AT_symbol_name("_slavelost")
   13020                      .dwattr DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   13021                      .dwattr DW$794, DW_AT_accessibility(DW_ACCESS_public)
   13022              DW$795  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13023                      .dwattr DW$795, DW_AT_name("slavenotready"), DW_AT_symbol_name("_slavenotready")
   13024                      .dwattr DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
   13025                      .dwattr DW$795, DW_AT_accessibility(DW_ACCESS_public)
   13026                      .dwendtag DW$T$59
   13027              
   13028              
   13029              DW$T$60 .dwtag  DW_TAG_structure_type
   13030                      .dwattr DW$T$60, DW_AT_name("tag_mbupdatestruct")
   13031                      .dwattr DW$T$60, DW_AT_byte_size(0x01)
   13032              DW$796  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13033                      .dwattr DW$796, DW_AT_name("status1"), DW_AT_symbol_name("_status1")
   13034                      .dwattr DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13035                      .dwattr DW$796, DW_AT_accessibility(DW_ACCESS_public)
   13036                      .dwendtag DW$T$60
   13037              
   13038              DW$T$189        .dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$63)
   13039                      .dwattr DW$T$189, DW_AT_language(DW_LANG_C)
   13040              
   13041              DW$T$65 .dwtag  DW_TAG_structure_type
   13042                      .dwattr DW$T$65, DW_AT_name("tag_functionstruct")
   13043                      .dwattr DW$T$65, DW_AT_byte_size(0x08)
   13044              DW$797  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
   13045                      .dwattr DW$797, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
   13046                      .dwattr DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13047                      .dwattr DW$797, DW_AT_accessibility(DW_ACCESS_public)
   13048                      .dwendtag DW$T$65
   13049              
   13050              
   13051              DW$T$66 .dwtag  DW_TAG_structure_type
   13052                      .dwattr DW$T$66, DW_AT_name("tag_prewarnstruct")
   13053                      .dwattr DW$T$66, DW_AT_byte_size(0xaa)
   13054              DW$798  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   13055                      .dwattr DW$798, DW_AT_name("prelevel"), DW_AT_symbol_name("_prelevel")
   13056                      .dwattr DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13057                      .dwattr DW$798, DW_AT_accessibility(DW_ACCESS_public)
   13058              DW$799  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   13059                      .dwattr DW$799, DW_AT_name("average"), DW_AT_symbol_name("_average")
   13060                      .dwattr DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13061                      .dwattr DW$799, DW_AT_accessibility(DW_ACCESS_public)
   13062              DW$800  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
   13063                      .dwattr DW$800, DW_AT_name("calcacc"), DW_AT_symbol_name("_calcacc")
   13064                      .dwattr DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   13065                      .dwattr DW$800, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  275

   13066              DW$801  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
   13067                      .dwattr DW$801, DW_AT_name("points"), DW_AT_symbol_name("_points")
   13068                      .dwattr DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   13069                      .dwattr DW$801, DW_AT_accessibility(DW_ACCESS_public)
   13070              DW$802  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13071                      .dwattr DW$802, DW_AT_name("prewarncompleteflag"), DW_AT_symbol_name("_prewarncompleteflag")
   13072                      .dwattr DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
   13073                      .dwattr DW$802, DW_AT_accessibility(DW_ACCESS_public)
   13074              DW$803  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13075                      .dwattr DW$803, DW_AT_name("init"), DW_AT_symbol_name("_init")
   13076                      .dwattr DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xa9]
   13077                      .dwattr DW$803, DW_AT_accessibility(DW_ACCESS_public)
   13078                      .dwendtag DW$T$66
   13079              
   13080              
   13081              DW$T$67 .dwtag  DW_TAG_structure_type
   13082                      .dwattr DW$T$67, DW_AT_name("tag_engingestruct")
   13083                      .dwattr DW$T$67, DW_AT_byte_size(0x02)
   13084              DW$804  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   13085                      .dwattr DW$804, DW_AT_name("runtime"), DW_AT_symbol_name("_runtime")
   13086                      .dwattr DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13087                      .dwattr DW$804, DW_AT_accessibility(DW_ACCESS_public)
   13088                      .dwendtag DW$T$67
   13089              
   13090              
   13091              DW$T$68 .dwtag  DW_TAG_structure_type
   13092                      .dwattr DW$T$68, DW_AT_name("tag_offsetstruct")
   13093                      .dwattr DW$T$68, DW_AT_byte_size(0x1c)
   13094              DW$805  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   13095                      .dwattr DW$805, DW_AT_name("val"), DW_AT_symbol_name("_val")
   13096                      .dwattr DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13097                      .dwattr DW$805, DW_AT_accessibility(DW_ACCESS_public)
   13098                      .dwendtag DW$T$68
   13099              
   13100              DW$T$200        .dwtag  DW_TAG_typedef, DW_AT_name("manrefsumstruct"), DW_AT_type(*DW$T$69)
   13101                      .dwattr DW$T$200, DW_AT_language(DW_LANG_C)
   13102              DW$T$204        .dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$70)
   13103                      .dwattr DW$T$204, DW_AT_language(DW_LANG_C)
   13104              
   13105              DW$T$71 .dwtag  DW_TAG_structure_type
   13106                      .dwattr DW$T$71, DW_AT_name("tag_damagemonstruct")
   13107                      .dwattr DW$T$71, DW_AT_byte_size(0x10)
   13108              DW$806  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13109                      .dwattr DW$806, DW_AT_name("ccsplit"), DW_AT_symbol_name("_ccsplit")
   13110                      .dwattr DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13111                      .dwattr DW$806, DW_AT_accessibility(DW_ACCESS_public)
   13112              DW$807  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13113                      .dwattr DW$807, DW_AT_name("kvalue"), DW_AT_symbol_name("_kvalue")
   13114                      .dwattr DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13115                      .dwattr DW$807, DW_AT_accessibility(DW_ACCESS_public)
   13116              DW$808  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13117                      .dwattr DW$808, DW_AT_name("betavalue"), DW_AT_symbol_name("_betavalue")
   13118                      .dwattr DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13119                      .dwattr DW$808, DW_AT_accessibility(DW_ACCESS_public)
   13120              DW$809  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  276

   13121                      .dwattr DW$809, DW_AT_name("rpmlevelx"), DW_AT_symbol_name("_rpmlevelx")
   13122                      .dwattr DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13123                      .dwattr DW$809, DW_AT_accessibility(DW_ACCESS_public)
   13124              DW$810  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13125                      .dwattr DW$810, DW_AT_name("reflevelx"), DW_AT_symbol_name("_reflevelx")
   13126                      .dwattr DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13127                      .dwattr DW$810, DW_AT_accessibility(DW_ACCESS_public)
   13128              DW$811  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13129                      .dwattr DW$811, DW_AT_name("presentstatex"), DW_AT_symbol_name("_presentstatex")
   13130                      .dwattr DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13131                      .dwattr DW$811, DW_AT_accessibility(DW_ACCESS_public)
   13132              DW$812  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13133                      .dwattr DW$812, DW_AT_name("alarmlevelsingle"), DW_AT_symbol_name("_alarmlevelsingle")
   13134                      .dwattr DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13135                      .dwattr DW$812, DW_AT_accessibility(DW_ACCESS_public)
   13136              DW$813  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13137                      .dwattr DW$813, DW_AT_name("alarmlevelcyl"), DW_AT_symbol_name("_alarmlevelcyl")
   13138                      .dwattr DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13139                      .dwattr DW$813, DW_AT_accessibility(DW_ACCESS_public)
   13140              DW$814  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13141                      .dwattr DW$814, DW_AT_name("alarmlevelmbsum"), DW_AT_symbol_name("_alarmlevelmbsum")
   13142                      .dwattr DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13143                      .dwattr DW$814, DW_AT_accessibility(DW_ACCESS_public)
   13144              DW$815  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13145                      .dwattr DW$815, DW_AT_name("cylneighbour"), DW_AT_symbol_name("_cylneighbour")
   13146                      .dwattr DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13147                      .dwattr DW$815, DW_AT_accessibility(DW_ACCESS_public)
   13148              DW$816  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13149                      .dwattr DW$816, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
   13150                      .dwattr DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13151                      .dwattr DW$816, DW_AT_accessibility(DW_ACCESS_public)
   13152              DW$817  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13153                      .dwattr DW$817, DW_AT_name("cylneighbouralarms"), DW_AT_symbol_name("_cylneighbouralarms")
   13154                      .dwattr DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13155                      .dwattr DW$817, DW_AT_accessibility(DW_ACCESS_public)
   13156              DW$818  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13157                      .dwattr DW$818, DW_AT_name("mbneighbouralarms"), DW_AT_symbol_name("_mbneighbouralarms")
   13158                      .dwattr DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13159                      .dwattr DW$818, DW_AT_accessibility(DW_ACCESS_public)
   13160              DW$819  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13161                      .dwattr DW$819, DW_AT_name("deltarpmlimit"), DW_AT_symbol_name("_deltarpmlimit")
   13162                      .dwattr DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13163                      .dwattr DW$819, DW_AT_accessibility(DW_ACCESS_public)
   13164              DW$820  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13165                      .dwattr DW$820, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
   13166                      .dwattr DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13167                      .dwattr DW$820, DW_AT_accessibility(DW_ACCESS_public)
   13168              DW$821  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13169                      .dwattr DW$821, DW_AT_name("damagemonenb"), DW_AT_symbol_name("_damagemonenb")
   13170                      .dwattr DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   13171                      .dwattr DW$821, DW_AT_accessibility(DW_ACCESS_public)
   13172                      .dwendtag DW$T$71
   13173              
   13174              
   13175              DW$T$72 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  277

   13176                      .dwattr DW$T$72, DW_AT_name("tag_dynamicalarmsstruct")
   13177                      .dwattr DW$T$72, DW_AT_byte_size(0x24)
   13178              DW$822  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13179                      .dwattr DW$822, DW_AT_name("rpmav"), DW_AT_symbol_name("_rpmav")
   13180                      .dwattr DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13181                      .dwattr DW$822, DW_AT_accessibility(DW_ACCESS_public)
   13182              DW$823  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13183                      .dwattr DW$823, DW_AT_name("single1"), DW_AT_symbol_name("_single1")
   13184                      .dwattr DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13185                      .dwattr DW$823, DW_AT_accessibility(DW_ACCESS_public)
   13186              DW$824  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13187                      .dwattr DW$824, DW_AT_name("cyl1"), DW_AT_symbol_name("_cyl1")
   13188                      .dwattr DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13189                      .dwattr DW$824, DW_AT_accessibility(DW_ACCESS_public)
   13190              DW$825  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13191                      .dwattr DW$825, DW_AT_name("mbsum1"), DW_AT_symbol_name("_mbsum1")
   13192                      .dwattr DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13193                      .dwattr DW$825, DW_AT_accessibility(DW_ACCESS_public)
   13194              DW$826  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13195                      .dwattr DW$826, DW_AT_name("single2"), DW_AT_symbol_name("_single2")
   13196                      .dwattr DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13197                      .dwattr DW$826, DW_AT_accessibility(DW_ACCESS_public)
   13198              DW$827  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13199                      .dwattr DW$827, DW_AT_name("cyl2"), DW_AT_symbol_name("_cyl2")
   13200                      .dwattr DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13201                      .dwattr DW$827, DW_AT_accessibility(DW_ACCESS_public)
   13202              DW$828  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13203                      .dwattr DW$828, DW_AT_name("mbsum2"), DW_AT_symbol_name("_mbsum2")
   13204                      .dwattr DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13205                      .dwattr DW$828, DW_AT_accessibility(DW_ACCESS_public)
   13206              DW$829  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13207                      .dwattr DW$829, DW_AT_name("deltarpmprev"), DW_AT_symbol_name("_deltarpmprev")
   13208                      .dwattr DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13209                      .dwattr DW$829, DW_AT_accessibility(DW_ACCESS_public)
   13210              DW$830  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13211                      .dwattr DW$830, DW_AT_name("deltarpm"), DW_AT_symbol_name("_deltarpm")
   13212                      .dwattr DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13213                      .dwattr DW$830, DW_AT_accessibility(DW_ACCESS_public)
   13214              DW$831  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13215                      .dwattr DW$831, DW_AT_name("deltarpm_int"), DW_AT_symbol_name("_deltarpm_int")
   13216                      .dwattr DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13217                      .dwattr DW$831, DW_AT_accessibility(DW_ACCESS_public)
   13218              DW$832  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13219                      .dwattr DW$832, DW_AT_name("rpmav_int"), DW_AT_symbol_name("_rpmav_int")
   13220                      .dwattr DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   13221                      .dwattr DW$832, DW_AT_accessibility(DW_ACCESS_public)
   13222              DW$833  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13223                      .dwattr DW$833, DW_AT_name("deltarpmprev_int"), DW_AT_symbol_name("_deltarpmprev_int")
   13224                      .dwattr DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13225                      .dwattr DW$833, DW_AT_accessibility(DW_ACCESS_public)
   13226              DW$834  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13227                      .dwattr DW$834, DW_AT_name("single"), DW_AT_symbol_name("_single")
   13228                      .dwattr DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   13229                      .dwattr DW$834, DW_AT_accessibility(DW_ACCESS_public)
   13230              DW$835  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  278

   13231                      .dwattr DW$835, DW_AT_name("cyl"), DW_AT_symbol_name("_cyl")
   13232                      .dwattr DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13233                      .dwattr DW$835, DW_AT_accessibility(DW_ACCESS_public)
   13234              DW$836  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13235                      .dwattr DW$836, DW_AT_name("mbsum"), DW_AT_symbol_name("_mbsum")
   13236                      .dwattr DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   13237                      .dwattr DW$836, DW_AT_accessibility(DW_ACCESS_public)
   13238              DW$837  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13239                      .dwattr DW$837, DW_AT_name("singleprev"), DW_AT_symbol_name("_singleprev")
   13240                      .dwattr DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13241                      .dwattr DW$837, DW_AT_accessibility(DW_ACCESS_public)
   13242              DW$838  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13243                      .dwattr DW$838, DW_AT_name("cylprev"), DW_AT_symbol_name("_cylprev")
   13244                      .dwattr DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   13245                      .dwattr DW$838, DW_AT_accessibility(DW_ACCESS_public)
   13246              DW$839  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13247                      .dwattr DW$839, DW_AT_name("mbsumprev"), DW_AT_symbol_name("_mbsumprev")
   13248                      .dwattr DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13249                      .dwattr DW$839, DW_AT_accessibility(DW_ACCESS_public)
   13250              DW$840  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13251                      .dwattr DW$840, DW_AT_name("single1_int"), DW_AT_symbol_name("_single1_int")
   13252                      .dwattr DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
   13253                      .dwattr DW$840, DW_AT_accessibility(DW_ACCESS_public)
   13254              DW$841  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13255                      .dwattr DW$841, DW_AT_name("cyl1_int"), DW_AT_symbol_name("_cyl1_int")
   13256                      .dwattr DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13257                      .dwattr DW$841, DW_AT_accessibility(DW_ACCESS_public)
   13258              DW$842  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13259                      .dwattr DW$842, DW_AT_name("mbsum1_int"), DW_AT_symbol_name("_mbsum1_int")
   13260                      .dwattr DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   13261                      .dwattr DW$842, DW_AT_accessibility(DW_ACCESS_public)
   13262              DW$843  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13263                      .dwattr DW$843, DW_AT_name("single2_int"), DW_AT_symbol_name("_single2_int")
   13264                      .dwattr DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   13265                      .dwattr DW$843, DW_AT_accessibility(DW_ACCESS_public)
   13266              DW$844  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13267                      .dwattr DW$844, DW_AT_name("cyl2_int"), DW_AT_symbol_name("_cyl2_int")
   13268                      .dwattr DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
   13269                      .dwattr DW$844, DW_AT_accessibility(DW_ACCESS_public)
   13270              DW$845  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13271                      .dwattr DW$845, DW_AT_name("mbsum2_int"), DW_AT_symbol_name("_mbsum2_int")
   13272                      .dwattr DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   13273                      .dwattr DW$845, DW_AT_accessibility(DW_ACCESS_public)
   13274              DW$846  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   13275                      .dwattr DW$846, DW_AT_name("hits"), DW_AT_symbol_name("_hits")
   13276                      .dwattr DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   13277                      .dwattr DW$846, DW_AT_accessibility(DW_ACCESS_public)
   13278                      .dwendtag DW$T$72
   13279              
   13280              
   13281              DW$T$73 .dwtag  DW_TAG_structure_type
   13282                      .dwattr DW$T$73, DW_AT_name("tag_damalarmsstruct")
   13283                      .dwattr DW$T$73, DW_AT_byte_size(0x04)
   13284              DW$847  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
   13285                      .dwattr DW$847, DW_AT_name("single"), DW_AT_symbol_name("_single")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  279

   13286                      .dwattr DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13287                      .dwattr DW$847, DW_AT_accessibility(DW_ACCESS_public)
   13288              DW$848  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13289                      .dwattr DW$848, DW_AT_name("cylinder"), DW_AT_symbol_name("_cylinder")
   13290                      .dwattr DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13291                      .dwattr DW$848, DW_AT_accessibility(DW_ACCESS_public)
   13292              DW$849  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13293                      .dwattr DW$849, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
   13294                      .dwattr DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13295                      .dwattr DW$849, DW_AT_accessibility(DW_ACCESS_public)
   13296                      .dwendtag DW$T$73
   13297              
   13298              
   13299              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
   13300                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
   13301                      .dwattr DW$T$26, DW_AT_byte_size(0x02)
   13302              DW$850  .dwtag  DW_TAG_subrange_type
   13303                      .dwattr DW$850, DW_AT_upper_bound(0x01)
   13304                      .dwendtag DW$T$26
   13305              
   13306              
   13307              DW$T$51 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
   13308                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
   13309                      .dwattr DW$T$51, DW_AT_byte_size(0x54)
   13310              DW$851  .dwtag  DW_TAG_subrange_type
   13311                      .dwattr DW$851, DW_AT_upper_bound(0x02)
   13312              DW$852  .dwtag  DW_TAG_subrange_type
   13313                      .dwattr DW$852, DW_AT_upper_bound(0x1b)
   13314                      .dwendtag DW$T$51
   13315              
   13316              
   13317              DW$T$28 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
   13318                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
   13319                      .dwattr DW$T$28, DW_AT_byte_size(0x0e)
   13320              DW$853  .dwtag  DW_TAG_subrange_type
   13321                      .dwattr DW$853, DW_AT_upper_bound(0x0d)
   13322                      .dwendtag DW$T$28
   13323              
   13324              
   13325              DW$T$43 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
   13326                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
   13327                      .dwattr DW$T$43, DW_AT_byte_size(0x02)
   13328              DW$854  .dwtag  DW_TAG_subrange_type
   13329                      .dwattr DW$854, DW_AT_upper_bound(0x01)
   13330                      .dwendtag DW$T$43
   13331              
   13332              
   13333              DW$T$44 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
   13334                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
   13335                      .dwattr DW$T$44, DW_AT_byte_size(0x06)
   13336              DW$855  .dwtag  DW_TAG_subrange_type
   13337                      .dwattr DW$855, DW_AT_upper_bound(0x02)
   13338              DW$856  .dwtag  DW_TAG_subrange_type
   13339                      .dwattr DW$856, DW_AT_upper_bound(0x01)
   13340                      .dwendtag DW$T$44
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:57 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
man.asm                                                              PAGE  280

   13341              
   13342              
   13343              DW$T$49 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
   13344                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
   13345                      .dwattr DW$T$49, DW_AT_byte_size(0x03)
   13346              DW$857  .dwtag  DW_TAG_subrange_type
   13347                      .dwattr DW$857, DW_AT_upper_bound(0x02)
   13348                      .dwendtag DW$T$49
   13349              
   13350              
   13351              DW$T$58 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
   13352                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
   13353                      .dwattr DW$T$58, DW_AT_byte_size(0x40)
   13354              DW$858  .dwtag  DW_TAG_subrange_type
   13355                      .dwattr DW$858, DW_AT_upper_bound(0x3f)
   13356                      .dwendtag DW$T$58
   13357              
   13358              
   13359              DW$T$47 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
   13360                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
   13361                      .dwattr DW$T$47, DW_AT_byte_size(0x38)
   13362              DW$859  .dwtag  DW_TAG_subrange_type
   13363                      .dwattr DW$859, DW_AT_upper_bound(0x1b)
   13364                      .dwendtag DW$T$47
   13365              
   13366              
   13367              DW$T$48 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
