TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:20 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("mancal.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    6049                      .dwendtag DW$T$133
    6050              
    6051              DW$T$137        .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$22)
    6052                      .dwattr DW$T$137, DW_AT_language(DW_LANG_C)
    6053              DW$T$138        .dwtag  DW_TAG_typedef, DW_AT_name("motionstruct"), DW_AT_type(*DW$T$24)
    6054                      .dwattr DW$T$138, DW_AT_language(DW_LANG_C)
    6055              DW$359  .dwtag  DW_TAG_far_type
    6056                      .dwattr DW$359, DW_AT_type(*DW$T$139)
    6057              DW$T$140        .dwtag  DW_TAG_volatile_type
    6058                      .dwattr DW$T$140, DW_AT_type(*DW$359)
    6059              DW$T$142        .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$29)
    6060                      .dwattr DW$T$142, DW_AT_language(DW_LANG_C)
    6061              
    6062              DW$T$145        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$144)
    6063                      .dwattr DW$T$145, DW_AT_language(DW_LANG_C)
    6064                      .dwattr DW$T$145, DW_AT_byte_size(0x1f8)
    6065              DW$360  .dwtag  DW_TAG_subrange_type
    6066                      .dwattr DW$360, DW_AT_upper_bound(0x1b)
    6067                      .dwendtag DW$T$145
    6068              
    6069              DW$T$148        .dwtag  DW_TAG_typedef, DW_AT_name("functionstruct"), DW_AT_type(*DW$T$34)
    6070                      .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    6071              
    6072              DW$T$150        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$149)
    6073                      .dwattr DW$T$150, DW_AT_language(DW_LANG_C)
    6074                      .dwattr DW$T$150, DW_AT_byte_size(0x118)
    6075              DW$361  .dwtag  DW_TAG_subrange_type
    6076                      .dwattr DW$361, DW_AT_upper_bound(0x1b)
    6077                      .dwendtag DW$T$150
    6078              
    6079              
    6080              DW$T$154        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$153)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  131

    6081                      .dwattr DW$T$154, DW_AT_language(DW_LANG_C)
    6082                      .dwattr DW$T$154, DW_AT_byte_size(0x1c)
    6083              DW$362  .dwtag  DW_TAG_subrange_type
    6084                      .dwattr DW$362, DW_AT_upper_bound(0x0d)
    6085                      .dwendtag DW$T$154
    6086              
    6087              DW$T$157        .dwtag  DW_TAG_typedef, DW_AT_name("dynamicalarmsstruct"), DW_AT_type(*DW$T$37)
    6088                      .dwattr DW$T$157, DW_AT_language(DW_LANG_C)
    6089              DW$T$59 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
    6090                      .dwattr DW$T$59, DW_AT_address_class(0x16)
    6091              DW$T$83 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$82)
    6092                      .dwattr DW$T$83, DW_AT_address_class(0x16)
    6093              
    6094              DW$T$158        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$38)
    6095                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    6096                      .dwattr DW$T$158, DW_AT_byte_size(0x64)
    6097              DW$363  .dwtag  DW_TAG_subrange_type
    6098                      .dwattr DW$363, DW_AT_upper_bound(0x63)
    6099                      .dwendtag DW$T$158
    6100              
    6101              DW$364  .dwtag  DW_TAG_far_type
    6102                      .dwattr DW$364, DW_AT_type(*DW$T$160)
    6103              DW$T$161        .dwtag  DW_TAG_const_type
    6104                      .dwattr DW$T$161, DW_AT_type(*DW$364)
    6105              DW$T$164        .dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$42)
    6106                      .dwattr DW$T$164, DW_AT_language(DW_LANG_C)
    6107              DW$T$165        .dwtag  DW_TAG_typedef, DW_AT_name("sensorMovingstruct"), DW_AT_type(*DW$T$43)
    6108                      .dwattr DW$T$165, DW_AT_language(DW_LANG_C)
    6109              DW$T$166        .dwtag  DW_TAG_typedef, DW_AT_name("calibrationstruct"), DW_AT_type(*DW$T$53)
    6110                      .dwattr DW$T$166, DW_AT_language(DW_LANG_C)
    6111              DW$T$168        .dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$54)
    6112                      .dwattr DW$T$168, DW_AT_language(DW_LANG_C)
    6113              DW$T$170        .dwtag  DW_TAG_typedef, DW_AT_name("mancalstruct"), DW_AT_type(*DW$T$55)
    6114                      .dwattr DW$T$170, DW_AT_language(DW_LANG_C)
    6115              DW$T$116        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$12)
    6116                      .dwattr DW$T$116, DW_AT_address_class(0x16)
    6117              DW$T$118        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
    6118                      .dwattr DW$T$118, DW_AT_address_class(0x16)
    6119              DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$19)
    6120                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    6121              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("sensoralarmstruct"), DW_AT_type(*DW$T$20)
    6122                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    6123              
    6124              DW$T$22 .dwtag  DW_TAG_structure_type
    6125                      .dwattr DW$T$22, DW_AT_name("tag_settingsstruct")
    6126                      .dwattr DW$T$22, DW_AT_byte_size(0x24)
    6127              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6128                      .dwattr DW$365, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    6129                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6130                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    6131              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6132                      .dwattr DW$366, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    6133                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6134                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6135              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  132

    6136                      .dwattr DW$367, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    6137                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6138                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6139              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6140                      .dwattr DW$368, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    6141                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6142                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6143              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6144                      .dwattr DW$369, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    6145                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6146                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6147              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6148                      .dwattr DW$370, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    6149                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6150                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    6151              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6152                      .dwattr DW$371, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    6153                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6154                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6155              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6156                      .dwattr DW$372, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    6157                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6158                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6159              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6160                      .dwattr DW$373, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    6161                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6162                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6163              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6164                      .dwattr DW$374, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    6165                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6166                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6167              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6168                      .dwattr DW$375, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    6169                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6170                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6171              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6172                      .dwattr DW$376, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    6173                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6174                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6175              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6176                      .dwattr DW$377, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    6177                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6178                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6179              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6180                      .dwattr DW$378, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    6181                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6182                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6183              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6184                      .dwattr DW$379, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    6185                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6186                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6187              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6188                      .dwattr DW$380, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    6189                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6190                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  133

    6191              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6192                      .dwattr DW$381, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    6193                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6194                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6195              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6196                      .dwattr DW$382, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    6197                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6198                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6199              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6200                      .dwattr DW$383, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    6201                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6202                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    6203              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6204                      .dwattr DW$384, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    6205                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6206                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6207              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6208                      .dwattr DW$385, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    6209                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6210                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6211              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6212                      .dwattr DW$386, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    6213                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6214                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6215              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6216                      .dwattr DW$387, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    6217                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6218                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6219              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6220                      .dwattr DW$388, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    6221                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6222                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6223              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6224                      .dwattr DW$389, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    6225                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6226                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6227              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6228                      .dwattr DW$390, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    6229                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6230                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6231              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6232                      .dwattr DW$391, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    6233                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6234                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6235              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6236                      .dwattr DW$392, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    6237                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6238                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6239              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6240                      .dwattr DW$393, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    6241                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6242                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6243              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6244                      .dwattr DW$394, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    6245                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  134

    6246                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6247              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6248                      .dwattr DW$395, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    6249                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6250                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6251              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6252                      .dwattr DW$396, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    6253                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6254                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6255              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6256                      .dwattr DW$397, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    6257                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6258                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6259              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6260                      .dwattr DW$398, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    6261                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6262                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6263              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6264                      .dwattr DW$399, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    6265                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6266                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6267                      .dwendtag DW$T$22
    6268              
    6269              
    6270              DW$T$24 .dwtag  DW_TAG_structure_type
    6271                      .dwattr DW$T$24, DW_AT_name("tag_motionstruct")
    6272                      .dwattr DW$T$24, DW_AT_byte_size(0x09)
    6273              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6274                      .dwattr DW$400, DW_AT_name("counter"), DW_AT_symbol_name("_counter")
    6275                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6276                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6277              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6278                      .dwattr DW$401, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
    6279                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6280                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6281              DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    6282                      .dwattr DW$402, DW_AT_name("order"), DW_AT_symbol_name("_order")
    6283                      .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6284                      .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6285              DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6286                      .dwattr DW$403, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    6287                      .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6288                      .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6289              DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6290                      .dwattr DW$404, DW_AT_name("forwardasternflagprev"), DW_AT_symbol_name("_forwardasternflagprev")
    6291                      .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6292                      .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6293              DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6294                      .dwattr DW$405, DW_AT_name("recalnow"), DW_AT_symbol_name("_recalnow")
    6295                      .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6296                      .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6297              DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6298                      .dwattr DW$406, DW_AT_name("calerror"), DW_AT_symbol_name("_calerror")
    6299                      .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6300                      .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  135

    6301              DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6302                      .dwattr DW$407, DW_AT_name("recheckdir"), DW_AT_symbol_name("_recheckdir")
    6303                      .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6304                      .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6305                      .dwendtag DW$T$24
    6306              
    6307              DW$T$139        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$26)
    6308                      .dwattr DW$T$139, DW_AT_language(DW_LANG_C)
    6309              
    6310              DW$T$29 .dwtag  DW_TAG_structure_type
    6311                      .dwattr DW$T$29, DW_AT_name("tag_allsensorstruct")
    6312                      .dwattr DW$T$29, DW_AT_byte_size(0x2d)
    6313              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6314                      .dwattr DW$408, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    6315                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6316                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6317              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6318                      .dwattr DW$409, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    6319                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6320                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6321              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6322                      .dwattr DW$410, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    6323                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6324                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6325              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6326                      .dwattr DW$411, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    6327                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6328                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    6329              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6330                      .dwattr DW$412, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    6331                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6332                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    6333              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6334                      .dwattr DW$413, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    6335                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6336                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6337              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6338                      .dwattr DW$414, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    6339                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6340                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6341              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6342                      .dwattr DW$415, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    6343                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6344                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6345              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6346                      .dwattr DW$416, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    6347                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6348                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6349              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6350                      .dwattr DW$417, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    6351                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6352                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6353              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6354                      .dwattr DW$418, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    6355                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  136

    6356                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6357              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6358                      .dwattr DW$419, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    6359                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6360                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6361              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6362                      .dwattr DW$420, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    6363                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6364                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    6365              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6366                      .dwattr DW$421, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    6367                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6368                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6369              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6370                      .dwattr DW$422, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    6371                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6372                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6373              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6374                      .dwattr DW$423, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    6375                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6376                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6377              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6378                      .dwattr DW$424, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    6379                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6380                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6381              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6382                      .dwattr DW$425, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    6383                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6384                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6385              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6386                      .dwattr DW$426, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    6387                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6388                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6389              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6390                      .dwattr DW$427, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    6391                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6392                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6393              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6394                      .dwattr DW$428, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    6395                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6396                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6397              DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6398                      .dwattr DW$429, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    6399                      .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6400                      .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6401              DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6402                      .dwattr DW$430, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    6403                      .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6404                      .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6405              DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6406                      .dwattr DW$431, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    6407                      .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6408                      .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6409              DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6410                      .dwattr DW$432, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  137

    6411                      .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6412                      .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6413              DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6414                      .dwattr DW$433, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    6415                      .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6416                      .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6417              DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6418                      .dwattr DW$434, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    6419                      .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6420                      .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6421              DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6422                      .dwattr DW$435, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    6423                      .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6424                      .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6425              DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6426                      .dwattr DW$436, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    6427                      .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6428                      .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6429              DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6430                      .dwattr DW$437, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    6431                      .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6432                      .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6433              DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6434                      .dwattr DW$438, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    6435                      .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    6436                      .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6437              DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6438                      .dwattr DW$439, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    6439                      .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6440                      .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6441                      .dwendtag DW$T$29
    6442              
    6443              DW$T$144        .dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$32)
    6444                      .dwattr DW$T$144, DW_AT_language(DW_LANG_C)
    6445              
    6446              DW$T$34 .dwtag  DW_TAG_structure_type
    6447                      .dwattr DW$T$34, DW_AT_name("tag_functionstruct")
    6448                      .dwattr DW$T$34, DW_AT_byte_size(0x08)
    6449              DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    6450                      .dwattr DW$440, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    6451                      .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6452                      .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6453                      .dwendtag DW$T$34
    6454              
    6455              DW$T$149        .dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$35)
    6456                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
    6457              DW$T$153        .dwtag  DW_TAG_typedef, DW_AT_name("manrefsumstruct"), DW_AT_type(*DW$T$36)
    6458                      .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    6459              
    6460              DW$T$37 .dwtag  DW_TAG_structure_type
    6461                      .dwattr DW$T$37, DW_AT_name("tag_dynamicalarmsstruct")
    6462                      .dwattr DW$T$37, DW_AT_byte_size(0x24)
    6463              DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6464                      .dwattr DW$441, DW_AT_name("rpmav"), DW_AT_symbol_name("_rpmav")
    6465                      .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  138

    6466                      .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6467              DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6468                      .dwattr DW$442, DW_AT_name("single1"), DW_AT_symbol_name("_single1")
    6469                      .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6470                      .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    6471              DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6472                      .dwattr DW$443, DW_AT_name("cyl1"), DW_AT_symbol_name("_cyl1")
    6473                      .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6474                      .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    6475              DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6476                      .dwattr DW$444, DW_AT_name("mbsum1"), DW_AT_symbol_name("_mbsum1")
    6477                      .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6478                      .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    6479              DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6480                      .dwattr DW$445, DW_AT_name("single2"), DW_AT_symbol_name("_single2")
    6481                      .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6482                      .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    6483              DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6484                      .dwattr DW$446, DW_AT_name("cyl2"), DW_AT_symbol_name("_cyl2")
    6485                      .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6486                      .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    6487              DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6488                      .dwattr DW$447, DW_AT_name("mbsum2"), DW_AT_symbol_name("_mbsum2")
    6489                      .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6490                      .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    6491              DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6492                      .dwattr DW$448, DW_AT_name("deltarpmprev"), DW_AT_symbol_name("_deltarpmprev")
    6493                      .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6494                      .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
    6495              DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    6496                      .dwattr DW$449, DW_AT_name("deltarpm"), DW_AT_symbol_name("_deltarpm")
    6497                      .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6498                      .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    6499              DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6500                      .dwattr DW$450, DW_AT_name("deltarpm_int"), DW_AT_symbol_name("_deltarpm_int")
    6501                      .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6502                      .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    6503              DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6504                      .dwattr DW$451, DW_AT_name("rpmav_int"), DW_AT_symbol_name("_rpmav_int")
    6505                      .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6506                      .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    6507              DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6508                      .dwattr DW$452, DW_AT_name("deltarpmprev_int"), DW_AT_symbol_name("_deltarpmprev_int")
    6509                      .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6510                      .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    6511              DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6512                      .dwattr DW$453, DW_AT_name("single"), DW_AT_symbol_name("_single")
    6513                      .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6514                      .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    6515              DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6516                      .dwattr DW$454, DW_AT_name("cyl"), DW_AT_symbol_name("_cyl")
    6517                      .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6518                      .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    6519              DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6520                      .dwattr DW$455, DW_AT_name("mbsum"), DW_AT_symbol_name("_mbsum")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  139

    6521                      .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6522                      .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    6523              DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6524                      .dwattr DW$456, DW_AT_name("singleprev"), DW_AT_symbol_name("_singleprev")
    6525                      .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6526                      .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    6527              DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6528                      .dwattr DW$457, DW_AT_name("cylprev"), DW_AT_symbol_name("_cylprev")
    6529                      .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6530                      .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    6531              DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6532                      .dwattr DW$458, DW_AT_name("mbsumprev"), DW_AT_symbol_name("_mbsumprev")
    6533                      .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6534                      .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    6535              DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6536                      .dwattr DW$459, DW_AT_name("single1_int"), DW_AT_symbol_name("_single1_int")
    6537                      .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6538                      .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
    6539              DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6540                      .dwattr DW$460, DW_AT_name("cyl1_int"), DW_AT_symbol_name("_cyl1_int")
    6541                      .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6542                      .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    6543              DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6544                      .dwattr DW$461, DW_AT_name("mbsum1_int"), DW_AT_symbol_name("_mbsum1_int")
    6545                      .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6546                      .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    6547              DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6548                      .dwattr DW$462, DW_AT_name("single2_int"), DW_AT_symbol_name("_single2_int")
    6549                      .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6550                      .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    6551              DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6552                      .dwattr DW$463, DW_AT_name("cyl2_int"), DW_AT_symbol_name("_cyl2_int")
    6553                      .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6554                      .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    6555              DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6556                      .dwattr DW$464, DW_AT_name("mbsum2_int"), DW_AT_symbol_name("_mbsum2_int")
    6557                      .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6558                      .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    6559              DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    6560                      .dwattr DW$465, DW_AT_name("hits"), DW_AT_symbol_name("_hits")
    6561                      .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6562                      .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    6563                      .dwendtag DW$T$37
    6564              
    6565              DW$T$38 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    6566                      .dwattr DW$T$38, DW_AT_encoding(DW_ATE_signed_char)
    6567                      .dwattr DW$T$38, DW_AT_byte_size(0x01)
    6568              DW$466  .dwtag  DW_TAG_far_type
    6569                      .dwattr DW$466, DW_AT_type(*DW$T$38)
    6570              DW$T$82 .dwtag  DW_TAG_const_type
    6571                      .dwattr DW$T$82, DW_AT_type(*DW$466)
    6572              DW$T$160        .dwtag  DW_TAG_typedef, DW_AT_name("sdcarddirstruct"), DW_AT_type(*DW$T$40)
    6573                      .dwattr DW$T$160, DW_AT_language(DW_LANG_C)
    6574              
    6575              DW$T$42 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  140

    6576                      .dwattr DW$T$42, DW_AT_name("tag_sdsettingsstruct")
    6577                      .dwattr DW$T$42, DW_AT_byte_size(0x04)
    6578              DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6579                      .dwattr DW$467, DW_AT_name("present"), DW_AT_symbol_name("_present")
    6580                      .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6581                      .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    6582              DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6583                      .dwattr DW$468, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
    6584                      .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6585                      .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    6586              DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6587                      .dwattr DW$469, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
    6588                      .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6589                      .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    6590              DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    6591                      .dwattr DW$470, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
    6592                      .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6593                      .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    6594                      .dwendtag DW$T$42
    6595              
    6596              
    6597              DW$T$43 .dwtag  DW_TAG_structure_type
    6598                      .dwattr DW$T$43, DW_AT_name("tag_sensorMoving")
    6599                      .dwattr DW$T$43, DW_AT_byte_size(0x02)
    6600              DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6601                      .dwattr DW$471, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
    6602                      .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6603                      .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    6604              DW$472  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6605                      .dwattr DW$472, DW_AT_name("unusedByte"), DW_AT_symbol_name("_unusedByte")
    6606                      .dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6607                      .dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
    6608                      .dwendtag DW$T$43
    6609              
    6610              
    6611              DW$T$53 .dwtag  DW_TAG_structure_type
    6612                      .dwattr DW$T$53, DW_AT_name("tag_calibrationstruct")
    6613                      .dwattr DW$T$53, DW_AT_byte_size(0x31a)
    6614              DW$473  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6615                      .dwattr DW$473, DW_AT_name("rpmpoints"), DW_AT_symbol_name("_rpmpoints")
    6616                      .dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6617                      .dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
    6618              DW$474  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    6619                      .dwattr DW$474, DW_AT_name("speedcalpoints"), DW_AT_symbol_name("_speedcalpoints")
    6620                      .dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6621                      .dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
    6622              DW$475  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    6623                      .dwattr DW$475, DW_AT_name("roughnumpoints"), DW_AT_symbol_name("_roughnumpoints")
    6624                      .dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6625                      .dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
    6626              DW$476  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    6627                      .dwattr DW$476, DW_AT_name("numpoints"), DW_AT_symbol_name("_numpoints")
    6628                      .dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6629                      .dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
    6630              DW$477  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  141

    6631                      .dwattr DW$477, DW_AT_name("averagespeedacc"), DW_AT_symbol_name("_averagespeedacc")
    6632                      .dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
    6633                      .dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
    6634              DW$478  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    6635                      .dwattr DW$478, DW_AT_name("averagevalacc"), DW_AT_symbol_name("_averagevalacc")
    6636                      .dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e2]
    6637                      .dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
    6638              DW$479  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6639                      .dwattr DW$479, DW_AT_name("validpoints"), DW_AT_symbol_name("_validpoints")
    6640                      .dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x28a]
    6641                      .dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
    6642              DW$480  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    6643                      .dwattr DW$480, DW_AT_name("rpmatcal"), DW_AT_symbol_name("_rpmatcal")
    6644                      .dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x28b]
    6645                      .dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
    6646              DW$481  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    6647                      .dwattr DW$481, DW_AT_name("manroughcalpts"), DW_AT_symbol_name("_manroughcalpts")
    6648                      .dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x28e]
    6649                      .dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
    6650              DW$482  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    6651                      .dwattr DW$482, DW_AT_name("manroughmin"), DW_AT_symbol_name("_manroughmin")
    6652                      .dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e2]
    6653                      .dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
    6654              DW$483  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    6655                      .dwattr DW$483, DW_AT_name("manroughmax"), DW_AT_symbol_name("_manroughmax")
    6656                      .dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2fe]
    6657                      .dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
    6658                      .dwendtag DW$T$53
    6659              
    6660              
    6661              DW$T$54 .dwtag  DW_TAG_structure_type
    6662                      .dwattr DW$T$54, DW_AT_name("tag_speedcompstruct")
    6663                      .dwattr DW$T$54, DW_AT_byte_size(0x19)
    6664              DW$484  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6665                      .dwattr DW$484, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
    6666                      .dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6667                      .dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
    6668              DW$485  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6669                      .dwattr DW$485, DW_AT_name("status"), DW_AT_symbol_name("_status")
    6670                      .dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6671                      .dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
    6672              DW$486  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    6673                      .dwattr DW$486, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
    6674                      .dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6675                      .dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
    6676              DW$487  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6677                      .dwattr DW$487, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
    6678                      .dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6679                      .dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
    6680              DW$488  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6681                      .dwattr DW$488, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
    6682                      .dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6683                      .dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
    6684              DW$489  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6685                      .dwattr DW$489, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  142

    6686                      .dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6687                      .dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
    6688              DW$490  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6689                      .dwattr DW$490, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
    6690                      .dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6691                      .dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
    6692              DW$491  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6693                      .dwattr DW$491, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
    6694                      .dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6695                      .dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
    6696              DW$492  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6697                      .dwattr DW$492, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
    6698                      .dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6699                      .dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
    6700              DW$493  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6701                      .dwattr DW$493, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
    6702                      .dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6703                      .dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
    6704              DW$494  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6705                      .dwattr DW$494, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
    6706                      .dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6707                      .dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
    6708              DW$495  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6709                      .dwattr DW$495, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    6710                      .dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6711                      .dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
    6712              DW$496  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6713                      .dwattr DW$496, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    6714                      .dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6715                      .dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
    6716              DW$497  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6717                      .dwattr DW$497, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    6718                      .dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6719                      .dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
    6720              DW$498  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6721                      .dwattr DW$498, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    6722                      .dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6723                      .dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
    6724              DW$499  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6725                      .dwattr DW$499, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    6726                      .dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6727                      .dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
    6728              DW$500  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6729                      .dwattr DW$500, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    6730                      .dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6731                      .dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
    6732              DW$501  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6733                      .dwattr DW$501, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    6734                      .dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6735                      .dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
    6736              DW$502  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6737                      .dwattr DW$502, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    6738                      .dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6739                      .dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
    6740              DW$503  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  143

    6741                      .dwattr DW$503, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    6742                      .dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6743                      .dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
    6744                      .dwendtag DW$T$54
    6745              
    6746              
    6747              DW$T$55 .dwtag  DW_TAG_structure_type
    6748                      .dwattr DW$T$55, DW_AT_name("tag_mancalstruct")
    6749                      .dwattr DW$T$55, DW_AT_byte_size(0x04)
    6750              DW$504  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6751                      .dwattr DW$504, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
    6752                      .dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6753                      .dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6754              DW$505  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6755                      .dwattr DW$505, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
    6756                      .dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6757                      .dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6758              DW$506  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6759                      .dwattr DW$506, DW_AT_name("percentleft"), DW_AT_symbol_name("_percentleft")
    6760                      .dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6761                      .dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6762              DW$507  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6763                      .dwattr DW$507, DW_AT_name("manupdateflag"), DW_AT_symbol_name("_manupdateflag")
    6764                      .dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6765                      .dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6766                      .dwendtag DW$T$55
    6767              
    6768              
    6769              DW$T$23 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    6770                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    6771                      .dwattr DW$T$23, DW_AT_byte_size(0x02)
    6772              DW$508  .dwtag  DW_TAG_subrange_type
    6773                      .dwattr DW$508, DW_AT_upper_bound(0x01)
    6774                      .dwendtag DW$T$23
    6775              
    6776              
    6777              DW$T$52 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    6778                      .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
    6779                      .dwattr DW$T$52, DW_AT_byte_size(0x54)
    6780              DW$509  .dwtag  DW_TAG_subrange_type
    6781                      .dwattr DW$509, DW_AT_upper_bound(0x02)
    6782              DW$510  .dwtag  DW_TAG_subrange_type
    6783                      .dwattr DW$510, DW_AT_upper_bound(0x1b)
    6784                      .dwendtag DW$T$52
    6785              
    6786              
    6787              DW$T$25 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    6788                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    6789                      .dwattr DW$T$25, DW_AT_byte_size(0x0e)
    6790              DW$511  .dwtag  DW_TAG_subrange_type
    6791                      .dwattr DW$511, DW_AT_upper_bound(0x0d)
    6792                      .dwendtag DW$T$25
    6793              
    6794              
    6795              DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  144

    6796                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    6797                      .dwattr DW$T$45, DW_AT_byte_size(0x06)
    6798              DW$512  .dwtag  DW_TAG_subrange_type
    6799                      .dwattr DW$512, DW_AT_upper_bound(0x02)
    6800              DW$513  .dwtag  DW_TAG_subrange_type
    6801                      .dwattr DW$513, DW_AT_upper_bound(0x01)
    6802                      .dwendtag DW$T$45
    6803              
    6804              
    6805              DW$T$50 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    6806                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    6807                      .dwattr DW$T$50, DW_AT_byte_size(0x03)
    6808              DW$514  .dwtag  DW_TAG_subrange_type
    6809                      .dwattr DW$514, DW_AT_upper_bound(0x02)
    6810                      .dwendtag DW$T$50
    6811              
    6812              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
    6813                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
    6814                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
    6815              
    6816              DW$T$49 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
    6817                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
    6818                      .dwattr DW$T$49, DW_AT_byte_size(0xa8)
    6819              DW$515  .dwtag  DW_TAG_subrange_type
    6820                      .dwattr DW$515, DW_AT_upper_bound(0x02)
    6821              DW$516  .dwtag  DW_TAG_subrange_type
    6822                      .dwattr DW$516, DW_AT_upper_bound(0x1b)
    6823                      .dwendtag DW$T$49
    6824              
    6825              
    6826              DW$T$46 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
    6827                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    6828                      .dwattr DW$T$46, DW_AT_byte_size(0x06)
    6829              DW$517  .dwtag  DW_TAG_subrange_type
    6830                      .dwattr DW$517, DW_AT_upper_bound(0x02)
    6831                      .dwendtag DW$T$46
    6832              
    6833              
    6834              DW$T$47 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
    6835                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    6836                      .dwattr DW$T$47, DW_AT_byte_size(0x12c)
    6837              DW$518  .dwtag  DW_TAG_subrange_type
    6838                      .dwattr DW$518, DW_AT_upper_bound(0x95)
    6839                      .dwendtag DW$T$47
    6840              
    6841              
    6842              DW$T$19 .dwtag  DW_TAG_structure_type
    6843                      .dwattr DW$T$19, DW_AT_name("tag_status1struct")
    6844                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    6845              DW$519  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6846                      .dwattr DW$519, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    6847                      .dwattr DW$519, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    6848                      .dwattr DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6849                      .dwattr DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6850              DW$520  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  145

    6851                      .dwattr DW$520, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    6852                      .dwattr DW$520, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    6853                      .dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6854                      .dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6855              DW$521  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6856                      .dwattr DW$521, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
    6857                      .dwattr DW$521, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    6858                      .dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6859                      .dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6860              DW$522  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6861                      .dwattr DW$522, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    6862                      .dwattr DW$522, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    6863                      .dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6864                      .dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6865              DW$523  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6866                      .dwattr DW$523, DW_AT_name("replaced"), DW_AT_symbol_name("_replaced")
    6867                      .dwattr DW$523, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    6868                      .dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6869                      .dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6870              DW$524  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6871                      .dwattr DW$524, DW_AT_name("excludeslowroll"), DW_AT_symbol_name("_excludeslowroll")
    6872                      .dwattr DW$524, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    6873                      .dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6874                      .dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6875              DW$525  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6876                      .dwattr DW$525, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    6877                      .dwattr DW$525, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    6878                      .dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6879                      .dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6880              DW$526  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6881                      .dwattr DW$526, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    6882                      .dwattr DW$526, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    6883                      .dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6884                      .dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6885              DW$527  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6886                      .dwattr DW$527, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    6887                      .dwattr DW$527, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    6888                      .dwattr DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6889                      .dwattr DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6890              DW$528  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6891                      .dwattr DW$528, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    6892                      .dwattr DW$528, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    6893                      .dwattr DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6894                      .dwattr DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6895              DW$529  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6896                      .dwattr DW$529, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    6897                      .dwattr DW$529, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    6898                      .dwattr DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6899                      .dwattr DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6900              DW$530  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6901                      .dwattr DW$530, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    6902                      .dwattr DW$530, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    6903                      .dwattr DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6904                      .dwattr DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6905              DW$531  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  146

    6906                      .dwattr DW$531, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    6907                      .dwattr DW$531, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    6908                      .dwattr DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6909                      .dwattr DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6910              DW$532  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6911                      .dwattr DW$532, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    6912                      .dwattr DW$532, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    6913                      .dwattr DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6914                      .dwattr DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6915              DW$533  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6916                      .dwattr DW$533, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    6917                      .dwattr DW$533, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    6918                      .dwattr DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6919                      .dwattr DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6920              DW$534  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6921                      .dwattr DW$534, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    6922                      .dwattr DW$534, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    6923                      .dwattr DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6924                      .dwattr DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6925                      .dwendtag DW$T$19
    6926              
    6927              
    6928              DW$T$20 .dwtag  DW_TAG_structure_type
    6929                      .dwattr DW$T$20, DW_AT_name("tag_sensoralarmstruct")
    6930                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    6931              DW$535  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6932                      .dwattr DW$535, DW_AT_name("failure"), DW_AT_symbol_name("_failure")
    6933                      .dwattr DW$535, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    6934                      .dwattr DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6935                      .dwattr DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6936              DW$536  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6937                      .dwattr DW$536, DW_AT_name("failurelatched"), DW_AT_symbol_name("_failurelatched")
    6938                      .dwattr DW$536, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    6939                      .dwattr DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6940                      .dwattr DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6941              DW$537  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6942                      .dwattr DW$537, DW_AT_name("slowdown"), DW_AT_symbol_name("_slowdown")
    6943                      .dwattr DW$537, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    6944                      .dwattr DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6945                      .dwattr DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6946              DW$538  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6947                      .dwattr DW$538, DW_AT_name("slowdownlatched"), DW_AT_symbol_name("_slowdownlatched")
    6948                      .dwattr DW$538, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    6949                      .dwattr DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6950                      .dwattr DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6951              DW$539  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6952                      .dwattr DW$539, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
    6953                      .dwattr DW$539, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    6954                      .dwattr DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6955                      .dwattr DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6956              DW$540  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6957                      .dwattr DW$540, DW_AT_name("alarmlatched"), DW_AT_symbol_name("_alarmlatched")
    6958                      .dwattr DW$540, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    6959                      .dwattr DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6960                      .dwattr DW$540, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  147

    6961              DW$541  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6962                      .dwattr DW$541, DW_AT_name("devalarm"), DW_AT_symbol_name("_devalarm")
    6963                      .dwattr DW$541, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    6964                      .dwattr DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6965                      .dwattr DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6966              DW$542  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6967                      .dwattr DW$542, DW_AT_name("devalarmlatched"), DW_AT_symbol_name("_devalarmlatched")
    6968                      .dwattr DW$542, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    6969                      .dwattr DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6970                      .dwattr DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6971              DW$543  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6972                      .dwattr DW$543, DW_AT_name("devslow"), DW_AT_symbol_name("_devslow")
    6973                      .dwattr DW$543, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    6974                      .dwattr DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6975                      .dwattr DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6976              DW$544  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6977                      .dwattr DW$544, DW_AT_name("devslowlatched"), DW_AT_symbol_name("_devslowlatched")
    6978                      .dwattr DW$544, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    6979                      .dwattr DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6980                      .dwattr DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6981              DW$545  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6982                      .dwattr DW$545, DW_AT_name("calibration"), DW_AT_symbol_name("_calibration")
    6983                      .dwattr DW$545, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    6984                      .dwattr DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6985                      .dwattr DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6986              DW$546  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6987                      .dwattr DW$546, DW_AT_name("calibrationlatched"), DW_AT_symbol_name("_calibrationlatched")
    6988                      .dwattr DW$546, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    6989                      .dwattr DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6990                      .dwattr DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6991              DW$547  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6992                      .dwattr DW$547, DW_AT_name("prewarning"), DW_AT_symbol_name("_prewarning")
    6993                      .dwattr DW$547, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    6994                      .dwattr DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6995                      .dwattr DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6996              DW$548  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6997                      .dwattr DW$548, DW_AT_name("prewarninglatched"), DW_AT_symbol_name("_prewarninglatched")
    6998                      .dwattr DW$548, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    6999                      .dwattr DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7000                      .dwattr DW$548, DW_AT_accessibility(DW_ACCESS_public)
    7001              DW$549  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7002                      .dwattr DW$549, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    7003                      .dwattr DW$549, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    7004                      .dwattr DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7005                      .dwattr DW$549, DW_AT_accessibility(DW_ACCESS_public)
    7006              DW$550  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7007                      .dwattr DW$550, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    7008                      .dwattr DW$550, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    7009                      .dwattr DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7010                      .dwattr DW$550, DW_AT_accessibility(DW_ACCESS_public)
    7011                      .dwendtag DW$T$20
    7012              
    7013              
    7014              DW$T$21 .dwtag  DW_TAG_structure_type
    7015                      .dwattr DW$T$21, DW_AT_byte_size(0x02)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  148

    7016              DW$551  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7017                      .dwattr DW$551, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    7018                      .dwattr DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7019                      .dwattr DW$551, DW_AT_accessibility(DW_ACCESS_public)
    7020              DW$552  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7021                      .dwattr DW$552, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    7022                      .dwattr DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7023                      .dwattr DW$552, DW_AT_accessibility(DW_ACCESS_public)
    7024                      .dwendtag DW$T$21
    7025              
    7026              
    7027              DW$T$26 .dwtag  DW_TAG_structure_type
    7028                      .dwattr DW$T$26, DW_AT_name("tag_timers")
    7029                      .dwattr DW$T$26, DW_AT_byte_size(0x4c)
    7030              DW$553  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7031                      .dwattr DW$553, DW_AT_name("update"), DW_AT_symbol_name("_update")
    7032                      .dwattr DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7033                      .dwattr DW$553, DW_AT_accessibility(DW_ACCESS_public)
    7034              DW$554  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7035                      .dwattr DW$554, DW_AT_name("general"), DW_AT_symbol_name("_general")
    7036                      .dwattr DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7037                      .dwattr DW$554, DW_AT_accessibility(DW_ACCESS_public)
    7038              DW$555  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7039                      .dwattr DW$555, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    7040                      .dwattr DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7041                      .dwattr DW$555, DW_AT_accessibility(DW_ACCESS_public)
    7042              DW$556  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7043                      .dwattr DW$556, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    7044                      .dwattr DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7045                      .dwattr DW$556, DW_AT_accessibility(DW_ACCESS_public)
    7046              DW$557  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7047                      .dwattr DW$557, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    7048                      .dwattr DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7049                      .dwattr DW$557, DW_AT_accessibility(DW_ACCESS_public)
    7050              DW$558  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7051                      .dwattr DW$558, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    7052                      .dwattr DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7053                      .dwattr DW$558, DW_AT_accessibility(DW_ACCESS_public)
    7054              DW$559  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7055                      .dwattr DW$559, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    7056                      .dwattr DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7057                      .dwattr DW$559, DW_AT_accessibility(DW_ACCESS_public)
    7058              DW$560  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7059                      .dwattr DW$560, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    7060                      .dwattr DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7061                      .dwattr DW$560, DW_AT_accessibility(DW_ACCESS_public)
    7062              DW$561  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7063                      .dwattr DW$561, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    7064                      .dwattr DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7065                      .dwattr DW$561, DW_AT_accessibility(DW_ACCESS_public)
    7066              DW$562  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7067                      .dwattr DW$562, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    7068                      .dwattr DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7069                      .dwattr DW$562, DW_AT_accessibility(DW_ACCESS_public)
    7070              DW$563  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  149

    7071                      .dwattr DW$563, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    7072                      .dwattr DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7073                      .dwattr DW$563, DW_AT_accessibility(DW_ACCESS_public)
    7074              DW$564  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    7075                      .dwattr DW$564, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    7076                      .dwattr DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7077                      .dwattr DW$564, DW_AT_accessibility(DW_ACCESS_public)
    7078              DW$565  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7079                      .dwattr DW$565, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    7080                      .dwattr DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7081                      .dwattr DW$565, DW_AT_accessibility(DW_ACCESS_public)
    7082              DW$566  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7083                      .dwattr DW$566, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    7084                      .dwattr DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7085                      .dwattr DW$566, DW_AT_accessibility(DW_ACCESS_public)
    7086              DW$567  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7087                      .dwattr DW$567, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    7088                      .dwattr DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7089                      .dwattr DW$567, DW_AT_accessibility(DW_ACCESS_public)
    7090              DW$568  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7091                      .dwattr DW$568, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    7092                      .dwattr DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    7093                      .dwattr DW$568, DW_AT_accessibility(DW_ACCESS_public)
    7094              DW$569  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7095                      .dwattr DW$569, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    7096                      .dwattr DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7097                      .dwattr DW$569, DW_AT_accessibility(DW_ACCESS_public)
    7098              DW$570  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7099                      .dwattr DW$570, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    7100                      .dwattr DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    7101                      .dwattr DW$570, DW_AT_accessibility(DW_ACCESS_public)
    7102              DW$571  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7103                      .dwattr DW$571, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    7104                      .dwattr DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7105                      .dwattr DW$571, DW_AT_accessibility(DW_ACCESS_public)
    7106              DW$572  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    7107                      .dwattr DW$572, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    7108                      .dwattr DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7109                      .dwattr DW$572, DW_AT_accessibility(DW_ACCESS_public)
    7110              DW$573  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    7111                      .dwattr DW$573, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    7112                      .dwattr DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7113                      .dwattr DW$573, DW_AT_accessibility(DW_ACCESS_public)
    7114              DW$574  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7115                      .dwattr DW$574, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    7116                      .dwattr DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7117                      .dwattr DW$574, DW_AT_accessibility(DW_ACCESS_public)
    7118              DW$575  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7119                      .dwattr DW$575, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    7120                      .dwattr DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    7121                      .dwattr DW$575, DW_AT_accessibility(DW_ACCESS_public)
    7122              DW$576  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7123                      .dwattr DW$576, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    7124                      .dwattr DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7125                      .dwattr DW$576, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:20 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mancal.asm                                                           PAGE  150

    7126              DW$577  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7127                      .dwattr DW$577, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    7128                      .dwattr DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7129                      .dwattr DW$577, DW_AT_accessibility(DW_ACCESS_public)
    7130              DW$578  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7131                      .dwattr DW$578, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    7132                      .dwattr DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7133                      .dwattr DW$578, DW_AT_accessibility(DW_ACCESS_public)
    7134              DW$579  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7135                      .dwattr DW$579, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    7136                      .dwattr DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    7137                      .dwattr DW$579, DW_AT_accessibility(DW_ACCESS_public)
    7138              DW$580  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7139                      .dwattr DW$580, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    7140                      .dwattr DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7141                      .dwattr DW$580, DW_AT_accessibility(DW_ACCESS_public)
    7142              DW$581  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7143                      .dwattr DW$581, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    7144                      .dwattr DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    7145                      .dwattr DW$581, DW_AT_accessibility(DW_ACCESS_public)
    7146              DW$582  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7147                      .dwattr DW$582, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    7148                      .dwattr DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7149                      .dwattr DW$582, DW_AT_accessibility(DW_ACCESS_public)
    7150              DW$583  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    7151                      .dwattr DW$583, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    7152                      .dwattr DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7153                      .dwattr DW$583, DW_AT_accessibility(DW_ACCESS_public)
    7154              DW$584  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7155                      .dwattr DW$584, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    7156                      .dwattr DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    7157                      .dwattr DW$584, DW_AT_accessibility(DW_ACCESS_public)
    7158              DW$585  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7159                      .dwattr DW$585, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    7160                      .dwattr DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    7161                      .dwattr DW$585, DW_AT_accessibility(DW_ACCESS_public)
