TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:21 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("mmc_mcf.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"

    3544              DW$196  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    3545              DW$197  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    3546                      .dwendtag DW$T$118
    3547              
    3548              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    3549                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3550                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    3551              DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
    3552                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    3553              DW$T$115        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
    3554                      .dwattr DW$T$115, DW_AT_address_class(0x16)
    3555              
    3556              DW$T$122        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
    3557                      .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
    3558              DW$198  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    3559              DW$199  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    3560                      .dwendtag DW$T$122
    3561              
    3562              
    3563              DW$T$124        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
    3564                      .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
    3565              
    3566              DW$T$126        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
    3567                      .dwattr DW$T$126, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   73

    3568                      .dwattr DW$T$126, DW_AT_byte_size(0x200)
    3569              DW$200  .dwtag  DW_TAG_subrange_type
    3570                      .dwattr DW$200, DW_AT_upper_bound(0xff)
    3571                      .dwendtag DW$T$126
    3572              
    3573              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    3574                      .dwattr DW$T$29, DW_AT_address_class(0x16)
    3575              DW$T$104        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
    3576                      .dwattr DW$T$104, DW_AT_address_class(0x16)
    3577              DW$201  .dwtag  DW_TAG_far_type
    3578                      .dwattr DW$201, DW_AT_type(*DW$T$134)
    3579              DW$T$135        .dwtag  DW_TAG_volatile_type
    3580                      .dwattr DW$T$135, DW_AT_type(*DW$201)
    3581              DW$202  .dwtag  DW_TAG_far_type
    3582                      .dwattr DW$202, DW_AT_type(*DW$T$138)
    3583              DW$T$139        .dwtag  DW_TAG_volatile_type
    3584                      .dwattr DW$T$139, DW_AT_type(*DW$202)
    3585              DW$T$142        .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$47)
    3586                      .dwattr DW$T$142, DW_AT_language(DW_LANG_C)
    3587              DW$203  .dwtag  DW_TAG_far_type
    3588                      .dwattr DW$203, DW_AT_type(*DW$T$143)
    3589              DW$T$144        .dwtag  DW_TAG_volatile_type
    3590                      .dwattr DW$T$144, DW_AT_type(*DW$203)
    3591              DW$T$146        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$56)
    3592                      .dwattr DW$T$146, DW_AT_language(DW_LANG_C)
    3593              DW$204  .dwtag  DW_TAG_far_type
    3594                      .dwattr DW$204, DW_AT_type(*DW$T$72)
    3595              DW$T$147        .dwtag  DW_TAG_volatile_type
    3596                      .dwattr DW$T$147, DW_AT_type(*DW$204)
    3597              DW$T$149        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadC"), DW_AT_type(*DW$T$75)
    3598                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
    3599              
    3600              DW$T$151        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$150)
    3601                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    3602                      .dwattr DW$T$151, DW_AT_byte_size(0x10)
    3603              DW$205  .dwtag  DW_TAG_subrange_type
    3604                      .dwattr DW$205, DW_AT_upper_bound(0x00)
    3605                      .dwendtag DW$T$151
    3606              
    3607              DW$T$155        .dwtag  DW_TAG_typedef, DW_AT_name("MMC_TYPE"), DW_AT_type(*DW$T$79)
    3608                      .dwattr DW$T$155, DW_AT_language(DW_LANG_C)
    3609              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("F_PHY"), DW_AT_type(*DW$T$19)
    3610                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    3611              DW$T$103        .dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$39)
    3612                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    3613              DW$T$134        .dwtag  DW_TAG_typedef, DW_AT_name("gpbport"), DW_AT_type(*DW$T$42)
    3614                      .dwattr DW$T$134, DW_AT_language(DW_LANG_C)
    3615              DW$T$138        .dwtag  DW_TAG_typedef, DW_AT_name("gpfport"), DW_AT_type(*DW$T$45)
    3616                      .dwattr DW$T$138, DW_AT_language(DW_LANG_C)
    3617              
    3618              DW$T$47 .dwtag  DW_TAG_structure_type
    3619                      .dwattr DW$T$47, DW_AT_name("tag_settingsstruct")
    3620                      .dwattr DW$T$47, DW_AT_byte_size(0x24)
    3621              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3622                      .dwattr DW$206, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   74

    3623                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3624                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3625              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3626                      .dwattr DW$207, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    3627                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3628                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3629              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3630                      .dwattr DW$208, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    3631                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3632                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3633              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3634                      .dwattr DW$209, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    3635                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3636                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3637              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3638                      .dwattr DW$210, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    3639                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3640                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3641              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3642                      .dwattr DW$211, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    3643                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3644                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3645              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3646                      .dwattr DW$212, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    3647                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3648                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3649              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3650                      .dwattr DW$213, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    3651                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3652                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3653              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3654                      .dwattr DW$214, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    3655                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3656                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3657              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3658                      .dwattr DW$215, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    3659                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3660                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3661              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3662                      .dwattr DW$216, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    3663                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3664                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3665              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3666                      .dwattr DW$217, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    3667                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3668                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3669              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3670                      .dwattr DW$218, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    3671                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3672                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3673              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3674                      .dwattr DW$219, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    3675                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3676                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3677              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   75

    3678                      .dwattr DW$220, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    3679                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3680                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3681              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3682                      .dwattr DW$221, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    3683                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3684                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3685              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3686                      .dwattr DW$222, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    3687                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3688                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3689              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3690                      .dwattr DW$223, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    3691                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3692                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3693              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3694                      .dwattr DW$224, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    3695                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3696                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3697              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3698                      .dwattr DW$225, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    3699                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3700                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3701              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3702                      .dwattr DW$226, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    3703                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3704                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3705              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3706                      .dwattr DW$227, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    3707                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3708                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3709              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3710                      .dwattr DW$228, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    3711                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3712                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3713              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3714                      .dwattr DW$229, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    3715                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3716                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3717              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3718                      .dwattr DW$230, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    3719                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3720                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3721              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3722                      .dwattr DW$231, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    3723                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3724                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3725              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3726                      .dwattr DW$232, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    3727                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3728                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3729              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3730                      .dwattr DW$233, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    3731                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3732                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   76

    3733              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3734                      .dwattr DW$234, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    3735                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3736                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3737              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3738                      .dwattr DW$235, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    3739                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3740                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3741              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3742                      .dwattr DW$236, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    3743                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3744                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3745              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    3746                      .dwattr DW$237, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    3747                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3748                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3749              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3750                      .dwattr DW$238, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    3751                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3752                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3753              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3754                      .dwattr DW$239, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    3755                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3756                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3757              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3758                      .dwattr DW$240, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    3759                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3760                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3761                      .dwendtag DW$T$47
    3762              
    3763              DW$T$143        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$49)
    3764                      .dwattr DW$T$143, DW_AT_language(DW_LANG_C)
    3765              
    3766              DW$T$56 .dwtag  DW_TAG_structure_type
    3767                      .dwattr DW$T$56, DW_AT_name("tag_configstruct")
    3768                      .dwattr DW$T$56, DW_AT_byte_size(0x18)
    3769              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    3770                      .dwattr DW$241, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    3771                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3772                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3773              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3774                      .dwattr DW$242, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    3775                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3776                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3777              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    3778                      .dwattr DW$243, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    3779                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3780                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3781              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    3782                      .dwattr DW$244, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    3783                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3784                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3785              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3786                      .dwattr DW$245, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    3787                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   77

    3788                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3789              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    3790                      .dwattr DW$246, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    3791                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3792                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3793                      .dwendtag DW$T$56
    3794              
    3795              
    3796              DW$T$72 .dwtag  DW_TAG_structure_type
    3797                      .dwattr DW$T$72, DW_AT_name("SPI_REGS")
    3798                      .dwattr DW$T$72, DW_AT_byte_size(0x10)
    3799              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3800                      .dwattr DW$247, DW_AT_name("SPICCR"), DW_AT_symbol_name("_SPICCR")
    3801                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3802                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3803              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3804                      .dwattr DW$248, DW_AT_name("SPICTL"), DW_AT_symbol_name("_SPICTL")
    3805                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3806                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3807              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3808                      .dwattr DW$249, DW_AT_name("SPISTS"), DW_AT_symbol_name("_SPISTS")
    3809                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3810                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3811              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3812                      .dwattr DW$250, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3813                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3814                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3815              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3816                      .dwattr DW$251, DW_AT_name("SPIBRR"), DW_AT_symbol_name("_SPIBRR")
    3817                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3818                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3819              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3820                      .dwattr DW$252, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3821                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3822                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3823              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3824                      .dwattr DW$253, DW_AT_name("SPIRXEMU"), DW_AT_symbol_name("_SPIRXEMU")
    3825                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3826                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3827              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3828                      .dwattr DW$254, DW_AT_name("SPIRXBUF"), DW_AT_symbol_name("_SPIRXBUF")
    3829                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3830                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3831              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3832                      .dwattr DW$255, DW_AT_name("SPITXBUF"), DW_AT_symbol_name("_SPITXBUF")
    3833                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3834                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3835              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3836                      .dwattr DW$256, DW_AT_name("SPIDAT"), DW_AT_symbol_name("_SPIDAT")
    3837                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3838                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3839              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3840                      .dwattr DW$257, DW_AT_name("SPIFFTX"), DW_AT_symbol_name("_SPIFFTX")
    3841                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3842                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   78

    3843              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3844                      .dwattr DW$258, DW_AT_name("SPIFFRX"), DW_AT_symbol_name("_SPIFFRX")
    3845                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3846                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3847              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3848                      .dwattr DW$259, DW_AT_name("SPIFFCT"), DW_AT_symbol_name("_SPIFFCT")
    3849                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3850                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3851              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    3852                      .dwattr DW$260, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3853                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3854                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3855              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3856                      .dwattr DW$261, DW_AT_name("SPIPRI"), DW_AT_symbol_name("_SPIPRI")
    3857                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3858                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3859                      .dwendtag DW$T$72
    3860              
    3861              
    3862              DW$T$75 .dwtag  DW_TAG_structure_type
    3863                      .dwattr DW$T$75, DW_AT_name("tag_uartreadC")
    3864                      .dwattr DW$T$75, DW_AT_byte_size(0x68)
    3865              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3866                      .dwattr DW$262, DW_AT_name("receiveINTR"), DW_AT_symbol_name("_receiveINTR")
    3867                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3868                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3869              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3870                      .dwattr DW$263, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
    3871                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3872                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3873              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3874                      .dwattr DW$264, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    3875                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3876                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3877              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    3878                      .dwattr DW$265, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    3879                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3880                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3881              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3882                      .dwattr DW$266, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    3883                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x67]
    3884                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3885                      .dwendtag DW$T$75
    3886              
    3887              DW$T$150        .dwtag  DW_TAG_typedef, DW_AT_name("t_MmcDrv"), DW_AT_type(*DW$T$78)
    3888                      .dwattr DW$T$150, DW_AT_language(DW_LANG_C)
    3889              
    3890              DW$T$79 .dwtag  DW_TAG_structure_type
    3891                      .dwattr DW$T$79, DW_AT_byte_size(0x42)
    3892              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3893                      .dwattr DW$267, DW_AT_name("CSD_STR"), DW_AT_symbol_name("_CSD_STR")
    3894                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3895                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3896              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3897                      .dwattr DW$268, DW_AT_name("SPEC_VERS"), DW_AT_symbol_name("_SPEC_VERS")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   79

    3898                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3899                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3900              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3901                      .dwattr DW$269, DW_AT_name("TAAC"), DW_AT_symbol_name("_TAAC")
    3902                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3903                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3904              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3905                      .dwattr DW$270, DW_AT_name("NSAC"), DW_AT_symbol_name("_NSAC")
    3906                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3907                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3908              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3909                      .dwattr DW$271, DW_AT_name("TRANSPEED"), DW_AT_symbol_name("_TRANSPEED")
    3910                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3911                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3912              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3913                      .dwattr DW$272, DW_AT_name("CCC"), DW_AT_symbol_name("_CCC")
    3914                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3915                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3916              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3917                      .dwattr DW$273, DW_AT_name("R_BL_LEN"), DW_AT_symbol_name("_R_BL_LEN")
    3918                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3919                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3920              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3921                      .dwattr DW$274, DW_AT_name("R_BL_PART"), DW_AT_symbol_name("_R_BL_PART")
    3922                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3923                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3924              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3925                      .dwattr DW$275, DW_AT_name("WR_BL_MIS"), DW_AT_symbol_name("_WR_BL_MIS")
    3926                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3927                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3928              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3929                      .dwattr DW$276, DW_AT_name("RD_BL_MIS"), DW_AT_symbol_name("_RD_BL_MIS")
    3930                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3931                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3932              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3933                      .dwattr DW$277, DW_AT_name("DSR_IMP"), DW_AT_symbol_name("_DSR_IMP")
    3934                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3935                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3936              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3937                      .dwattr DW$278, DW_AT_name("CSIZE"), DW_AT_symbol_name("_CSIZE")
    3938                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3939                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3940              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3941                      .dwattr DW$279, DW_AT_name("RC_MIN"), DW_AT_symbol_name("_RC_MIN")
    3942                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3943                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3944              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3945                      .dwattr DW$280, DW_AT_name("RC_MAX"), DW_AT_symbol_name("_RC_MAX")
    3946                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3947                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3948              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3949                      .dwattr DW$281, DW_AT_name("WC_MAX"), DW_AT_symbol_name("_WC_MAX")
    3950                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3951                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3952              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   80

    3953                      .dwattr DW$282, DW_AT_name("WC_MIN"), DW_AT_symbol_name("_WC_MIN")
    3954                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3955                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3956              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3957                      .dwattr DW$283, DW_AT_name("C_SIZE_M"), DW_AT_symbol_name("_C_SIZE_M")
    3958                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3959                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3960              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3961                      .dwattr DW$284, DW_AT_name("ERASE_G_S"), DW_AT_symbol_name("_ERASE_G_S")
    3962                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3963                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3964              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3965                      .dwattr DW$285, DW_AT_name("ERASE_G_M"), DW_AT_symbol_name("_ERASE_G_M")
    3966                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3967                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3968              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3969                      .dwattr DW$286, DW_AT_name("WP_G_S"), DW_AT_symbol_name("_WP_G_S")
    3970                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3971                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3972              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3973                      .dwattr DW$287, DW_AT_name("WP_G_EN"), DW_AT_symbol_name("_WP_G_EN")
    3974                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3975                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3976              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3977                      .dwattr DW$288, DW_AT_name("DEF_ECC"), DW_AT_symbol_name("_DEF_ECC")
    3978                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3979                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3980              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3981                      .dwattr DW$289, DW_AT_name("R2W_FACT"), DW_AT_symbol_name("_R2W_FACT")
    3982                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3983                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3984              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3985                      .dwattr DW$290, DW_AT_name("WR_BL_LEN"), DW_AT_symbol_name("_WR_BL_LEN")
    3986                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3987                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3988              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3989                      .dwattr DW$291, DW_AT_name("WR_BL_PAR"), DW_AT_symbol_name("_WR_BL_PAR")
    3990                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3991                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3992              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3993                      .dwattr DW$292, DW_AT_name("C_PR_APP"), DW_AT_symbol_name("_C_PR_APP")
    3994                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3995                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3996              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    3997                      .dwattr DW$293, DW_AT_name("F_FORMATG"), DW_AT_symbol_name("_F_FORMATG")
    3998                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3999                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4000              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    4001                      .dwattr DW$294, DW_AT_name("COPY"), DW_AT_symbol_name("_COPY")
    4002                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4003                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4004              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    4005                      .dwattr DW$295, DW_AT_name("P_WR_PROT"), DW_AT_symbol_name("_P_WR_PROT")
    4006                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4007                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   81

    4008              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    4009                      .dwattr DW$296, DW_AT_name("T_WR_PROT"), DW_AT_symbol_name("_T_WR_PROT")
    4010                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4011                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4012              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    4013                      .dwattr DW$297, DW_AT_name("F_FORMAT"), DW_AT_symbol_name("_F_FORMAT")
    4014                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4015                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4016              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    4017                      .dwattr DW$298, DW_AT_name("ECC"), DW_AT_symbol_name("_ECC")
    4018                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4019                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4020              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
    4021                      .dwattr DW$299, DW_AT_name("CRC7"), DW_AT_symbol_name("_CRC7")
    4022                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4023                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4024                      .dwendtag DW$T$79
    4025              
    4026              
    4027              DW$T$71 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    4028                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
    4029                      .dwattr DW$T$71, DW_AT_byte_size(0x02)
    4030              DW$300  .dwtag  DW_TAG_subrange_type
    4031                      .dwattr DW$300, DW_AT_upper_bound(0x01)
    4032                      .dwendtag DW$T$71
    4033              
    4034              
    4035              DW$T$73 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    4036                      .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    4037                      .dwattr DW$T$73, DW_AT_byte_size(0x64)
    4038              DW$301  .dwtag  DW_TAG_subrange_type
    4039                      .dwattr DW$301, DW_AT_upper_bound(0x63)
    4040                      .dwendtag DW$T$73
    4041              
    4042              
    4043              DW$T$19 .dwtag  DW_TAG_structure_type
    4044                      .dwattr DW$T$19, DW_AT_byte_size(0x08)
    4045              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    4046                      .dwattr DW$302, DW_AT_name("number_of_cylinders"), DW_AT_symbol_name("_number_of_cylinders")
    4047                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4048                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4049              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    4050                      .dwattr DW$303, DW_AT_name("sector_per_track"), DW_AT_symbol_name("_sector_per_track")
    4051                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4052                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4053              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    4054                      .dwattr DW$304, DW_AT_name("number_of_heads"), DW_AT_symbol_name("_number_of_heads")
    4055                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4056                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4057              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4058                      .dwattr DW$305, DW_AT_name("number_of_sectors"), DW_AT_symbol_name("_number_of_sectors")
    4059                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4060                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4061              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4062                      .dwattr DW$306, DW_AT_name("media_descriptor"), DW_AT_symbol_name("_media_descriptor")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   82

    4063                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4064                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4065                      .dwendtag DW$T$19
    4066              
    4067              
    4068              DW$T$39 .dwtag  DW_TAG_structure_type
    4069                      .dwattr DW$T$39, DW_AT_byte_size(0x10)
    4070              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    4071                      .dwattr DW$307, DW_AT_name("writesector"), DW_AT_symbol_name("_writesector")
    4072                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4073                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4074              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4075                      .dwattr DW$308, DW_AT_name("writemultiplesector"), DW_AT_symbol_name("_writemultiplesector")
    4076                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4077                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4078              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    4079                      .dwattr DW$309, DW_AT_name("readsector"), DW_AT_symbol_name("_readsector")
    4080                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4081                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4082              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4083                      .dwattr DW$310, DW_AT_name("readmultiplesector"), DW_AT_symbol_name("_readmultiplesector")
    4084                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4085                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4086              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    4087                      .dwattr DW$311, DW_AT_name("getphy"), DW_AT_symbol_name("_getphy")
    4088                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4089                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4090              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    4091                      .dwattr DW$312, DW_AT_name("getstatus"), DW_AT_symbol_name("_getstatus")
    4092                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4093                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4094              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4095                      .dwattr DW$313, DW_AT_name("delfunc"), DW_AT_symbol_name("_delfunc")
    4096                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4097                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4098              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    4099                      .dwattr DW$314, DW_AT_name("user_ptr"), DW_AT_symbol_name("_user_ptr")
    4100                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4101                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4102                      .dwendtag DW$T$39
    4103              
    4104              
    4105              DW$T$42 .dwtag  DW_TAG_structure_type
    4106                      .dwattr DW$T$42, DW_AT_name("taggpbport")
    4107                      .dwattr DW$T$42, DW_AT_byte_size(0x01)
    4108              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    4109                      .dwattr DW$315, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    4110                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4111                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4112                      .dwendtag DW$T$42
    4113              
    4114              
    4115              DW$T$45 .dwtag  DW_TAG_structure_type
    4116                      .dwattr DW$T$45, DW_AT_name("taggpfport")
    4117                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   83

    4118              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    4119                      .dwattr DW$316, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    4120                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4121                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4122                      .dwendtag DW$T$45
    4123              
    4124              
    4125              DW$T$46 .dwtag  DW_TAG_structure_type
    4126                      .dwattr DW$T$46, DW_AT_byte_size(0x02)
    4127              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4128                      .dwattr DW$317, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    4129                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4130                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4131              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4132                      .dwattr DW$318, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    4133                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4134                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4135                      .dwendtag DW$T$46
    4136              
    4137              
    4138              DW$T$49 .dwtag  DW_TAG_structure_type
    4139                      .dwattr DW$T$49, DW_AT_name("tag_timers")
    4140                      .dwattr DW$T$49, DW_AT_byte_size(0x4c)
    4141              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4142                      .dwattr DW$319, DW_AT_name("update"), DW_AT_symbol_name("_update")
    4143                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4144                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4145              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4146                      .dwattr DW$320, DW_AT_name("general"), DW_AT_symbol_name("_general")
    4147                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4148                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4149              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4150                      .dwattr DW$321, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    4151                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4152                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4153              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4154                      .dwattr DW$322, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    4155                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4156                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4157              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4158                      .dwattr DW$323, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    4159                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4160                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4161              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4162                      .dwattr DW$324, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    4163                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4164                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4165              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4166                      .dwattr DW$325, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    4167                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4168                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4169              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4170                      .dwattr DW$326, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    4171                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4172                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   84

    4173              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4174                      .dwattr DW$327, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    4175                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4176                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4177              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4178                      .dwattr DW$328, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    4179                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4180                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4181              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    4182                      .dwattr DW$329, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    4183                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4184                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4185              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    4186                      .dwattr DW$330, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    4187                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4188                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4189              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4190                      .dwattr DW$331, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    4191                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4192                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4193              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4194                      .dwattr DW$332, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    4195                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4196                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4197              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4198                      .dwattr DW$333, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    4199                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4200                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4201              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4202                      .dwattr DW$334, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    4203                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4204                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4205              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4206                      .dwattr DW$335, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    4207                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4208                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4209              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4210                      .dwattr DW$336, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    4211                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4212                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4213              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4214                      .dwattr DW$337, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    4215                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4216                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4217              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4218                      .dwattr DW$338, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    4219                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4220                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4221              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4222                      .dwattr DW$339, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    4223                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4224                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4225              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4226                      .dwattr DW$340, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    4227                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   85

    4228                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4229              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4230                      .dwattr DW$341, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    4231                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4232                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4233              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4234                      .dwattr DW$342, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    4235                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4236                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4237              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4238                      .dwattr DW$343, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    4239                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4240                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4241              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4242                      .dwattr DW$344, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    4243                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4244                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4245              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4246                      .dwattr DW$345, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    4247                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4248                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4249              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4250                      .dwattr DW$346, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    4251                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4252                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4253              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4254                      .dwattr DW$347, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    4255                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4256                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4257              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4258                      .dwattr DW$348, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    4259                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4260                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4261              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4262                      .dwattr DW$349, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    4263                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4264                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4265              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4266                      .dwattr DW$350, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    4267                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4268                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4269              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4270                      .dwattr DW$351, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    4271                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    4272                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4273              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4274                      .dwattr DW$352, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    4275                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4276                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4277              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4278                      .dwattr DW$353, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    4279                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4280                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4281              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4282                      .dwattr DW$354, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   86

    4283                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4284                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4285              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4286                      .dwattr DW$355, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    4287                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4288                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4289              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4290                      .dwattr DW$356, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    4291                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4292                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4293              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4294                      .dwattr DW$357, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    4295                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4296                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4297              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4298                      .dwattr DW$358, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    4299                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4300                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4301              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4302                      .dwattr DW$359, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    4303                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4304                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4305              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4306                      .dwattr DW$360, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    4307                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4308                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4309              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4310                      .dwattr DW$361, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    4311                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4312                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4313                      .dwendtag DW$T$49
    4314              
    4315              
    4316              DW$T$50 .dwtag  DW_TAG_structure_type
    4317                      .dwattr DW$T$50, DW_AT_byte_size(0x01)
    4318              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4319                      .dwattr DW$362, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    4320                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4321                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4322                      .dwendtag DW$T$50
    4323              
    4324              
    4325              DW$T$51 .dwtag  DW_TAG_structure_type
    4326                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    4327              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4328                      .dwattr DW$363, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    4329                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4330                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4331                      .dwendtag DW$T$51
    4332              
    4333              
    4334              DW$T$52 .dwtag  DW_TAG_structure_type
    4335                      .dwattr DW$T$52, DW_AT_byte_size(0x01)
    4336              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4337                      .dwattr DW$364, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   87

    4338                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4339                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4340                      .dwendtag DW$T$52
    4341              
    4342              
    4343              DW$T$53 .dwtag  DW_TAG_structure_type
    4344                      .dwattr DW$T$53, DW_AT_byte_size(0x03)
    4345              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4346                      .dwattr DW$365, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    4347                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4348                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4349              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4350                      .dwattr DW$366, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    4351                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4352                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4353              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4354                      .dwattr DW$367, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    4355                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4356                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4357                      .dwendtag DW$T$53
    4358              
    4359              
    4360              DW$T$54 .dwtag  DW_TAG_structure_type
    4361                      .dwattr DW$T$54, DW_AT_byte_size(0x02)
    4362              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4363                      .dwattr DW$368, DW_AT_name("shortlrate"), DW_AT_symbol_name("_shortlrate")
    4364                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4365                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4366              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4367                      .dwattr DW$369, DW_AT_name("longlrate"), DW_AT_symbol_name("_longlrate")
    4368                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4369                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4370                      .dwendtag DW$T$54
    4371              
    4372              
    4373              DW$T$55 .dwtag  DW_TAG_structure_type
    4374                      .dwattr DW$T$55, DW_AT_byte_size(0x10)
    4375              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4376                      .dwattr DW$370, DW_AT_name("wiorequest"), DW_AT_symbol_name("_wiorequest")
    4377                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4378                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4379              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4380                      .dwattr DW$371, DW_AT_name("wiocancelled"), DW_AT_symbol_name("_wiocancelled")
    4381                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4382                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4383              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4384                      .dwattr DW$372, DW_AT_name("wioreceived"), DW_AT_symbol_name("_wioreceived")
    4385                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4386                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4387              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4388                      .dwattr DW$373, DW_AT_name("slaverequest"), DW_AT_symbol_name("_slaverequest")
    4389                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4390                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4391              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4392                      .dwattr DW$374, DW_AT_name("slavereceived"), DW_AT_symbol_name("_slavereceived")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   88

    4393                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4394                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4395              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4396                      .dwattr DW$375, DW_AT_name("slaveretry"), DW_AT_symbol_name("_slaveretry")
    4397                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4398                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4399              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4400                      .dwattr DW$376, DW_AT_name("pcrequest"), DW_AT_symbol_name("_pcrequest")
    4401                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4402                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4403              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4404                      .dwattr DW$377, DW_AT_name("pcreqtimeout"), DW_AT_symbol_name("_pcreqtimeout")
    4405                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4406                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4407                      .dwendtag DW$T$55
    4408              
    4409              
    4410              DW$T$58 .dwtag  DW_TAG_union_type
    4411                      .dwattr DW$T$58, DW_AT_name("SPICCR_REG")
    4412                      .dwattr DW$T$58, DW_AT_byte_size(0x01)
    4413              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4414                      .dwattr DW$378, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4415                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4416                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4417              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    4418                      .dwattr DW$379, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4419                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4420                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4421                      .dwendtag DW$T$58
    4422              
    4423              
    4424              DW$T$60 .dwtag  DW_TAG_union_type
    4425                      .dwattr DW$T$60, DW_AT_name("SPICTL_REG")
    4426                      .dwattr DW$T$60, DW_AT_byte_size(0x01)
    4427              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4428                      .dwattr DW$380, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4429                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4430                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4431              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    4432                      .dwattr DW$381, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4433                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4434                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4435                      .dwendtag DW$T$60
    4436              
    4437              
    4438              DW$T$62 .dwtag  DW_TAG_union_type
    4439                      .dwattr DW$T$62, DW_AT_name("SPISTS_REG")
    4440                      .dwattr DW$T$62, DW_AT_byte_size(0x01)
    4441              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4442                      .dwattr DW$382, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4443                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4444                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4445              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    4446                      .dwattr DW$383, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4447                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   89

    4448                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4449                      .dwendtag DW$T$62
    4450              
    4451              
    4452              DW$T$64 .dwtag  DW_TAG_union_type
    4453                      .dwattr DW$T$64, DW_AT_name("SPIFFTX_REG")
    4454                      .dwattr DW$T$64, DW_AT_byte_size(0x01)
    4455              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4456                      .dwattr DW$384, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4457                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4458                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4459              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    4460                      .dwattr DW$385, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4461                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4462                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4463                      .dwendtag DW$T$64
    4464              
    4465              
    4466              DW$T$66 .dwtag  DW_TAG_union_type
    4467                      .dwattr DW$T$66, DW_AT_name("SPIFFRX_REG")
    4468                      .dwattr DW$T$66, DW_AT_byte_size(0x01)
    4469              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4470                      .dwattr DW$386, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4471                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4472                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4473              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    4474                      .dwattr DW$387, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4475                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4476                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4477                      .dwendtag DW$T$66
    4478              
    4479              
    4480              DW$T$68 .dwtag  DW_TAG_union_type
    4481                      .dwattr DW$T$68, DW_AT_name("SPIFFCT_REG")
    4482                      .dwattr DW$T$68, DW_AT_byte_size(0x01)
    4483              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4484                      .dwattr DW$388, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4485                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4486                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4487              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    4488                      .dwattr DW$389, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4489                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4490                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4491                      .dwendtag DW$T$68
    4492              
    4493              
    4494              DW$T$70 .dwtag  DW_TAG_union_type
    4495                      .dwattr DW$T$70, DW_AT_name("SPIPRI_REG")
    4496                      .dwattr DW$T$70, DW_AT_byte_size(0x01)
    4497              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4498                      .dwattr DW$390, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4499                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4500                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4501              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    4502                      .dwattr DW$391, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   90

    4503                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4504                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4505                      .dwendtag DW$T$70
    4506              
    4507              DW$T$74 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    4508                      .dwattr DW$T$74, DW_AT_encoding(DW_ATE_signed_char)
    4509                      .dwattr DW$T$74, DW_AT_byte_size(0x01)
    4510              
    4511              DW$T$78 .dwtag  DW_TAG_structure_type
    4512                      .dwattr DW$T$78, DW_AT_byte_size(0x10)
    4513              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4514                      .dwattr DW$392, DW_AT_name("cs"), DW_AT_symbol_name("_cs")
    4515                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4516                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4517              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4518                      .dwattr DW$393, DW_AT_name("use"), DW_AT_symbol_name("_use")
    4519                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4520                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4521              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4522                      .dwattr DW$394, DW_AT_name("active"), DW_AT_symbol_name("_active")
    4523                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4524                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4525              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4526                      .dwattr DW$395, DW_AT_name("initok"), DW_AT_symbol_name("_initok")
    4527                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4528                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4529              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4530                      .dwattr DW$396, DW_AT_name("sd"), DW_AT_symbol_name("_sd")
    4531                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4532                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4533              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4534                      .dwattr DW$397, DW_AT_name("speed"), DW_AT_symbol_name("_speed")
    4535                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4536                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4537              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    4538                      .dwattr DW$398, DW_AT_name("cd_port"), DW_AT_symbol_name("_cd_port")
    4539                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4540                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4541              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4542                      .dwattr DW$399, DW_AT_name("cd_bit"), DW_AT_symbol_name("_cd_bit")
    4543                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4544                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4545              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    4546                      .dwattr DW$400, DW_AT_name("wp_port"), DW_AT_symbol_name("_wp_port")
    4547                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4548                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4549              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4550                      .dwattr DW$401, DW_AT_name("wp_bit"), DW_AT_symbol_name("_wp_bit")
    4551                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4552                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4553                      .dwendtag DW$T$78
    4554              
    4555              DW$T$77 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
    4556                      .dwattr DW$T$77, DW_AT_address_class(0x16)
    4557              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("F_WRITESECTOR"), DW_AT_type(*DW$T$21)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   91

    4558                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    4559              DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("F_READSECTOR"), DW_AT_type(*DW$T$21)
    4560                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    4561              DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("F_WRITEMULTIPLESECTOR"), DW_AT_type(*DW$T$24)
    4562                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    4563              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("F_READMULTIPLESECTOR"), DW_AT_type(*DW$T$24)
    4564                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    4565              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("F_GETPHY"), DW_AT_type(*DW$T$31)
    4566                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    4567              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("F_DELFUNC"), DW_AT_type(*DW$T$37)
    4568                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    4569              
    4570              DW$T$48 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    4571                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    4572                      .dwattr DW$T$48, DW_AT_byte_size(0x0e)
    4573              DW$402  .dwtag  DW_TAG_subrange_type
    4574                      .dwattr DW$402, DW_AT_upper_bound(0x0d)
    4575                      .dwendtag DW$T$48
    4576              
    4577              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("F_GETSTATUS"), DW_AT_type(*DW$T$34)
    4578                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    4579              
    4580              DW$T$41 .dwtag  DW_TAG_union_type
    4581                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    4582              DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4583                      .dwattr DW$403, DW_AT_name("port"), DW_AT_symbol_name("_port")
    4584                      .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4585                      .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4586              DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    4587                      .dwattr DW$404, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    4588                      .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4589                      .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4590                      .dwendtag DW$T$41
    4591              
    4592              
    4593              DW$T$44 .dwtag  DW_TAG_union_type
    4594                      .dwattr DW$T$44, DW_AT_byte_size(0x01)
    4595              DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4596                      .dwattr DW$405, DW_AT_name("port"), DW_AT_symbol_name("_port")
    4597                      .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4598                      .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4599              DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    4600                      .dwattr DW$406, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    4601                      .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4602                      .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4603                      .dwendtag DW$T$44
    4604              
    4605              
    4606              DW$T$57 .dwtag  DW_TAG_structure_type
    4607                      .dwattr DW$T$57, DW_AT_name("SPICCR_BITS")
    4608                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
    4609              DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4610                      .dwattr DW$407, DW_AT_name("SPICHAR"), DW_AT_symbol_name("_SPICHAR")
    4611                      .dwattr DW$407, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    4612                      .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   92

    4613                      .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4614              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4615                      .dwattr DW$408, DW_AT_name("SPILBK"), DW_AT_symbol_name("_SPILBK")
    4616                      .dwattr DW$408, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4617                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4618                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4619              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4620                      .dwattr DW$409, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    4621                      .dwattr DW$409, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4622                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4623                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4624              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4625                      .dwattr DW$410, DW_AT_name("CLKPOLARITY"), DW_AT_symbol_name("_CLKPOLARITY")
    4626                      .dwattr DW$410, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4627                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4628                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4629              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4630                      .dwattr DW$411, DW_AT_name("SPISWRESET"), DW_AT_symbol_name("_SPISWRESET")
    4631                      .dwattr DW$411, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4632                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4633                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4634              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4635                      .dwattr DW$412, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    4636                      .dwattr DW$412, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4637                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4638                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4639                      .dwendtag DW$T$57
    4640              
    4641              
    4642              DW$T$59 .dwtag  DW_TAG_structure_type
    4643                      .dwattr DW$T$59, DW_AT_name("SPICTL_BITS")
    4644                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    4645              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4646                      .dwattr DW$413, DW_AT_name("SPIINTENA"), DW_AT_symbol_name("_SPIINTENA")
    4647                      .dwattr DW$413, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4648                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4649                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4650              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4651                      .dwattr DW$414, DW_AT_name("TALK"), DW_AT_symbol_name("_TALK")
    4652                      .dwattr DW$414, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4653                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4654                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4655              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4656                      .dwattr DW$415, DW_AT_name("MASTER_SLAVE"), DW_AT_symbol_name("_MASTER_SLAVE")
    4657                      .dwattr DW$415, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4658                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4659                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4660              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4661                      .dwattr DW$416, DW_AT_name("CLK_PHASE"), DW_AT_symbol_name("_CLK_PHASE")
    4662                      .dwattr DW$416, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4663                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4664                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4665              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4666                      .dwattr DW$417, DW_AT_name("OVERRUNINTENA"), DW_AT_symbol_name("_OVERRUNINTENA")
    4667                      .dwattr DW$417, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
mmc_mcf.asm                                                          PAGE   93

    4668                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4669                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4670              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4671                      .dwattr DW$418, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
    4672                      .dwattr DW$418, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0b)
    4673                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4674                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4675                      .dwendtag DW$T$59
    4676              
    4677              
    4678              DW$T$61 .dwtag  DW_TAG_structure_type
    4679                      .dwattr DW$T$61, DW_AT_name("SPISTS_BITS")
    4680                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    4681              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4682                      .dwattr DW$419, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    4683                      .dwattr DW$419, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4684                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4685                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4686              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
