TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:22 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("params.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2730              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2731                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2732                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2733              DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
    2734                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    2735              DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("PCCmdStruct"), DW_AT_type(*DW$T$20)
    2736                      .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
    2737              DW$T$94 .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$22)
    2738                      .dwattr DW$T$94, DW_AT_language(DW_LANG_C)
    2739              DW$T$97 .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$26)
    2740                      .dwattr DW$T$97, DW_AT_language(DW_LANG_C)
    2741              DW$T$100        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$33)
    2742                      .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    2743              
    2744              DW$T$104        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$103)
    2745                      .dwattr DW$T$104, DW_AT_language(DW_LANG_C)
    2746                      .dwattr DW$T$104, DW_AT_byte_size(0x118)
    2747              DW$87   .dwtag  DW_TAG_subrange_type
    2748                      .dwattr DW$87, DW_AT_upper_bound(0x1b)
    2749                      .dwendtag DW$T$104
    2750              
    2751              
    2752              DW$T$108        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$107)
    2753                      .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
    2754                      .dwattr DW$T$108, DW_AT_byte_size(0x1c)
    2755              DW$88   .dwtag  DW_TAG_subrange_type
    2756                      .dwattr DW$88, DW_AT_upper_bound(0x0d)
    2757                      .dwendtag DW$T$108
    2758              
    2759              DW$T$111        .dwtag  DW_TAG_typedef, DW_AT_name("damagemonstruct"), DW_AT_type(*DW$T$36)
    2760                      .dwattr DW$T$111, DW_AT_language(DW_LANG_C)
    2761              DW$T$114        .dwtag  DW_TAG_typedef, DW_AT_name("damalarmsstruct"), DW_AT_type(*DW$T$38)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   57

    2762                      .dwattr DW$T$114, DW_AT_language(DW_LANG_C)
    2763              DW$T$116        .dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$40)
    2764                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
    2765              DW$T$119        .dwtag  DW_TAG_typedef, DW_AT_name("wiosettingsstruct"), DW_AT_type(*DW$T$41)
    2766                      .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
    2767              DW$T$122        .dwtag  DW_TAG_typedef, DW_AT_name("alarmsstruct"), DW_AT_type(*DW$T$42)
    2768                      .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
    2769              DW$T$124        .dwtag  DW_TAG_typedef, DW_AT_name("slavecmdstruct"), DW_AT_type(*DW$T$44)
    2770                      .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
    2771              DW$T$125        .dwtag  DW_TAG_typedef, DW_AT_name("slemsettingsstruct"), DW_AT_type(*DW$T$45)
    2772                      .dwattr DW$T$125, DW_AT_language(DW_LANG_C)
    2773              DW$T$128        .dwtag  DW_TAG_typedef, DW_AT_name("cppsettingsstruct"), DW_AT_type(*DW$T$46)
    2774                      .dwattr DW$T$128, DW_AT_language(DW_LANG_C)
    2775              DW$T$131        .dwtag  DW_TAG_typedef, DW_AT_name("sensorMovingstruct"), DW_AT_type(*DW$T$47)
    2776                      .dwattr DW$T$131, DW_AT_language(DW_LANG_C)
    2777              DW$T$133        .dwtag  DW_TAG_typedef, DW_AT_name("dcmodechecksstruct"), DW_AT_type(*DW$T$51)
    2778                      .dwattr DW$T$133, DW_AT_language(DW_LANG_C)
    2779              DW$T$66 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$53)
    2780                      .dwattr DW$T$66, DW_AT_address_class(0x16)
    2781              
    2782              DW$T$136        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$66)
    2783                      .dwattr DW$T$136, DW_AT_language(DW_LANG_C)
    2784              DW$89   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$66)
    2785              DW$90   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$68)
    2786                      .dwendtag DW$T$136
    2787              
    2788              DW$T$68 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$67)
    2789                      .dwattr DW$T$68, DW_AT_address_class(0x16)
    2790              
    2791              DW$T$140        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$139)
    2792                      .dwattr DW$T$140, DW_AT_language(DW_LANG_C)
    2793                      .dwattr DW$T$140, DW_AT_byte_size(0x744)
    2794              DW$91   .dwtag  DW_TAG_subrange_type
    2795                      .dwattr DW$91, DW_AT_upper_bound(0x5c)
    2796                      .dwendtag DW$T$140
    2797              
    2798              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    2799                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2800                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    2801              
    2802              DW$T$20 .dwtag  DW_TAG_structure_type
    2803                      .dwattr DW$T$20, DW_AT_name("tag_PCCmdStruct")
    2804                      .dwattr DW$T$20, DW_AT_byte_size(0x110)
    2805              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2806                      .dwattr DW$92, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
    2807                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2808                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2809              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2810                      .dwattr DW$93, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
    2811                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2812                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2813              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2814                      .dwattr DW$94, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
    2815                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2816                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   58

    2817              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2818                      .dwattr DW$95, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
    2819                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2820                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2821              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2822                      .dwattr DW$96, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
    2823                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2824                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2825              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2826                      .dwattr DW$97, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
    2827                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2828                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2829              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2830                      .dwattr DW$98, DW_AT_name("errorflag"), DW_AT_symbol_name("_errorflag")
    2831                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    2832                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2833                      .dwendtag DW$T$20
    2834              
    2835              
    2836              DW$T$22 .dwtag  DW_TAG_structure_type
    2837                      .dwattr DW$T$22, DW_AT_name("tag_settingsstruct")
    2838                      .dwattr DW$T$22, DW_AT_byte_size(0x24)
    2839              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2840                      .dwattr DW$99, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    2841                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2842                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2843              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2844                      .dwattr DW$100, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    2845                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2846                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2847              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2848                      .dwattr DW$101, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    2849                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2850                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2851              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2852                      .dwattr DW$102, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    2853                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2854                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2855              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2856                      .dwattr DW$103, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    2857                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2858                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2859              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2860                      .dwattr DW$104, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    2861                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2862                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2863              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2864                      .dwattr DW$105, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    2865                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2866                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2867              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2868                      .dwattr DW$106, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    2869                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2870                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2871              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   59

    2872                      .dwattr DW$107, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    2873                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2874                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2875              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2876                      .dwattr DW$108, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    2877                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2878                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2879              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2880                      .dwattr DW$109, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    2881                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2882                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2883              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2884                      .dwattr DW$110, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    2885                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2886                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2887              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2888                      .dwattr DW$111, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    2889                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2890                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2891              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2892                      .dwattr DW$112, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    2893                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2894                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2895              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2896                      .dwattr DW$113, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    2897                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2898                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2899              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2900                      .dwattr DW$114, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    2901                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2902                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2903              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2904                      .dwattr DW$115, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    2905                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2906                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2907              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2908                      .dwattr DW$116, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    2909                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2910                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2911              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2912                      .dwattr DW$117, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    2913                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2914                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2915              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2916                      .dwattr DW$118, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    2917                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2918                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2919              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2920                      .dwattr DW$119, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    2921                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2922                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2923              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2924                      .dwattr DW$120, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    2925                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2926                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   60

    2927              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2928                      .dwattr DW$121, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    2929                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2930                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2931              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2932                      .dwattr DW$122, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    2933                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2934                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2935              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2936                      .dwattr DW$123, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    2937                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2938                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2939              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2940                      .dwattr DW$124, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2941                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2942                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2943              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2944                      .dwattr DW$125, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    2945                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2946                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2947              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2948                      .dwattr DW$126, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2949                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2950                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2951              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2952                      .dwattr DW$127, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2953                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2954                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2955              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2956                      .dwattr DW$128, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    2957                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2958                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2959              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2960                      .dwattr DW$129, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    2961                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2962                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2963              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2964                      .dwattr DW$130, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    2965                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2966                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2967              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2968                      .dwattr DW$131, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    2969                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2970                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2971              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2972                      .dwattr DW$132, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    2973                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2974                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2975              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2976                      .dwattr DW$133, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2977                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2978                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2979                      .dwendtag DW$T$22
    2980              
    2981              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   61

    2982              DW$T$26 .dwtag  DW_TAG_structure_type
    2983                      .dwattr DW$T$26, DW_AT_name("tag_allsensorstruct")
    2984                      .dwattr DW$T$26, DW_AT_byte_size(0x2d)
    2985              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2986                      .dwattr DW$134, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    2987                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2988                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2989              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2990                      .dwattr DW$135, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    2991                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2992                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2993              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2994                      .dwattr DW$136, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    2995                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2996                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2997              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2998                      .dwattr DW$137, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    2999                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3000                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    3001              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3002                      .dwattr DW$138, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    3003                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3004                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    3005              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3006                      .dwattr DW$139, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    3007                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3008                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    3009              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3010                      .dwattr DW$140, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    3011                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3012                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    3013              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3014                      .dwattr DW$141, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    3015                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3016                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    3017              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3018                      .dwattr DW$142, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    3019                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3020                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    3021              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3022                      .dwattr DW$143, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    3023                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3024                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    3025              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3026                      .dwattr DW$144, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    3027                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3028                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    3029              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3030                      .dwattr DW$145, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    3031                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3032                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    3033              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3034                      .dwattr DW$146, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    3035                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3036                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   62

    3037              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3038                      .dwattr DW$147, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    3039                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3040                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3041              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3042                      .dwattr DW$148, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    3043                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3044                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3045              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3046                      .dwattr DW$149, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    3047                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3048                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3049              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3050                      .dwattr DW$150, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    3051                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3052                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3053              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3054                      .dwattr DW$151, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    3055                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3056                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3057              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3058                      .dwattr DW$152, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    3059                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3060                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3061              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3062                      .dwattr DW$153, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    3063                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3064                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3065              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3066                      .dwattr DW$154, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    3067                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3068                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3069              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    3070                      .dwattr DW$155, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    3071                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3072                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3073              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3074                      .dwattr DW$156, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    3075                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3076                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3077              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3078                      .dwattr DW$157, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    3079                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3080                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3081              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3082                      .dwattr DW$158, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    3083                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3084                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3085              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3086                      .dwattr DW$159, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    3087                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3088                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3089              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3090                      .dwattr DW$160, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    3091                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   63

    3092                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3093              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3094                      .dwattr DW$161, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    3095                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3096                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3097              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3098                      .dwattr DW$162, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    3099                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3100                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3101              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3102                      .dwattr DW$163, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    3103                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3104                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3105              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3106                      .dwattr DW$164, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    3107                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3108                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3109              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3110                      .dwattr DW$165, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    3111                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3112                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3113                      .dwendtag DW$T$26
    3114              
    3115              
    3116              DW$T$33 .dwtag  DW_TAG_structure_type
    3117                      .dwattr DW$T$33, DW_AT_name("tag_configstruct")
    3118                      .dwattr DW$T$33, DW_AT_byte_size(0x18)
    3119              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3120                      .dwattr DW$166, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    3121                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3123              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3124                      .dwattr DW$167, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    3125                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3126                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3127              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3128                      .dwattr DW$168, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    3129                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3130                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3131              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    3132                      .dwattr DW$169, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    3133                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3134                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3135              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3136                      .dwattr DW$170, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    3137                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3138                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3139              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    3140                      .dwattr DW$171, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    3141                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3142                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3143                      .dwendtag DW$T$33
    3144              
    3145              DW$T$103        .dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$34)
    3146                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   64

    3147              DW$T$107        .dwtag  DW_TAG_typedef, DW_AT_name("manrefsumstruct"), DW_AT_type(*DW$T$35)
    3148                      .dwattr DW$T$107, DW_AT_language(DW_LANG_C)
    3149              
    3150              DW$T$36 .dwtag  DW_TAG_structure_type
    3151                      .dwattr DW$T$36, DW_AT_name("tag_damagemonstruct")
    3152                      .dwattr DW$T$36, DW_AT_byte_size(0x10)
    3153              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3154                      .dwattr DW$172, DW_AT_name("ccsplit"), DW_AT_symbol_name("_ccsplit")
    3155                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3156                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3157              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3158                      .dwattr DW$173, DW_AT_name("kvalue"), DW_AT_symbol_name("_kvalue")
    3159                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3160                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3161              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3162                      .dwattr DW$174, DW_AT_name("betavalue"), DW_AT_symbol_name("_betavalue")
    3163                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3164                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3165              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3166                      .dwattr DW$175, DW_AT_name("rpmlevelx"), DW_AT_symbol_name("_rpmlevelx")
    3167                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3168                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3169              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3170                      .dwattr DW$176, DW_AT_name("reflevelx"), DW_AT_symbol_name("_reflevelx")
    3171                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3172                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3173              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3174                      .dwattr DW$177, DW_AT_name("presentstatex"), DW_AT_symbol_name("_presentstatex")
    3175                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3176                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3177              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3178                      .dwattr DW$178, DW_AT_name("alarmlevelsingle"), DW_AT_symbol_name("_alarmlevelsingle")
    3179                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3180                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3181              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3182                      .dwattr DW$179, DW_AT_name("alarmlevelcyl"), DW_AT_symbol_name("_alarmlevelcyl")
    3183                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3184                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3185              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3186                      .dwattr DW$180, DW_AT_name("alarmlevelmbsum"), DW_AT_symbol_name("_alarmlevelmbsum")
    3187                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3188                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3189              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3190                      .dwattr DW$181, DW_AT_name("cylneighbour"), DW_AT_symbol_name("_cylneighbour")
    3191                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3192                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3193              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3194                      .dwattr DW$182, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
    3195                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3196                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3197              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3198                      .dwattr DW$183, DW_AT_name("cylneighbouralarms"), DW_AT_symbol_name("_cylneighbouralarms")
    3199                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3200                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3201              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   65

    3202                      .dwattr DW$184, DW_AT_name("mbneighbouralarms"), DW_AT_symbol_name("_mbneighbouralarms")
    3203                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3204                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3205              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3206                      .dwattr DW$185, DW_AT_name("deltarpmlimit"), DW_AT_symbol_name("_deltarpmlimit")
    3207                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3208                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3209              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3210                      .dwattr DW$186, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
    3211                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3212                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3213              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3214                      .dwattr DW$187, DW_AT_name("damagemonenb"), DW_AT_symbol_name("_damagemonenb")
    3215                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3216                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3217                      .dwendtag DW$T$36
    3218              
    3219              
    3220              DW$T$38 .dwtag  DW_TAG_structure_type
    3221                      .dwattr DW$T$38, DW_AT_name("tag_damalarmsstruct")
    3222                      .dwattr DW$T$38, DW_AT_byte_size(0x04)
    3223              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3224                      .dwattr DW$188, DW_AT_name("single"), DW_AT_symbol_name("_single")
    3225                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3226                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3227              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3228                      .dwattr DW$189, DW_AT_name("cylinder"), DW_AT_symbol_name("_cylinder")
    3229                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3230                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3231              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3232                      .dwattr DW$190, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
    3233                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3234                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3235                      .dwendtag DW$T$38
    3236              
    3237              
    3238              DW$T$40 .dwtag  DW_TAG_structure_type
    3239                      .dwattr DW$T$40, DW_AT_name("tag_speedcompstruct")
    3240                      .dwattr DW$T$40, DW_AT_byte_size(0x19)
    3241              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3242                      .dwattr DW$191, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
    3243                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3244                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3245              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3246                      .dwattr DW$192, DW_AT_name("status"), DW_AT_symbol_name("_status")
    3247                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3248                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3249              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3250                      .dwattr DW$193, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
    3251                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3252                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3253              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3254                      .dwattr DW$194, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
    3255                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3256                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   66

    3257              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3258                      .dwattr DW$195, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
    3259                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3260                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3261              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3262                      .dwattr DW$196, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
    3263                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3264                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3265              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3266                      .dwattr DW$197, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
    3267                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3268                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3269              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3270                      .dwattr DW$198, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
    3271                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3272                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3273              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3274                      .dwattr DW$199, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
    3275                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3276                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3277              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3278                      .dwattr DW$200, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
    3279                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3280                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3281              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3282                      .dwattr DW$201, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
    3283                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3284                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3285              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3286                      .dwattr DW$202, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    3287                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3288                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3289              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3290                      .dwattr DW$203, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    3291                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3292                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3293              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3294                      .dwattr DW$204, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    3295                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3296                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3297              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3298                      .dwattr DW$205, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    3299                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3300                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3301              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3302                      .dwattr DW$206, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    3303                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3304                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3305              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3306                      .dwattr DW$207, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    3307                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3308                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3309              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3310                      .dwattr DW$208, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    3311                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   67

    3312                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3313              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3314                      .dwattr DW$209, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    3315                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3316                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3317              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3318                      .dwattr DW$210, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    3319                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3320                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3321                      .dwendtag DW$T$40
    3322              
    3323              
    3324              DW$T$41 .dwtag  DW_TAG_structure_type
    3325                      .dwattr DW$T$41, DW_AT_name("tag_wiosettingsstruct")
    3326                      .dwattr DW$T$41, DW_AT_byte_size(0x0a)
    3327              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3328                      .dwattr DW$211, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    3329                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3330                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3331              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3332                      .dwattr DW$212, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
    3333                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3334                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3335              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3336                      .dwattr DW$213, DW_AT_name("alarmupperlevel"), DW_AT_symbol_name("_alarmupperlevel")
    3337                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3338                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3339              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3340                      .dwattr DW$214, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    3341                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3342                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3343              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3344                      .dwattr DW$215, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
    3345                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3346                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3347              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3348                      .dwattr DW$216, DW_AT_name("scaledmin"), DW_AT_symbol_name("_scaledmin")
    3349                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3350                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3351              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3352                      .dwattr DW$217, DW_AT_name("scaledmax"), DW_AT_symbol_name("_scaledmax")
    3353                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3354                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3355              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3356                      .dwattr DW$218, DW_AT_name("units"), DW_AT_symbol_name("_units")
    3357                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3358                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3359              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3360                      .dwattr DW$219, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    3361                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3362                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3363              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3364                      .dwattr DW$220, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    3365                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3366                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   68

    3367                      .dwendtag DW$T$41
    3368              
    3369              
    3370              DW$T$42 .dwtag  DW_TAG_structure_type
    3371                      .dwattr DW$T$42, DW_AT_name("tag_alarmsstruct")
    3372                      .dwattr DW$T$42, DW_AT_byte_size(0x01)
    3373              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3374                      .dwattr DW$221, DW_AT_name("slavefailure"), DW_AT_symbol_name("_slavefailure")
    3375                      .dwattr DW$221, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3376                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3377                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3378              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3379                      .dwattr DW$222, DW_AT_name("slavefailurelatched"), DW_AT_symbol_name("_slavefailurelatched")
    3380                      .dwattr DW$222, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3381                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3382                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3383              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3384                      .dwattr DW$223, DW_AT_name("framfailure"), DW_AT_symbol_name("_framfailure")
    3385                      .dwattr DW$223, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3386                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3387                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3388              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3389                      .dwattr DW$224, DW_AT_name("framfailurelatched"), DW_AT_symbol_name("_framfailurelatched")
    3390                      .dwattr DW$224, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3391                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3392                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3393              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3394                      .dwattr DW$225, DW_AT_name("pccommsfailure"), DW_AT_symbol_name("_pccommsfailure")
    3395                      .dwattr DW$225, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3396                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3397                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3398              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3399                      .dwattr DW$226, DW_AT_name("pccommsfailurelatched"), DW_AT_symbol_name("_pccommsfailurelatched")
    3400                      .dwattr DW$226, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3401                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3403              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3404                      .dwattr DW$227, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    3405                      .dwattr DW$227, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3406                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3407                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3408              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3409                      .dwattr DW$228, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    3410                      .dwattr DW$228, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3411                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3412                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3413              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3414                      .dwattr DW$229, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    3415                      .dwattr DW$229, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3416                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3417                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3418              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3419                      .dwattr DW$230, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    3420                      .dwattr DW$230, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3421                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   69

    3422                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3423              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3424                      .dwattr DW$231, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    3425                      .dwattr DW$231, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3426                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3427                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3428              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3429                      .dwattr DW$232, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    3430                      .dwattr DW$232, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3431                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3432                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3433              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3434                      .dwattr DW$233, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    3435                      .dwattr DW$233, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3436                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3437                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3438              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3439                      .dwattr DW$234, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    3440                      .dwattr DW$234, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3441                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3442                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3443              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3444                      .dwattr DW$235, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    3445                      .dwattr DW$235, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3446                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3447                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3448              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3449                      .dwattr DW$236, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    3450                      .dwattr DW$236, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3451                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3452                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3453                      .dwendtag DW$T$42
    3454              
    3455              
    3456              DW$T$44 .dwtag  DW_TAG_structure_type
    3457                      .dwattr DW$T$44, DW_AT_name("tag_slavecmdstruct")
    3458                      .dwattr DW$T$44, DW_AT_byte_size(0x48)
    3459              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3460                      .dwattr DW$237, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
    3461                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3462                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3463              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3464                      .dwattr DW$238, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
    3465                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3466                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3467              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3468                      .dwattr DW$239, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
    3469                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3470                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3471              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3472                      .dwattr DW$240, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
    3473                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3474                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3475              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3476                      .dwattr DW$241, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   70

    3477                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3478                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3479              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    3480                      .dwattr DW$242, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
    3481                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3482                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3483              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3484                      .dwattr DW$243, DW_AT_name("txmode"), DW_AT_symbol_name("_txmode")
    3485                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3486                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3487              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3488                      .dwattr DW$244, DW_AT_name("slavelost"), DW_AT_symbol_name("_slavelost")
    3489                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3490                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3491              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3492                      .dwattr DW$245, DW_AT_name("slavenotready"), DW_AT_symbol_name("_slavenotready")
    3493                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    3494                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3495                      .dwendtag DW$T$44
    3496              
    3497              
    3498              DW$T$45 .dwtag  DW_TAG_structure_type
    3499                      .dwattr DW$T$45, DW_AT_name("tag_slemsettingsstruct")
    3500                      .dwattr DW$T$45, DW_AT_byte_size(0x06)
    3501              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3502                      .dwattr DW$246, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    3503                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3504                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3505              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3506                      .dwattr DW$247, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
    3507                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3508                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3509              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3510                      .dwattr DW$248, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    3511                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3512                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3513              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3514                      .dwattr DW$249, DW_AT_name("mVfsd"), DW_AT_symbol_name("_mVfsd")
    3515                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3516                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3517              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3518                      .dwattr DW$250, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
    3519                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3520                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3521              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3522                      .dwattr DW$251, DW_AT_name("alarmdelay"), DW_AT_symbol_name("_alarmdelay")
    3523                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3524                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3525                      .dwendtag DW$T$45
    3526              
    3527              
    3528              DW$T$46 .dwtag  DW_TAG_structure_type
    3529                      .dwattr DW$T$46, DW_AT_name("tag_cppsettingsstruct")
    3530                      .dwattr DW$T$46, DW_AT_byte_size(0x10)
    3531              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   71

    3532                      .dwattr DW$252, DW_AT_name("iCppEnable"), DW_AT_symbol_name("_iCppEnable")
    3533                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3534                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3535              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3536                      .dwattr DW$253, DW_AT_name("iCppLowLimit"), DW_AT_symbol_name("_iCppLowLimit")
    3537                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3538                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3539              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3540                      .dwattr DW$254, DW_AT_name("iCppHighLimit"), DW_AT_symbol_name("_iCppHighLimit")
    3541                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3542                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3543              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3544                      .dwattr DW$255, DW_AT_name("cppkvalue"), DW_AT_symbol_name("_cppkvalue")
    3545                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3546                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3547              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3548                      .dwattr DW$256, DW_AT_name("gammavalue"), DW_AT_symbol_name("_gammavalue")
    3549                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3550                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3551              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3552                      .dwattr DW$257, DW_AT_name("cpplevelx"), DW_AT_symbol_name("_cpplevelx")
    3553                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3554                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3555              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3556                      .dwattr DW$258, DW_AT_name("delatRpmPauseDelay"), DW_AT_symbol_name("_delatRpmPauseDelay")
    3557                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3558                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3559              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3560                      .dwattr DW$259, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
    3561                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3562                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3563              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3564                      .dwattr DW$260, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    3565                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3566                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3567              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3568                      .dwattr DW$261, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    3569                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3570                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3571              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3572                      .dwattr DW$262, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    3573                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3574                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3575              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3576                      .dwattr DW$263, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    3577                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3578                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3579              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3580                      .dwattr DW$264, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    3581                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3582                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3583              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3584                      .dwattr DW$265, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    3585                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3586                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   72

    3587              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3588                      .dwattr DW$266, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    3589                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3590                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3591              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3592                      .dwattr DW$267, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    3593                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3594                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3595                      .dwendtag DW$T$46
    3596              
    3597              
    3598              DW$T$47 .dwtag  DW_TAG_structure_type
    3599                      .dwattr DW$T$47, DW_AT_name("tag_sensorMoving")
    3600                      .dwattr DW$T$47, DW_AT_byte_size(0x02)
    3601              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3602                      .dwattr DW$268, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
    3603                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3604                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3605              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3606                      .dwattr DW$269, DW_AT_name("unusedByte"), DW_AT_symbol_name("_unusedByte")
    3607                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3608                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3609                      .dwendtag DW$T$47
    3610              
    3611              
    3612              DW$T$51 .dwtag  DW_TAG_structure_type
    3613                      .dwattr DW$T$51, DW_AT_name("tag_dcmodechecksstruct")
    3614                      .dwattr DW$T$51, DW_AT_byte_size(0x0f)
    3615              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3616                      .dwattr DW$270, DW_AT_name("ideal"), DW_AT_symbol_name("_ideal")
    3617                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3618                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3619              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3620                      .dwattr DW$271, DW_AT_name("ok"), DW_AT_symbol_name("_ok")
    3621                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3622                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3623              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    3624                      .dwattr DW$272, DW_AT_name("cylinderComparison"), DW_AT_symbol_name("_cylinderComparison")
    3625                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3626                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3627              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3628                      .dwattr DW$273, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    3629                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3630                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3631              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3632                      .dwattr DW$274, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    3633                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3634                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3635              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3636                      .dwattr DW$275, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    3637                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3638                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3639              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3640                      .dwattr DW$276, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    3641                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   73

    3642                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3643              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3644                      .dwattr DW$277, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    3645                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3646                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3647              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3648                      .dwattr DW$278, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    3649                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3650                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3651              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3652                      .dwattr DW$279, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    3653                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3654                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3655              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3656                      .dwattr DW$280, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    3657                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3658                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3659              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3660                      .dwattr DW$281, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    3661                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3662                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3663                      .dwendtag DW$T$51
    3664              
    3665              DW$T$53 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    3666                      .dwattr DW$T$53, DW_AT_encoding(DW_ATE_signed_char)
    3667                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
    3668              DW$282  .dwtag  DW_TAG_far_type
    3669                      .dwattr DW$282, DW_AT_type(*DW$T$53)
    3670              DW$T$67 .dwtag  DW_TAG_const_type
    3671                      .dwattr DW$T$67, DW_AT_type(*DW$282)
    3672              DW$283  .dwtag  DW_TAG_far_type
    3673                      .dwattr DW$283, DW_AT_type(*DW$T$138)
    3674              DW$T$139        .dwtag  DW_TAG_const_type
    3675                      .dwattr DW$T$139, DW_AT_type(*DW$283)
    3676              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    3677                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3678                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    3679              
    3680              DW$T$19 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3681                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    3682                      .dwattr DW$T$19, DW_AT_byte_size(0x10a)
    3683              DW$284  .dwtag  DW_TAG_subrange_type
    3684                      .dwattr DW$284, DW_AT_upper_bound(0x109)
    3685                      .dwendtag DW$T$19
    3686              
    3687              
    3688              DW$T$25 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3689                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    3690                      .dwattr DW$T$25, DW_AT_byte_size(0x0e)
    3691              DW$285  .dwtag  DW_TAG_subrange_type
    3692                      .dwattr DW$285, DW_AT_upper_bound(0x0d)
    3693                      .dwendtag DW$T$25
    3694              
    3695              
    3696              DW$T$37 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   74

    3697                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    3698                      .dwattr DW$T$37, DW_AT_byte_size(0x02)
    3699              DW$286  .dwtag  DW_TAG_subrange_type
    3700                      .dwattr DW$286, DW_AT_upper_bound(0x01)
    3701                      .dwendtag DW$T$37
    3702              
    3703              
    3704              DW$T$39 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3705                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    3706                      .dwattr DW$T$39, DW_AT_byte_size(0x06)
    3707              DW$287  .dwtag  DW_TAG_subrange_type
    3708                      .dwattr DW$287, DW_AT_upper_bound(0x02)
    3709              DW$288  .dwtag  DW_TAG_subrange_type
    3710                      .dwattr DW$288, DW_AT_upper_bound(0x01)
    3711                      .dwendtag DW$T$39
    3712              
    3713              
    3714              DW$T$43 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    3715                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    3716                      .dwattr DW$T$43, DW_AT_byte_size(0x40)
    3717              DW$289  .dwtag  DW_TAG_subrange_type
    3718                      .dwattr DW$289, DW_AT_upper_bound(0x3f)
    3719                      .dwendtag DW$T$43
    3720              
    3721              
    3722              DW$T$21 .dwtag  DW_TAG_structure_type
    3723                      .dwattr DW$T$21, DW_AT_byte_size(0x02)
    3724              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3725                      .dwattr DW$290, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    3726                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3727                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3728              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3729                      .dwattr DW$291, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    3730                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3731                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3732                      .dwendtag DW$T$21
    3733              
    3734              
    3735              DW$T$23 .dwtag  DW_TAG_structure_type
    3736                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    3737              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3738                      .dwattr DW$292, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
    3739                      .dwattr DW$292, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3740                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3741                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3742              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3743                      .dwattr DW$293, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    3744                      .dwattr DW$293, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3745                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3746                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3747              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3748                      .dwattr DW$294, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
    3749                      .dwattr DW$294, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3750                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3751                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   75

    3752              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3753                      .dwattr DW$295, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
    3754                      .dwattr DW$295, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3755                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3756                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3757              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3758                      .dwattr DW$296, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    3759                      .dwattr DW$296, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    3760                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3761                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3762                      .dwendtag DW$T$23
    3763              
    3764              
    3765              DW$T$24 .dwtag  DW_TAG_structure_type
    3766                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    3767              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3768                      .dwattr DW$297, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
    3769                      .dwattr DW$297, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3770                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3771                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3772              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3773                      .dwattr DW$298, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    3774                      .dwattr DW$298, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    3775                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3776                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3777                      .dwendtag DW$T$24
    3778              
    3779              
    3780              DW$T$27 .dwtag  DW_TAG_structure_type
    3781                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    3782              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3783                      .dwattr DW$299, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    3784                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3785                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3786                      .dwendtag DW$T$27
    3787              
    3788              
    3789              DW$T$28 .dwtag  DW_TAG_structure_type
    3790                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    3791              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3792                      .dwattr DW$300, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    3793                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3794                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3795                      .dwendtag DW$T$28
    3796              
    3797              
    3798              DW$T$29 .dwtag  DW_TAG_structure_type
    3799                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
    3800              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3801                      .dwattr DW$301, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    3802                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3803                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3804                      .dwendtag DW$T$29
    3805              
    3806              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:22 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
params.asm                                                           PAGE   76

    3807              DW$T$30 .dwtag  DW_TAG_structure_type
    3808                      .dwattr DW$T$30, DW_AT_byte_size(0x03)
    3809              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3810                      .dwattr DW$302, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    3811                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3812                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3813              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3814                      .dwattr DW$303, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    3815                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3816                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3817              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3818                      .dwattr DW$304, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    3819                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3820                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3821                      .dwendtag DW$T$30
    3822              
    3823              
    3824              DW$T$31 .dwtag  DW_TAG_structure_type
    3825                      .dwattr DW$T$31, DW_AT_byte_size(0x02)
    3826              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3827                      .dwattr DW$305, DW_AT_name("shortlrate"), DW_AT_symbol_name("_shortlrate")
    3828                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3829                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3830              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3831                      .dwattr DW$306, DW_AT_name("longlrate"), DW_AT_symbol_name("_longlrate")
    3832                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3833                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3834                      .dwendtag DW$T$31
    3835              
    3836              
    3837              DW$T$32 .dwtag  DW_TAG_structure_type
    3838                      .dwattr DW$T$32, DW_AT_byte_size(0x10)
    3839              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3840                      .dwattr DW$307, DW_AT_name("wiorequest"), DW_AT_symbol_name("_wiorequest")
    3841                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3842                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3843              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3844                      .dwattr DW$308, DW_AT_name("wiocancelled"), DW_AT_symbol_name("_wiocancelled")
    3845                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3846                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3847              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3848                      .dwattr DW$309, DW_AT_name("wioreceived"), DW_AT_symbol_name("_wioreceived")
    3849                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3850                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3851              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3852                      .dwattr DW$310, DW_AT_name("slaverequest"), DW_AT_symbol_name("_slaverequest")
    3853                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
