TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:23 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("pccli.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    5786                      .dwattr DW$T$206, DW_AT_language(DW_LANG_C)
    5787              DW$T$208        .dwtag  DW_TAG_typedef, DW_AT_name("functionstruct"), DW_AT_type(*DW$T$66)
    5788                      .dwattr DW$T$208, DW_AT_language(DW_LANG_C)
    5789              DW$T$209        .dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$68)
    5790                      .dwattr DW$T$209, DW_AT_language(DW_LANG_C)
    5791              DW$T$210        .dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$71)
    5792                      .dwattr DW$T$210, DW_AT_language(DW_LANG_C)
    5793              DW$T$211        .dwtag  DW_TAG_typedef, DW_AT_name("reprogramstruct"), DW_AT_type(*DW$T$73)
    5794                      .dwattr DW$T$211, DW_AT_language(DW_LANG_C)
    5795              
    5796              DW$T$214        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$213)
    5797                      .dwattr DW$T$214, DW_AT_language(DW_LANG_C)
    5798                      .dwattr DW$T$214, DW_AT_byte_size(0x958)
    5799              DW$215  .dwtag  DW_TAG_subrange_type
    5800                      .dwattr DW$215, DW_AT_upper_bound(0x19)
    5801                      .dwendtag DW$T$214
    5802              
    5803              DW$T$83 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    5804                      .dwattr DW$T$83, DW_AT_encoding(DW_ATE_signed_char)
    5805                      .dwattr DW$T$83, DW_AT_byte_size(0x01)
    5806              DW$T$84 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$83)
    5807                      .dwattr DW$T$84, DW_AT_address_class(0x16)
    5808              DW$T$104        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  135

    5809                      .dwattr DW$T$104, DW_AT_address_class(0x16)
    5810              
    5811              DW$T$225        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$104)
    5812                      .dwattr DW$T$225, DW_AT_language(DW_LANG_C)
    5813                      .dwattr DW$T$225, DW_AT_byte_size(0x0a)
    5814              DW$216  .dwtag  DW_TAG_subrange_type
    5815                      .dwattr DW$216, DW_AT_upper_bound(0x04)
    5816                      .dwendtag DW$T$225
    5817              
    5818              
    5819              DW$T$226        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$103)
    5820                      .dwattr DW$T$226, DW_AT_language(DW_LANG_C)
    5821              DW$217  .dwtag  DW_TAG_subrange_type
    5822                      .dwendtag DW$T$226
    5823              
    5824              
    5825              DW$T$227        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$83)
    5826                      .dwattr DW$T$227, DW_AT_language(DW_LANG_C)
    5827              
    5828              DW$T$228        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$83)
    5829                      .dwattr DW$T$228, DW_AT_language(DW_LANG_C)
    5830              DW$218  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$83)
    5831                      .dwendtag DW$T$228
    5832              
    5833              
    5834              DW$T$229        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$83)
    5835                      .dwattr DW$T$229, DW_AT_language(DW_LANG_C)
    5836              DW$219  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$84)
    5837              DW$220  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$84)
    5838                      .dwendtag DW$T$229
    5839              
    5840              
    5841              DW$T$230        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$83)
    5842                      .dwattr DW$T$230, DW_AT_language(DW_LANG_C)
    5843              DW$221  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    5844                      .dwendtag DW$T$230
    5845              
    5846              
    5847              DW$T$231        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$83)
    5848                      .dwattr DW$T$231, DW_AT_language(DW_LANG_C)
    5849                      .dwattr DW$T$231, DW_AT_byte_size(0x20)
    5850              DW$222  .dwtag  DW_TAG_subrange_type
    5851                      .dwattr DW$222, DW_AT_upper_bound(0x1f)
    5852                      .dwendtag DW$T$231
    5853              
    5854              
    5855              DW$T$232        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$83)
    5856                      .dwattr DW$T$232, DW_AT_language(DW_LANG_C)
    5857                      .dwattr DW$T$232, DW_AT_byte_size(0x64)
    5858              DW$223  .dwtag  DW_TAG_subrange_type
    5859                      .dwattr DW$223, DW_AT_upper_bound(0x63)
    5860                      .dwendtag DW$T$232
    5861              
    5862              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    5863                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  136

    5864                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    5865              
    5866              DW$T$20 .dwtag  DW_TAG_structure_type
    5867                      .dwattr DW$T$20, DW_AT_name("tag_settingsstruct")
    5868                      .dwattr DW$T$20, DW_AT_byte_size(0x24)
    5869              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5870                      .dwattr DW$224, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    5871                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5872                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    5873              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5874                      .dwattr DW$225, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    5875                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5876                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    5877              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5878                      .dwattr DW$226, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    5879                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5880                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    5881              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5882                      .dwattr DW$227, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    5883                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5884                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    5885              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5886                      .dwattr DW$228, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    5887                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5888                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    5889              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5890                      .dwattr DW$229, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    5891                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5892                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    5893              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5894                      .dwattr DW$230, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    5895                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5896                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    5897              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5898                      .dwattr DW$231, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    5899                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5900                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    5901              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5902                      .dwattr DW$232, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    5903                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5904                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    5905              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5906                      .dwattr DW$233, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    5907                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5908                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    5909              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5910                      .dwattr DW$234, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    5911                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5912                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    5913              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5914                      .dwattr DW$235, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    5915                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5916                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    5917              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5918                      .dwattr DW$236, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  137

    5919                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5920                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    5921              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5922                      .dwattr DW$237, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    5923                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5924                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    5925              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5926                      .dwattr DW$238, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    5927                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5928                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    5929              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5930                      .dwattr DW$239, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    5931                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5932                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    5933              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5934                      .dwattr DW$240, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    5935                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5936                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    5937              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5938                      .dwattr DW$241, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    5939                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5940                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    5941              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5942                      .dwattr DW$242, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    5943                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5944                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    5945              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5946                      .dwattr DW$243, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    5947                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    5948                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    5949              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5950                      .dwattr DW$244, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    5951                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5952                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5953              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5954                      .dwattr DW$245, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    5955                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5956                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    5957              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5958                      .dwattr DW$246, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    5959                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5960                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    5961              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5962                      .dwattr DW$247, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    5963                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5964                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    5965              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5966                      .dwattr DW$248, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    5967                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5968                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    5969              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5970                      .dwattr DW$249, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    5971                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5972                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5973              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  138

    5974                      .dwattr DW$250, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    5975                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5976                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5977              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5978                      .dwattr DW$251, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    5979                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5980                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5981              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5982                      .dwattr DW$252, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    5983                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5984                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5985              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5986                      .dwattr DW$253, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    5987                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5988                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5989              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5990                      .dwattr DW$254, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    5991                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5992                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5993              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5994                      .dwattr DW$255, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    5995                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5996                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5997              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5998                      .dwattr DW$256, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    5999                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6000                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    6001              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6002                      .dwattr DW$257, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    6003                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6004                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    6005              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6006                      .dwattr DW$258, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    6007                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6008                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    6009                      .dwendtag DW$T$20
    6010              
    6011              
    6012              DW$T$24 .dwtag  DW_TAG_structure_type
    6013                      .dwattr DW$T$24, DW_AT_name("tag_safestruct1struct")
    6014                      .dwattr DW$T$24, DW_AT_byte_size(0x1f)
    6015              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    6016                      .dwattr DW$259, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    6017                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6018                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    6019              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    6020                      .dwattr DW$260, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    6021                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6022                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    6023                      .dwendtag DW$T$24
    6024              
    6025              
    6026              DW$T$37 .dwtag  DW_TAG_structure_type
    6027                      .dwattr DW$T$37, DW_AT_name("tag_safestruct2struct")
    6028                      .dwattr DW$T$37, DW_AT_byte_size(0x1e)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  139

    6029              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6030                      .dwattr DW$261, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    6031                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6032                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    6033              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6034                      .dwattr DW$262, DW_AT_name("log"), DW_AT_symbol_name("_log")
    6035                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6036                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    6037              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6038                      .dwattr DW$263, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
    6039                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6040                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    6041              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    6042                      .dwattr DW$264, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    6043                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6044                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    6045              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    6046                      .dwattr DW$265, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    6047                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6048                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    6049              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    6050                      .dwattr DW$266, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
    6051                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6052                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    6053              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    6054                      .dwattr DW$267, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
    6055                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6056                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    6057              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    6058                      .dwattr DW$268, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
    6059                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6060                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    6061              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    6062                      .dwattr DW$269, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    6063                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6064                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    6065              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    6066                      .dwattr DW$270, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    6067                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6068                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    6069              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    6070                      .dwattr DW$271, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
    6071                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6072                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    6073                      .dwendtag DW$T$37
    6074              
    6075              
    6076              DW$T$38 .dwtag  DW_TAG_structure_type
    6077                      .dwattr DW$T$38, DW_AT_name("tag_xtswplusanastruct")
    6078                      .dwattr DW$T$38, DW_AT_byte_size(0x0e)
    6079              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6080                      .dwattr DW$272, DW_AT_name("analog18ma"), DW_AT_symbol_name("_analog18ma")
    6081                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6082                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    6083                      .dwendtag DW$T$38
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  140

    6084              
    6085              
    6086              DW$T$39 .dwtag  DW_TAG_structure_type
    6087                      .dwattr DW$T$39, DW_AT_name("tag_clockstruct")
    6088                      .dwattr DW$T$39, DW_AT_byte_size(0x0e)
    6089              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6090                      .dwattr DW$273, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
    6091                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6092                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    6093              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6094                      .dwattr DW$274, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
    6095                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6096                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    6097              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6098                      .dwattr DW$275, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
    6099                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6100                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    6101              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6102                      .dwattr DW$276, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
    6103                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6104                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    6105              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6106                      .dwattr DW$277, DW_AT_name("day"), DW_AT_symbol_name("_day")
    6107                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6108                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    6109              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6110                      .dwattr DW$278, DW_AT_name("date"), DW_AT_symbol_name("_date")
    6111                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6112                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    6113              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6114                      .dwattr DW$279, DW_AT_name("month"), DW_AT_symbol_name("_month")
    6115                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6116                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    6117              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6118                      .dwattr DW$280, DW_AT_name("year"), DW_AT_symbol_name("_year")
    6119                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6120                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    6121              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6122                      .dwattr DW$281, DW_AT_name("control"), DW_AT_symbol_name("_control")
    6123                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6124                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    6125              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    6126                      .dwattr DW$282, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
    6127                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6128                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    6129              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6130                      .dwattr DW$283, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
    6131                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6132                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    6133                      .dwendtag DW$T$39
    6134              
    6135              DW$T$197        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$40)
    6136                      .dwattr DW$T$197, DW_AT_language(DW_LANG_C)
    6137              
    6138              DW$T$43 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  141

    6139                      .dwattr DW$T$43, DW_AT_name("tag_allsensorstruct")
    6140                      .dwattr DW$T$43, DW_AT_byte_size(0x2d)
    6141              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6142                      .dwattr DW$284, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    6143                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6144                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    6145              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6146                      .dwattr DW$285, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    6147                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6148                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    6149              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6150                      .dwattr DW$286, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    6151                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6152                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    6153              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6154                      .dwattr DW$287, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    6155                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6156                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    6157              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6158                      .dwattr DW$288, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    6159                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6160                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    6161              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6162                      .dwattr DW$289, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    6163                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6164                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    6165              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6166                      .dwattr DW$290, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    6167                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6168                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    6169              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6170                      .dwattr DW$291, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    6171                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6172                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    6173              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6174                      .dwattr DW$292, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    6175                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6176                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    6177              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6178                      .dwattr DW$293, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    6179                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6180                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    6181              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6182                      .dwattr DW$294, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    6183                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6184                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    6185              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6186                      .dwattr DW$295, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    6187                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6188                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    6189              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6190                      .dwattr DW$296, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    6191                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6192                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    6193              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  142

    6194                      .dwattr DW$297, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    6195                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6196                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    6197              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6198                      .dwattr DW$298, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    6199                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6200                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    6201              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6202                      .dwattr DW$299, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    6203                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6204                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    6205              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    6206                      .dwattr DW$300, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    6207                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6208                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    6209              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6210                      .dwattr DW$301, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    6211                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6212                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    6213              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6214                      .dwattr DW$302, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    6215                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6216                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    6217              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6218                      .dwattr DW$303, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    6219                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6220                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    6221              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6222                      .dwattr DW$304, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    6223                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6224                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    6225              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6226                      .dwattr DW$305, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    6227                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6228                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    6229              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6230                      .dwattr DW$306, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    6231                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    6232                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    6233              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6234                      .dwattr DW$307, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    6235                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6236                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    6237              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6238                      .dwattr DW$308, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    6239                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6240                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    6241              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6242                      .dwattr DW$309, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    6243                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6244                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    6245              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6246                      .dwattr DW$310, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    6247                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6248                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  143

    6249              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6250                      .dwattr DW$311, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    6251                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6252                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    6253              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6254                      .dwattr DW$312, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    6255                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6256                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    6257              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    6258                      .dwattr DW$313, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    6259                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6260                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    6261              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6262                      .dwattr DW$314, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    6263                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    6264                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    6265              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6266                      .dwattr DW$315, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    6267                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6268                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    6269                      .dwendtag DW$T$43
    6270              
    6271              
    6272              DW$T$50 .dwtag  DW_TAG_structure_type
    6273                      .dwattr DW$T$50, DW_AT_name("tag_configstruct")
    6274                      .dwattr DW$T$50, DW_AT_byte_size(0x18)
    6275              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    6276                      .dwattr DW$316, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    6277                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6278                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    6279              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    6280                      .dwattr DW$317, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    6281                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6282                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    6283              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    6284                      .dwattr DW$318, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    6285                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6286                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    6287              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    6288                      .dwattr DW$319, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    6289                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6290                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    6291              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    6292                      .dwattr DW$320, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    6293                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6294                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    6295              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    6296                      .dwattr DW$321, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    6297                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6298                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    6299                      .dwendtag DW$T$50
    6300              
    6301              DW$T$202        .dwtag  DW_TAG_typedef, DW_AT_name("inputstruct"), DW_AT_type(*DW$T$62)
    6302                      .dwattr DW$T$202, DW_AT_language(DW_LANG_C)
    6303              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  144

    6304              DW$T$64 .dwtag  DW_TAG_structure_type
    6305                      .dwattr DW$T$64, DW_AT_name("tag_offsetstruct")
    6306                      .dwattr DW$T$64, DW_AT_byte_size(0x1c)
    6307              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    6308                      .dwattr DW$322, DW_AT_name("val"), DW_AT_symbol_name("_val")
    6309                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6310                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    6311                      .dwendtag DW$T$64
    6312              
    6313              
    6314              DW$T$66 .dwtag  DW_TAG_structure_type
    6315                      .dwattr DW$T$66, DW_AT_name("tag_functionstruct")
    6316                      .dwattr DW$T$66, DW_AT_byte_size(0x08)
    6317              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    6318                      .dwattr DW$323, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    6319                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6320                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6321                      .dwendtag DW$T$66
    6322              
    6323              
    6324              DW$T$68 .dwtag  DW_TAG_structure_type
    6325                      .dwattr DW$T$68, DW_AT_name("tag_sdsettingsstruct")
    6326                      .dwattr DW$T$68, DW_AT_byte_size(0x04)
    6327              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6328                      .dwattr DW$324, DW_AT_name("present"), DW_AT_symbol_name("_present")
    6329                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6330                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6331              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6332                      .dwattr DW$325, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
    6333                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6334                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6335              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6336                      .dwattr DW$326, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
    6337                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6338                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    6339              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    6340                      .dwattr DW$327, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
    6341                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6342                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    6343                      .dwendtag DW$T$68
    6344              
    6345              
    6346              DW$T$71 .dwtag  DW_TAG_structure_type
    6347                      .dwattr DW$T$71, DW_AT_name("tag_speedcompstruct")
    6348                      .dwattr DW$T$71, DW_AT_byte_size(0x19)
    6349              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6350                      .dwattr DW$328, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
    6351                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6352                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6353              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6354                      .dwattr DW$329, DW_AT_name("status"), DW_AT_symbol_name("_status")
    6355                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6356                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    6357              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    6358                      .dwattr DW$330, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  145

    6359                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6360                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    6361              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6362                      .dwattr DW$331, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
    6363                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6364                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    6365              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6366                      .dwattr DW$332, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
    6367                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6368                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6369              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6370                      .dwattr DW$333, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
    6371                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6372                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    6373              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6374                      .dwattr DW$334, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
    6375                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6376                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6377              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6378                      .dwattr DW$335, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
    6379                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6380                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6381              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6382                      .dwattr DW$336, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
    6383                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6384                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    6385              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6386                      .dwattr DW$337, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
    6387                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6388                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6389              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6390                      .dwattr DW$338, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
    6391                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6392                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6393              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6394                      .dwattr DW$339, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    6395                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6396                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    6397              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6398                      .dwattr DW$340, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    6399                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6400                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    6401              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6402                      .dwattr DW$341, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    6403                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6404                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    6405              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6406                      .dwattr DW$342, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    6407                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6408                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    6409              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6410                      .dwattr DW$343, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    6411                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6412                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    6413              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  146

    6414                      .dwattr DW$344, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    6415                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6416                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    6417              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6418                      .dwattr DW$345, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    6419                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6420                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    6421              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6422                      .dwattr DW$346, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    6423                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6424                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    6425              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6426                      .dwattr DW$347, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    6427                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6428                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    6429                      .dwendtag DW$T$71
    6430              
    6431              
    6432              DW$T$73 .dwtag  DW_TAG_structure_type
    6433                      .dwattr DW$T$73, DW_AT_name("tag_reprogramstruct")
    6434                      .dwattr DW$T$73, DW_AT_byte_size(0x10)
    6435              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    6436                      .dwattr DW$348, DW_AT_name("spi"), DW_AT_symbol_name("_spi")
    6437                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6438                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    6439              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    6440                      .dwattr DW$349, DW_AT_name("programkey"), DW_AT_symbol_name("_programkey")
    6441                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6442                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    6443              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6444                      .dwattr DW$350, DW_AT_name("reprogramnow"), DW_AT_symbol_name("_reprogramnow")
    6445                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6446                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    6447              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6448                      .dwattr DW$351, DW_AT_name("slavecmdok"), DW_AT_symbol_name("_slavecmdok")
    6449                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6450                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    6451              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6452                      .dwattr DW$352, DW_AT_name("slavestatus"), DW_AT_symbol_name("_slavestatus")
    6453                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6454                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    6455              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6456                      .dwattr DW$353, DW_AT_name("slavetx"), DW_AT_symbol_name("_slavetx")
    6457                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6458                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    6459              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6460                      .dwattr DW$354, DW_AT_name("slaverx"), DW_AT_symbol_name("_slaverx")
    6461                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6462                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    6463              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6464                      .dwattr DW$355, DW_AT_name("slaveset"), DW_AT_symbol_name("_slaveset")
    6465                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6466                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    6467                      .dwendtag DW$T$73
    6468              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  147

    6469              DW$356  .dwtag  DW_TAG_far_type
    6470                      .dwattr DW$356, DW_AT_type(*DW$T$212)
    6471              DW$T$213        .dwtag  DW_TAG_const_type
    6472                      .dwattr DW$T$213, DW_AT_type(*DW$356)
    6473              DW$357  .dwtag  DW_TAG_far_type
    6474                      .dwattr DW$357, DW_AT_type(*DW$T$83)
    6475              DW$T$103        .dwtag  DW_TAG_const_type
    6476                      .dwattr DW$T$103, DW_AT_type(*DW$357)
    6477              
    6478              DW$T$63 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    6479                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    6480                      .dwattr DW$T$63, DW_AT_byte_size(0x1c)
    6481              DW$358  .dwtag  DW_TAG_subrange_type
    6482                      .dwattr DW$358, DW_AT_upper_bound(0x1b)
    6483                      .dwendtag DW$T$63
    6484              
    6485              
    6486              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    6487                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    6488                      .dwattr DW$T$21, DW_AT_byte_size(0x0e)
    6489              DW$359  .dwtag  DW_TAG_subrange_type
    6490                      .dwattr DW$359, DW_AT_upper_bound(0x0d)
    6491                      .dwendtag DW$T$21
    6492              
    6493              
    6494              DW$T$70 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    6495                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    6496                      .dwattr DW$T$70, DW_AT_byte_size(0x06)
    6497              DW$360  .dwtag  DW_TAG_subrange_type
    6498                      .dwattr DW$360, DW_AT_upper_bound(0x02)
    6499              DW$361  .dwtag  DW_TAG_subrange_type
    6500                      .dwattr DW$361, DW_AT_upper_bound(0x01)
    6501                      .dwendtag DW$T$70
    6502              
    6503              
    6504              DW$T$19 .dwtag  DW_TAG_structure_type
    6505                      .dwattr DW$T$19, DW_AT_byte_size(0x02)
    6506              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6507                      .dwattr DW$362, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    6508                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6509                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    6510              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6511                      .dwattr DW$363, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    6512                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6513                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    6514                      .dwendtag DW$T$19
    6515              
    6516              
    6517              DW$T$22 .dwtag  DW_TAG_structure_type
    6518                      .dwattr DW$T$22, DW_AT_byte_size(0x1e)
    6519              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6520                      .dwattr DW$364, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    6521                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6522                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    6523              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  148

    6524                      .dwattr DW$365, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    6525                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6526                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    6527              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6528                      .dwattr DW$366, DW_AT_name("chan18ma"), DW_AT_symbol_name("_chan18ma")
    6529                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6530                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6531              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6532                      .dwattr DW$367, DW_AT_name("notused"), DW_AT_symbol_name("_notused")
    6533                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6534                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6535                      .dwendtag DW$T$22
    6536              
    6537              
    6538              DW$T$23 .dwtag  DW_TAG_structure_type
    6539                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    6540              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6541                      .dwattr DW$368, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    6542                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6543                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6544                      .dwendtag DW$T$23
    6545              
    6546              
    6547              DW$T$26 .dwtag  DW_TAG_structure_type
    6548                      .dwattr DW$T$26, DW_AT_byte_size(0x0b)
    6549              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6550                      .dwattr DW$369, DW_AT_name("calprtzero"), DW_AT_symbol_name("_calprtzero")
    6551                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6552                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6553              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6554                      .dwattr DW$370, DW_AT_name("calprtfullscale"), DW_AT_symbol_name("_calprtfullscale")
    6555                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6556                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    6557              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6558                      .dwattr DW$371, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    6559                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6560                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6561              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6562                      .dwattr DW$372, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    6563                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6564                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6565              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6566                      .dwattr DW$373, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    6567                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6568                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6569                      .dwendtag DW$T$26
    6570              
    6571              
    6572              DW$T$27 .dwtag  DW_TAG_structure_type
    6573                      .dwattr DW$T$27, DW_AT_byte_size(0x03)
    6574              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6575                      .dwattr DW$374, DW_AT_name("mainrate"), DW_AT_symbol_name("_mainrate")
    6576                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6577                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6578              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  149

    6579                      .dwattr DW$375, DW_AT_name("trendrate"), DW_AT_symbol_name("_trendrate")
    6580                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6581                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6582              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6583                      .dwattr DW$376, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    6584                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6585                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6586                      .dwendtag DW$T$27
    6587              
    6588              
    6589              DW$T$28 .dwtag  DW_TAG_structure_type
    6590                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    6591              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6592                      .dwattr DW$377, DW_AT_name("address"), DW_AT_symbol_name("_address")
    6593                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6594                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6595                      .dwendtag DW$T$28
    6596              
    6597              
    6598              DW$T$29 .dwtag  DW_TAG_structure_type
    6599                      .dwattr DW$T$29, DW_AT_byte_size(0x02)
    6600              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6601                      .dwattr DW$378, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    6602                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6603                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6604              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6605                      .dwattr DW$379, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    6606                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6607                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6608                      .dwendtag DW$T$29
    6609              
    6610              
    6611              DW$T$30 .dwtag  DW_TAG_structure_type
    6612                      .dwattr DW$T$30, DW_AT_byte_size(0x03)
    6613              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6614                      .dwattr DW$380, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    6615                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6616                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    6617              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6618                      .dwattr DW$381, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    6619                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6620                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6621              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6622                      .dwattr DW$382, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    6623                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6624                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6625                      .dwendtag DW$T$30
    6626              
    6627              
    6628              DW$T$31 .dwtag  DW_TAG_structure_type
    6629                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    6630              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6631                      .dwattr DW$383, DW_AT_name("rate"), DW_AT_symbol_name("_rate")
    6632                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6633                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  150

    6634                      .dwendtag DW$T$31
    6635              
    6636              
    6637              DW$T$32 .dwtag  DW_TAG_structure_type
    6638                      .dwattr DW$T$32, DW_AT_byte_size(0x02)
    6639              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6640                      .dwattr DW$384, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    6641                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6642                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6643              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6644                      .dwattr DW$385, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    6645                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6646                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6647                      .dwendtag DW$T$32
    6648              
    6649              
    6650              DW$T$33 .dwtag  DW_TAG_structure_type
    6651                      .dwattr DW$T$33, DW_AT_byte_size(0x04)
    6652              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6653                      .dwattr DW$386, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    6654                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6655                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6656              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6657                      .dwattr DW$387, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    6658                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6659                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6660              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6661                      .dwattr DW$388, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    6662                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6663                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6664              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6665                      .dwattr DW$389, DW_AT_name("notused4"), DW_AT_symbol_name("_notused4")
    6666                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6667                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6668                      .dwendtag DW$T$33
    6669              
    6670              
    6671              DW$T$34 .dwtag  DW_TAG_structure_type
    6672                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    6673              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6674                      .dwattr DW$390, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    6675                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6676                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6677                      .dwendtag DW$T$34
    6678              
    6679              
    6680              DW$T$35 .dwtag  DW_TAG_structure_type
    6681                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    6682              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6683                      .dwattr DW$391, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    6684                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6685                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6686                      .dwendtag DW$T$35
    6687              
    6688              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  151

    6689              DW$T$36 .dwtag  DW_TAG_structure_type
    6690                      .dwattr DW$T$36, DW_AT_byte_size(0x01)
    6691              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6692                      .dwattr DW$392, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    6693                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6694                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6695                      .dwendtag DW$T$36
    6696              
    6697              
    6698              DW$T$40 .dwtag  DW_TAG_structure_type
    6699                      .dwattr DW$T$40, DW_AT_name("tag_timers")
    6700                      .dwattr DW$T$40, DW_AT_byte_size(0x4c)
    6701              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6702                      .dwattr DW$393, DW_AT_name("update"), DW_AT_symbol_name("_update")
    6703                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6704                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6705              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6706                      .dwattr DW$394, DW_AT_name("general"), DW_AT_symbol_name("_general")
    6707                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6708                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6709              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6710                      .dwattr DW$395, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    6711                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6712                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6713              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6714                      .dwattr DW$396, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    6715                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6716                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6717              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6718                      .dwattr DW$397, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    6719                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6720                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6721              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6722                      .dwattr DW$398, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    6723                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6724                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6725              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6726                      .dwattr DW$399, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    6727                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6728                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6729              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6730                      .dwattr DW$400, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    6731                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6732                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6733              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6734                      .dwattr DW$401, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    6735                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6736                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6737              DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6738                      .dwattr DW$402, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    6739                      .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6740                      .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6741              DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6742                      .dwattr DW$403, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    6743                      .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  152

    6744                      .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6745              DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6746                      .dwattr DW$404, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    6747                      .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6748                      .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6749              DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6750                      .dwattr DW$405, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    6751                      .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6752                      .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6753              DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6754                      .dwattr DW$406, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    6755                      .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6756                      .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6757              DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6758                      .dwattr DW$407, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    6759                      .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6760                      .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6761              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6762                      .dwattr DW$408, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    6763                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6764                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6765              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6766                      .dwattr DW$409, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    6767                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6768                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6769              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6770                      .dwattr DW$410, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    6771                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    6772                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6773              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6774                      .dwattr DW$411, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    6775                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6776                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    6777              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    6778                      .dwattr DW$412, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    6779                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6780                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    6781              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    6782                      .dwattr DW$413, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    6783                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6784                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6785              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6786                      .dwattr DW$414, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    6787                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6788                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6789              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6790                      .dwattr DW$415, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    6791                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    6792                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6793              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6794                      .dwattr DW$416, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    6795                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6796                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6797              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6798                      .dwattr DW$417, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  153

    6799                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    6800                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6801              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6802                      .dwattr DW$418, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    6803                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6804                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6805              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6806                      .dwattr DW$419, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    6807                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    6808                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6809              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6810                      .dwattr DW$420, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    6811                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6812                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    6813              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6814                      .dwattr DW$421, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    6815                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    6816                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6817              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6818                      .dwattr DW$422, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    6819                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6820                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6821              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    6822                      .dwattr DW$423, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    6823                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6824                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6825              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6826                      .dwattr DW$424, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    6827                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    6828                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6829              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6830                      .dwattr DW$425, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    6831                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    6832                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6833              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6834                      .dwattr DW$426, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    6835                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6836                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6837              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6838                      .dwattr DW$427, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    6839                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    6840                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6841              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6842                      .dwattr DW$428, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    6843                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6844                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6845              DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6846                      .dwattr DW$429, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    6847                      .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    6848                      .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6849              DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6850                      .dwattr DW$430, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    6851                      .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6852                      .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6853              DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  154

    6854                      .dwattr DW$431, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    6855                      .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    6856                      .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6857              DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6858                      .dwattr DW$432, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    6859                      .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6860                      .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6861              DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6862                      .dwattr DW$433, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    6863                      .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    6864                      .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6865              DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6866                      .dwattr DW$434, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    6867                      .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6868                      .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6869              DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    6870                      .dwattr DW$435, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    6871                      .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    6872                      .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6873                      .dwendtag DW$T$40
    6874              
    6875              
    6876              DW$T$41 .dwtag  DW_TAG_structure_type
    6877                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    6878              DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6879                      .dwattr DW$436, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
    6880                      .dwattr DW$436, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    6881                      .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6882                      .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6883              DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6884                      .dwattr DW$437, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    6885                      .dwattr DW$437, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    6886                      .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6887                      .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6888              DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6889                      .dwattr DW$438, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
    6890                      .dwattr DW$438, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    6891                      .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6892                      .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6893              DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6894                      .dwattr DW$439, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
    6895                      .dwattr DW$439, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    6896                      .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6897                      .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6898              DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6899                      .dwattr DW$440, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    6900                      .dwattr DW$440, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    6901                      .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6902                      .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6903                      .dwendtag DW$T$41
    6904              
    6905              
    6906              DW$T$42 .dwtag  DW_TAG_structure_type
    6907                      .dwattr DW$T$42, DW_AT_byte_size(0x01)
    6908              DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:24 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
pccli.asm                                                            PAGE  155

    6909                      .dwattr DW$441, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
    6910                      .dwattr DW$441, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    6911                      .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6912                      .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6913              DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6914                      .dwattr DW$442, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    6915                      .dwattr DW$442, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    6916                      .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6917                      .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    6918                      .dwendtag DW$T$42
    6919              
    6920              
    6921              DW$T$44 .dwtag  DW_TAG_structure_type
    6922                      .dwattr DW$T$44, DW_AT_byte_size(0x01)
    6923              DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6924                      .dwattr DW$443, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    6925                      .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6926                      .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    6927                      .dwendtag DW$T$44
    6928              
    6929              
    6930              DW$T$45 .dwtag  DW_TAG_structure_type
    6931                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    6932              DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
