TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:24 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("PCModBus.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("sprintf"), DW_AT_symbol_name("_sprintf")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$10)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    8461                      .dwattr DW$885, DW_AT_upper_bound(0x0d)
    8462                      .dwendtag DW$T$256
    8463              
    8464              DW$T$259        .dwtag  DW_TAG_typedef, DW_AT_name("dynamicalarmsstruct"), DW_AT_type(*DW$T$81)
    8465                      .dwattr DW$T$259, DW_AT_language(DW_LANG_C)
    8466              DW$T$260        .dwtag  DW_TAG_typedef, DW_AT_name("damalarmsstruct"), DW_AT_type(*DW$T$83)
    8467                      .dwattr DW$T$260, DW_AT_language(DW_LANG_C)
    8468              DW$T$262        .dwtag  DW_TAG_typedef, DW_AT_name("mancalstruct"), DW_AT_type(*DW$T$84)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  179

    8469                      .dwattr DW$T$262, DW_AT_language(DW_LANG_C)
    8470              DW$T$263        .dwtag  DW_TAG_typedef, DW_AT_name("calibrationstruct"), DW_AT_type(*DW$T$91)
    8471                      .dwattr DW$T$263, DW_AT_language(DW_LANG_C)
    8472              DW$T$265        .dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$92)
    8473                      .dwattr DW$T$265, DW_AT_language(DW_LANG_C)
    8474              DW$T$96 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    8475                      .dwattr DW$T$96, DW_AT_encoding(DW_ATE_signed_char)
    8476                      .dwattr DW$T$96, DW_AT_byte_size(0x01)
    8477              DW$T$119        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$96)
    8478                      .dwattr DW$T$119, DW_AT_address_class(0x16)
    8479              DW$T$146        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$145)
    8480                      .dwattr DW$T$146, DW_AT_address_class(0x16)
    8481              
    8482              DW$T$266        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$96)
    8483                      .dwattr DW$T$266, DW_AT_language(DW_LANG_C)
    8484              
    8485              DW$T$267        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$96)
    8486                      .dwattr DW$T$267, DW_AT_language(DW_LANG_C)
    8487                      .dwattr DW$T$267, DW_AT_byte_size(0x64)
    8488              DW$886  .dwtag  DW_TAG_subrange_type
    8489                      .dwattr DW$886, DW_AT_upper_bound(0x63)
    8490                      .dwendtag DW$T$267
    8491              
    8492              DW$T$270        .dwtag  DW_TAG_typedef, DW_AT_name("sdfilestruct"), DW_AT_type(*DW$T$99)
    8493                      .dwattr DW$T$270, DW_AT_language(DW_LANG_C)
    8494              DW$T$272        .dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$101)
    8495                      .dwattr DW$T$272, DW_AT_language(DW_LANG_C)
    8496              DW$T$273        .dwtag  DW_TAG_typedef, DW_AT_name("waterinoilstruct"), DW_AT_type(*DW$T$104)
    8497                      .dwattr DW$T$273, DW_AT_language(DW_LANG_C)
    8498              DW$T$275        .dwtag  DW_TAG_typedef, DW_AT_name("bearingstatusstruct"), DW_AT_type(*DW$T$106)
    8499                      .dwattr DW$T$275, DW_AT_language(DW_LANG_C)
    8500              DW$T$277        .dwtag  DW_TAG_typedef, DW_AT_name("slemstruct"), DW_AT_type(*DW$T$108)
    8501                      .dwattr DW$T$277, DW_AT_language(DW_LANG_C)
    8502              DW$T$279        .dwtag  DW_TAG_typedef, DW_AT_name("rtcbatstruct"), DW_AT_type(*DW$T$110)
    8503                      .dwattr DW$T$279, DW_AT_language(DW_LANG_C)
    8504              DW$T$281        .dwtag  DW_TAG_typedef, DW_AT_name("cppstruct"), DW_AT_type(*DW$T$111)
    8505                      .dwattr DW$T$281, DW_AT_language(DW_LANG_C)
    8506              DW$T$282        .dwtag  DW_TAG_typedef, DW_AT_name("PCCmdStruct"), DW_AT_type(*DW$T$113)
    8507                      .dwattr DW$T$282, DW_AT_language(DW_LANG_C)
    8508              DW$T$284        .dwtag  DW_TAG_typedef, DW_AT_name("modbusupdatestruct"), DW_AT_type(*DW$T$114)
    8509                      .dwattr DW$T$284, DW_AT_language(DW_LANG_C)
    8510              DW$T$136        .dwtag  DW_TAG_typedef, DW_AT_name("PtrTypeEnum"), DW_AT_type(*DW$T$135)
    8511                      .dwattr DW$T$136, DW_AT_language(DW_LANG_C)
    8512              DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$19)
    8513                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    8514              DW$T$75 .dwtag  DW_TAG_typedef, DW_AT_name("sensoralarmstruct"), DW_AT_type(*DW$T$20)
    8515                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
    8516              DW$T$204        .dwtag  DW_TAG_typedef, DW_AT_name("status3struct"), DW_AT_type(*DW$T$21)
    8517                      .dwattr DW$T$204, DW_AT_language(DW_LANG_C)
    8518              DW$T$210        .dwtag  DW_TAG_typedef, DW_AT_name("alarmsstruct"), DW_AT_type(*DW$T$22)
    8519                      .dwattr DW$T$210, DW_AT_language(DW_LANG_C)
    8520              DW$T$216        .dwtag  DW_TAG_typedef, DW_AT_name("gpfport"), DW_AT_type(*DW$T$25)
    8521                      .dwattr DW$T$216, DW_AT_language(DW_LANG_C)
    8522              
    8523              DW$T$27 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  180

    8524                      .dwattr DW$T$27, DW_AT_name("tag_settingsstruct")
    8525                      .dwattr DW$T$27, DW_AT_byte_size(0x24)
    8526              DW$887  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8527                      .dwattr DW$887, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    8528                      .dwattr DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8529                      .dwattr DW$887, DW_AT_accessibility(DW_ACCESS_public)
    8530              DW$888  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8531                      .dwattr DW$888, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    8532                      .dwattr DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8533                      .dwattr DW$888, DW_AT_accessibility(DW_ACCESS_public)
    8534              DW$889  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8535                      .dwattr DW$889, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    8536                      .dwattr DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8537                      .dwattr DW$889, DW_AT_accessibility(DW_ACCESS_public)
    8538              DW$890  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8539                      .dwattr DW$890, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    8540                      .dwattr DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8541                      .dwattr DW$890, DW_AT_accessibility(DW_ACCESS_public)
    8542              DW$891  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8543                      .dwattr DW$891, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    8544                      .dwattr DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8545                      .dwattr DW$891, DW_AT_accessibility(DW_ACCESS_public)
    8546              DW$892  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8547                      .dwattr DW$892, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    8548                      .dwattr DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8549                      .dwattr DW$892, DW_AT_accessibility(DW_ACCESS_public)
    8550              DW$893  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8551                      .dwattr DW$893, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    8552                      .dwattr DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8553                      .dwattr DW$893, DW_AT_accessibility(DW_ACCESS_public)
    8554              DW$894  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8555                      .dwattr DW$894, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    8556                      .dwattr DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8557                      .dwattr DW$894, DW_AT_accessibility(DW_ACCESS_public)
    8558              DW$895  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8559                      .dwattr DW$895, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    8560                      .dwattr DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8561                      .dwattr DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8562              DW$896  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8563                      .dwattr DW$896, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    8564                      .dwattr DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8565                      .dwattr DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8566              DW$897  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8567                      .dwattr DW$897, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    8568                      .dwattr DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8569                      .dwattr DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8570              DW$898  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8571                      .dwattr DW$898, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    8572                      .dwattr DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8573                      .dwattr DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8574              DW$899  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8575                      .dwattr DW$899, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    8576                      .dwattr DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8577                      .dwattr DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8578              DW$900  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  181

    8579                      .dwattr DW$900, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    8580                      .dwattr DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8581                      .dwattr DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8582              DW$901  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8583                      .dwattr DW$901, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    8584                      .dwattr DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8585                      .dwattr DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8586              DW$902  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8587                      .dwattr DW$902, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    8588                      .dwattr DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8589                      .dwattr DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8590              DW$903  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8591                      .dwattr DW$903, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    8592                      .dwattr DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8593                      .dwattr DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8594              DW$904  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8595                      .dwattr DW$904, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    8596                      .dwattr DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8597                      .dwattr DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8598              DW$905  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8599                      .dwattr DW$905, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    8600                      .dwattr DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8601                      .dwattr DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8602              DW$906  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8603                      .dwattr DW$906, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    8604                      .dwattr DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    8605                      .dwattr DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8606              DW$907  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8607                      .dwattr DW$907, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    8608                      .dwattr DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8609                      .dwattr DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8610              DW$908  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8611                      .dwattr DW$908, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    8612                      .dwattr DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8613                      .dwattr DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8614              DW$909  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8615                      .dwattr DW$909, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    8616                      .dwattr DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8617                      .dwattr DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8618              DW$910  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8619                      .dwattr DW$910, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    8620                      .dwattr DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8621                      .dwattr DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8622              DW$911  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8623                      .dwattr DW$911, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    8624                      .dwattr DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8625                      .dwattr DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8626              DW$912  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8627                      .dwattr DW$912, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    8628                      .dwattr DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8629                      .dwattr DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8630              DW$913  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8631                      .dwattr DW$913, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    8632                      .dwattr DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8633                      .dwattr DW$913, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  182

    8634              DW$914  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8635                      .dwattr DW$914, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    8636                      .dwattr DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    8637                      .dwattr DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8638              DW$915  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8639                      .dwattr DW$915, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    8640                      .dwattr DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8641                      .dwattr DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8642              DW$916  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8643                      .dwattr DW$916, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    8644                      .dwattr DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8645                      .dwattr DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8646              DW$917  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8647                      .dwattr DW$917, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    8648                      .dwattr DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8649                      .dwattr DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8650              DW$918  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    8651                      .dwattr DW$918, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    8652                      .dwattr DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    8653                      .dwattr DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8654              DW$919  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8655                      .dwattr DW$919, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    8656                      .dwattr DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8657                      .dwattr DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8658              DW$920  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8659                      .dwattr DW$920, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    8660                      .dwattr DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8661                      .dwattr DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8662              DW$921  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8663                      .dwattr DW$921, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    8664                      .dwattr DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    8665                      .dwattr DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8666                      .dwendtag DW$T$27
    8667              
    8668              
    8669              DW$T$29 .dwtag  DW_TAG_structure_type
    8670                      .dwattr DW$T$29, DW_AT_name("tag_motionstruct")
    8671                      .dwattr DW$T$29, DW_AT_byte_size(0x09)
    8672              DW$922  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8673                      .dwattr DW$922, DW_AT_name("counter"), DW_AT_symbol_name("_counter")
    8674                      .dwattr DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8675                      .dwattr DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8676              DW$923  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8677                      .dwattr DW$923, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
    8678                      .dwattr DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8679                      .dwattr DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8680              DW$924  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    8681                      .dwattr DW$924, DW_AT_name("order"), DW_AT_symbol_name("_order")
    8682                      .dwattr DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8683                      .dwattr DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8684              DW$925  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8685                      .dwattr DW$925, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    8686                      .dwattr DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8687                      .dwattr DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8688              DW$926  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  183

    8689                      .dwattr DW$926, DW_AT_name("forwardasternflagprev"), DW_AT_symbol_name("_forwardasternflagprev")
    8690                      .dwattr DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8691                      .dwattr DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8692              DW$927  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8693                      .dwattr DW$927, DW_AT_name("recalnow"), DW_AT_symbol_name("_recalnow")
    8694                      .dwattr DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8695                      .dwattr DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8696              DW$928  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8697                      .dwattr DW$928, DW_AT_name("calerror"), DW_AT_symbol_name("_calerror")
    8698                      .dwattr DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8699                      .dwattr DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8700              DW$929  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8701                      .dwattr DW$929, DW_AT_name("recheckdir"), DW_AT_symbol_name("_recheckdir")
    8702                      .dwattr DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8703                      .dwattr DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8704                      .dwendtag DW$T$29
    8705              
    8706              
    8707              DW$T$30 .dwtag  DW_TAG_structure_type
    8708                      .dwattr DW$T$30, DW_AT_name("tag_livestruct")
    8709                      .dwattr DW$T$30, DW_AT_byte_size(0x03)
    8710              DW$930  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8711                      .dwattr DW$930, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
    8712                      .dwattr DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8713                      .dwattr DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8714              DW$931  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8715                      .dwattr DW$931, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
    8716                      .dwattr DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8717                      .dwattr DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8718              DW$932  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8719                      .dwattr DW$932, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
    8720                      .dwattr DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8721                      .dwattr DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8722                      .dwendtag DW$T$30
    8723              
    8724              
    8725              DW$T$33 .dwtag  DW_TAG_structure_type
    8726                      .dwattr DW$T$33, DW_AT_name("tag_calibrationdatetimestruct")
    8727                      .dwattr DW$T$33, DW_AT_byte_size(0x07)
    8728              DW$933  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    8729                      .dwattr DW$933, DW_AT_name("calcomplete"), DW_AT_symbol_name("_calcomplete")
    8730                      .dwattr DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8731                      .dwattr DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8732              DW$934  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    8733                      .dwattr DW$934, DW_AT_name("verification"), DW_AT_symbol_name("_verification")
    8734                      .dwattr DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8735                      .dwattr DW$934, DW_AT_accessibility(DW_ACCESS_public)
    8736              DW$935  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8737                      .dwattr DW$935, DW_AT_name("chksum"), DW_AT_symbol_name("_chksum")
    8738                      .dwattr DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8739                      .dwattr DW$935, DW_AT_accessibility(DW_ACCESS_public)
    8740                      .dwendtag DW$T$33
    8741              
    8742              
    8743              DW$T$46 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  184

    8744                      .dwattr DW$T$46, DW_AT_name("tag_safestruct2struct")
    8745                      .dwattr DW$T$46, DW_AT_byte_size(0x1e)
    8746              DW$936  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    8747                      .dwattr DW$936, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    8748                      .dwattr DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8749                      .dwattr DW$936, DW_AT_accessibility(DW_ACCESS_public)
    8750              DW$937  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    8751                      .dwattr DW$937, DW_AT_name("log"), DW_AT_symbol_name("_log")
    8752                      .dwattr DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8753                      .dwattr DW$937, DW_AT_accessibility(DW_ACCESS_public)
    8754              DW$938  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    8755                      .dwattr DW$938, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
    8756                      .dwattr DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8757                      .dwattr DW$938, DW_AT_accessibility(DW_ACCESS_public)
    8758              DW$939  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    8759                      .dwattr DW$939, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    8760                      .dwattr DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8761                      .dwattr DW$939, DW_AT_accessibility(DW_ACCESS_public)
    8762              DW$940  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    8763                      .dwattr DW$940, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    8764                      .dwattr DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8765                      .dwattr DW$940, DW_AT_accessibility(DW_ACCESS_public)
    8766              DW$941  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    8767                      .dwattr DW$941, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
    8768                      .dwattr DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8769                      .dwattr DW$941, DW_AT_accessibility(DW_ACCESS_public)
    8770              DW$942  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    8771                      .dwattr DW$942, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
    8772                      .dwattr DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8773                      .dwattr DW$942, DW_AT_accessibility(DW_ACCESS_public)
    8774              DW$943  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    8775                      .dwattr DW$943, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
    8776                      .dwattr DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8777                      .dwattr DW$943, DW_AT_accessibility(DW_ACCESS_public)
    8778              DW$944  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    8779                      .dwattr DW$944, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    8780                      .dwattr DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    8781                      .dwattr DW$944, DW_AT_accessibility(DW_ACCESS_public)
    8782              DW$945  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    8783                      .dwattr DW$945, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    8784                      .dwattr DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8785                      .dwattr DW$945, DW_AT_accessibility(DW_ACCESS_public)
    8786              DW$946  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    8787                      .dwattr DW$946, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
    8788                      .dwattr DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8789                      .dwattr DW$946, DW_AT_accessibility(DW_ACCESS_public)
    8790                      .dwendtag DW$T$46
    8791              
    8792              
    8793              DW$T$47 .dwtag  DW_TAG_structure_type
    8794                      .dwattr DW$T$47, DW_AT_name("tag_clockstruct")
    8795                      .dwattr DW$T$47, DW_AT_byte_size(0x0e)
    8796              DW$947  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8797                      .dwattr DW$947, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
    8798                      .dwattr DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  185

    8799                      .dwattr DW$947, DW_AT_accessibility(DW_ACCESS_public)
    8800              DW$948  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8801                      .dwattr DW$948, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
    8802                      .dwattr DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8803                      .dwattr DW$948, DW_AT_accessibility(DW_ACCESS_public)
    8804              DW$949  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8805                      .dwattr DW$949, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
    8806                      .dwattr DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8807                      .dwattr DW$949, DW_AT_accessibility(DW_ACCESS_public)
    8808              DW$950  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8809                      .dwattr DW$950, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
    8810                      .dwattr DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8811                      .dwattr DW$950, DW_AT_accessibility(DW_ACCESS_public)
    8812              DW$951  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8813                      .dwattr DW$951, DW_AT_name("day"), DW_AT_symbol_name("_day")
    8814                      .dwattr DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8815                      .dwattr DW$951, DW_AT_accessibility(DW_ACCESS_public)
    8816              DW$952  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8817                      .dwattr DW$952, DW_AT_name("date"), DW_AT_symbol_name("_date")
    8818                      .dwattr DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8819                      .dwattr DW$952, DW_AT_accessibility(DW_ACCESS_public)
    8820              DW$953  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8821                      .dwattr DW$953, DW_AT_name("month"), DW_AT_symbol_name("_month")
    8822                      .dwattr DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8823                      .dwattr DW$953, DW_AT_accessibility(DW_ACCESS_public)
    8824              DW$954  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8825                      .dwattr DW$954, DW_AT_name("year"), DW_AT_symbol_name("_year")
    8826                      .dwattr DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8827                      .dwattr DW$954, DW_AT_accessibility(DW_ACCESS_public)
    8828              DW$955  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8829                      .dwattr DW$955, DW_AT_name("control"), DW_AT_symbol_name("_control")
    8830                      .dwattr DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8831                      .dwattr DW$955, DW_AT_accessibility(DW_ACCESS_public)
    8832              DW$956  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    8833                      .dwattr DW$956, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
    8834                      .dwattr DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8835                      .dwattr DW$956, DW_AT_accessibility(DW_ACCESS_public)
    8836              DW$957  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8837                      .dwattr DW$957, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
    8838                      .dwattr DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8839                      .dwattr DW$957, DW_AT_accessibility(DW_ACCESS_public)
    8840                      .dwendtag DW$T$47
    8841              
    8842              DW$T$228        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$49)
    8843                      .dwattr DW$T$228, DW_AT_language(DW_LANG_C)
    8844              
    8845              DW$T$52 .dwtag  DW_TAG_structure_type
    8846                      .dwattr DW$T$52, DW_AT_name("tag_allsensorstruct")
    8847                      .dwattr DW$T$52, DW_AT_byte_size(0x2d)
    8848              DW$958  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8849                      .dwattr DW$958, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    8850                      .dwattr DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8851                      .dwattr DW$958, DW_AT_accessibility(DW_ACCESS_public)
    8852              DW$959  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8853                      .dwattr DW$959, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  186

    8854                      .dwattr DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8855                      .dwattr DW$959, DW_AT_accessibility(DW_ACCESS_public)
    8856              DW$960  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8857                      .dwattr DW$960, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    8858                      .dwattr DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8859                      .dwattr DW$960, DW_AT_accessibility(DW_ACCESS_public)
    8860              DW$961  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8861                      .dwattr DW$961, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    8862                      .dwattr DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8863                      .dwattr DW$961, DW_AT_accessibility(DW_ACCESS_public)
    8864              DW$962  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8865                      .dwattr DW$962, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    8866                      .dwattr DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8867                      .dwattr DW$962, DW_AT_accessibility(DW_ACCESS_public)
    8868              DW$963  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8869                      .dwattr DW$963, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    8870                      .dwattr DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8871                      .dwattr DW$963, DW_AT_accessibility(DW_ACCESS_public)
    8872              DW$964  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8873                      .dwattr DW$964, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    8874                      .dwattr DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8875                      .dwattr DW$964, DW_AT_accessibility(DW_ACCESS_public)
    8876              DW$965  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8877                      .dwattr DW$965, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    8878                      .dwattr DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8879                      .dwattr DW$965, DW_AT_accessibility(DW_ACCESS_public)
    8880              DW$966  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8881                      .dwattr DW$966, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    8882                      .dwattr DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8883                      .dwattr DW$966, DW_AT_accessibility(DW_ACCESS_public)
    8884              DW$967  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8885                      .dwattr DW$967, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    8886                      .dwattr DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8887                      .dwattr DW$967, DW_AT_accessibility(DW_ACCESS_public)
    8888              DW$968  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8889                      .dwattr DW$968, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    8890                      .dwattr DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8891                      .dwattr DW$968, DW_AT_accessibility(DW_ACCESS_public)
    8892              DW$969  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8893                      .dwattr DW$969, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    8894                      .dwattr DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8895                      .dwattr DW$969, DW_AT_accessibility(DW_ACCESS_public)
    8896              DW$970  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8897                      .dwattr DW$970, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    8898                      .dwattr DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8899                      .dwattr DW$970, DW_AT_accessibility(DW_ACCESS_public)
    8900              DW$971  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8901                      .dwattr DW$971, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    8902                      .dwattr DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8903                      .dwattr DW$971, DW_AT_accessibility(DW_ACCESS_public)
    8904              DW$972  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8905                      .dwattr DW$972, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    8906                      .dwattr DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8907                      .dwattr DW$972, DW_AT_accessibility(DW_ACCESS_public)
    8908              DW$973  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  187

    8909                      .dwattr DW$973, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    8910                      .dwattr DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    8911                      .dwattr DW$973, DW_AT_accessibility(DW_ACCESS_public)
    8912              DW$974  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    8913                      .dwattr DW$974, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    8914                      .dwattr DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8915                      .dwattr DW$974, DW_AT_accessibility(DW_ACCESS_public)
    8916              DW$975  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8917                      .dwattr DW$975, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    8918                      .dwattr DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8919                      .dwattr DW$975, DW_AT_accessibility(DW_ACCESS_public)
    8920              DW$976  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8921                      .dwattr DW$976, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    8922                      .dwattr DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8923                      .dwattr DW$976, DW_AT_accessibility(DW_ACCESS_public)
    8924              DW$977  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8925                      .dwattr DW$977, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    8926                      .dwattr DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    8927                      .dwattr DW$977, DW_AT_accessibility(DW_ACCESS_public)
    8928              DW$978  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8929                      .dwattr DW$978, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    8930                      .dwattr DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8931                      .dwattr DW$978, DW_AT_accessibility(DW_ACCESS_public)
    8932              DW$979  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    8933                      .dwattr DW$979, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    8934                      .dwattr DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8935                      .dwattr DW$979, DW_AT_accessibility(DW_ACCESS_public)
    8936              DW$980  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8937                      .dwattr DW$980, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    8938                      .dwattr DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    8939                      .dwattr DW$980, DW_AT_accessibility(DW_ACCESS_public)
    8940              DW$981  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8941                      .dwattr DW$981, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    8942                      .dwattr DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8943                      .dwattr DW$981, DW_AT_accessibility(DW_ACCESS_public)
    8944              DW$982  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8945                      .dwattr DW$982, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    8946                      .dwattr DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    8947                      .dwattr DW$982, DW_AT_accessibility(DW_ACCESS_public)
    8948              DW$983  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8949                      .dwattr DW$983, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    8950                      .dwattr DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    8951                      .dwattr DW$983, DW_AT_accessibility(DW_ACCESS_public)
    8952              DW$984  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8953                      .dwattr DW$984, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    8954                      .dwattr DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    8955                      .dwattr DW$984, DW_AT_accessibility(DW_ACCESS_public)
    8956              DW$985  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8957                      .dwattr DW$985, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    8958                      .dwattr DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8959                      .dwattr DW$985, DW_AT_accessibility(DW_ACCESS_public)
    8960              DW$986  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8961                      .dwattr DW$986, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    8962                      .dwattr DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    8963                      .dwattr DW$986, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  188

    8964              DW$987  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    8965                      .dwattr DW$987, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    8966                      .dwattr DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    8967                      .dwattr DW$987, DW_AT_accessibility(DW_ACCESS_public)
    8968              DW$988  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8969                      .dwattr DW$988, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    8970                      .dwattr DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    8971                      .dwattr DW$988, DW_AT_accessibility(DW_ACCESS_public)
    8972              DW$989  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8973                      .dwattr DW$989, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    8974                      .dwattr DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8975                      .dwattr DW$989, DW_AT_accessibility(DW_ACCESS_public)
    8976                      .dwendtag DW$T$52
    8977              
    8978              
    8979              DW$T$53 .dwtag  DW_TAG_structure_type
    8980                      .dwattr DW$T$53, DW_AT_name("tag_engingestruct")
    8981                      .dwattr DW$T$53, DW_AT_byte_size(0x02)
    8982              DW$990  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    8983                      .dwattr DW$990, DW_AT_name("runtime"), DW_AT_symbol_name("_runtime")
    8984                      .dwattr DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8985                      .dwattr DW$990, DW_AT_accessibility(DW_ACCESS_public)
    8986                      .dwendtag DW$T$53
    8987              
    8988              DW$T$234        .dwtag  DW_TAG_typedef, DW_AT_name("cylinderstruct"), DW_AT_type(*DW$T$56)
    8989                      .dwattr DW$T$234, DW_AT_language(DW_LANG_C)
    8990              
    8991              DW$T$63 .dwtag  DW_TAG_structure_type
    8992                      .dwattr DW$T$63, DW_AT_name("tag_configstruct")
    8993                      .dwattr DW$T$63, DW_AT_byte_size(0x18)
    8994              DW$991  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    8995                      .dwattr DW$991, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    8996                      .dwattr DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8997                      .dwattr DW$991, DW_AT_accessibility(DW_ACCESS_public)
    8998              DW$992  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    8999                      .dwattr DW$992, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    9000                      .dwattr DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9001                      .dwattr DW$992, DW_AT_accessibility(DW_ACCESS_public)
    9002              DW$993  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    9003                      .dwattr DW$993, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    9004                      .dwattr DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9005                      .dwattr DW$993, DW_AT_accessibility(DW_ACCESS_public)
    9006              DW$994  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    9007                      .dwattr DW$994, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    9008                      .dwattr DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9009                      .dwattr DW$994, DW_AT_accessibility(DW_ACCESS_public)
    9010              DW$995  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    9011                      .dwattr DW$995, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    9012                      .dwattr DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9013                      .dwattr DW$995, DW_AT_accessibility(DW_ACCESS_public)
    9014              DW$996  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    9015                      .dwattr DW$996, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    9016                      .dwattr DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9017                      .dwattr DW$996, DW_AT_accessibility(DW_ACCESS_public)
    9018                      .dwendtag DW$T$63
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  189

    9019              
    9020              
    9021              DW$T$68 .dwtag  DW_TAG_structure_type
    9022                      .dwattr DW$T$68, DW_AT_name("tag_eventlogstruct")
    9023                      .dwattr DW$T$68, DW_AT_byte_size(0x44)
    9024              DW$997  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9025                      .dwattr DW$997, DW_AT_name("eventid"), DW_AT_symbol_name("_eventid")
    9026                      .dwattr DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9027                      .dwattr DW$997, DW_AT_accessibility(DW_ACCESS_public)
    9028              DW$998  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    9029                      .dwattr DW$998, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
    9030                      .dwattr DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9031                      .dwattr DW$998, DW_AT_accessibility(DW_ACCESS_public)
    9032              DW$999  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    9033                      .dwattr DW$999, DW_AT_name("msgstring"), DW_AT_symbol_name("_msgstring")
    9034                      .dwattr DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9035                      .dwattr DW$999, DW_AT_accessibility(DW_ACCESS_public)
    9036              DW$1000 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    9037                      .dwattr DW$1000, DW_AT_name("msgstring2"), DW_AT_symbol_name("_msgstring2")
    9038                      .dwattr DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9039                      .dwattr DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    9040              DW$1001 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    9041                      .dwattr DW$1001, DW_AT_name("ackdatetime"), DW_AT_symbol_name("_ackdatetime")
    9042                      .dwattr DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    9043                      .dwattr DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    9044              DW$1002 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    9045                      .dwattr DW$1002, DW_AT_name("ackstring"), DW_AT_symbol_name("_ackstring")
    9046                      .dwattr DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9047                      .dwattr DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    9048              DW$1003 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9049                      .dwattr DW$1003, DW_AT_name("newalarmeventflag"), DW_AT_symbol_name("_newalarmeventflag")
    9050                      .dwattr DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    9051                      .dwattr DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    9052              DW$1004 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9053                      .dwattr DW$1004, DW_AT_name("eventcodestatus"), DW_AT_symbol_name("_eventcodestatus")
    9054                      .dwattr DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9055                      .dwattr DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9056              DW$1005 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9057                      .dwattr DW$1005, DW_AT_name("eventcode"), DW_AT_symbol_name("_eventcode")
    9058                      .dwattr DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    9059                      .dwattr DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9060              DW$1006 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9061                      .dwattr DW$1006, DW_AT_name("currentindex"), DW_AT_symbol_name("_currentindex")
    9062                      .dwattr DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9063                      .dwattr DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9064              DW$1007 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9065                      .dwattr DW$1007, DW_AT_name("txalarmevents"), DW_AT_symbol_name("_txalarmevents")
    9066                      .dwattr DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    9067                      .dwattr DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9068                      .dwendtag DW$T$68
    9069              
    9070              
    9071              DW$T$69 .dwtag  DW_TAG_structure_type
    9072                      .dwattr DW$T$69, DW_AT_byte_size(0x07)
    9073              DW$1008 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  190

    9074                      .dwattr DW$1008, DW_AT_name("outputtestmode"), DW_AT_symbol_name("_outputtestmode")
    9075                      .dwattr DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9076                      .dwattr DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9077              DW$1009 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9078                      .dwattr DW$1009, DW_AT_name("previousstatus"), DW_AT_symbol_name("_previousstatus")
    9079                      .dwattr DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9080                      .dwattr DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9081              DW$1010 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9082                      .dwattr DW$1010, DW_AT_name("previousslowdown"), DW_AT_symbol_name("_previousslowdown")
    9083                      .dwattr DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9084                      .dwattr DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9085              DW$1011 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9086                      .dwattr DW$1011, DW_AT_name("previousalarm"), DW_AT_symbol_name("_previousalarm")
    9087                      .dwattr DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9088                      .dwattr DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9089              DW$1012 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9090                      .dwattr DW$1012, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    9091                      .dwattr DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9092                      .dwattr DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9093              DW$1013 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9094                      .dwattr DW$1013, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    9095                      .dwattr DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9096                      .dwattr DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9097              DW$1014 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9098                      .dwattr DW$1014, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    9099                      .dwattr DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9100                      .dwattr DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9101                      .dwendtag DW$T$69
    9102              
    9103              
    9104              DW$T$72 .dwtag  DW_TAG_structure_type
    9105                      .dwattr DW$T$72, DW_AT_name("tag_prewarnstruct")
    9106                      .dwattr DW$T$72, DW_AT_byte_size(0xaa)
    9107              DW$1015 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    9108                      .dwattr DW$1015, DW_AT_name("prelevel"), DW_AT_symbol_name("_prelevel")
    9109                      .dwattr DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9110                      .dwattr DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9111              DW$1016 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    9112                      .dwattr DW$1016, DW_AT_name("average"), DW_AT_symbol_name("_average")
    9113                      .dwattr DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9114                      .dwattr DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9115              DW$1017 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    9116                      .dwattr DW$1017, DW_AT_name("calcacc"), DW_AT_symbol_name("_calcacc")
    9117                      .dwattr DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9118                      .dwattr DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9119              DW$1018 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    9120                      .dwattr DW$1018, DW_AT_name("points"), DW_AT_symbol_name("_points")
    9121                      .dwattr DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    9122                      .dwattr DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9123              DW$1019 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9124                      .dwattr DW$1019, DW_AT_name("prewarncompleteflag"), DW_AT_symbol_name("_prewarncompleteflag")
    9125                      .dwattr DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    9126                      .dwattr DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9127              DW$1020 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9128                      .dwattr DW$1020, DW_AT_name("init"), DW_AT_symbol_name("_init")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  191

    9129                      .dwattr DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0xa9]
    9130                      .dwattr DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9131                      .dwendtag DW$T$72
    9132              
    9133              
    9134              DW$T$73 .dwtag  DW_TAG_structure_type
    9135                      .dwattr DW$T$73, DW_AT_name("tag_offsetstruct")
    9136                      .dwattr DW$T$73, DW_AT_byte_size(0x1c)
    9137              DW$1021 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    9138                      .dwattr DW$1021, DW_AT_name("val"), DW_AT_symbol_name("_val")
    9139                      .dwattr DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9140                      .dwattr DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9141                      .dwendtag DW$T$73
    9142              
    9143              DW$T$245        .dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$76)
    9144                      .dwattr DW$T$245, DW_AT_language(DW_LANG_C)
    9145              
    9146              DW$T$78 .dwtag  DW_TAG_structure_type
    9147                      .dwattr DW$T$78, DW_AT_name("tag_functionstruct")
    9148                      .dwattr DW$T$78, DW_AT_byte_size(0x08)
    9149              DW$1022 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    9150                      .dwattr DW$1022, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    9151                      .dwattr DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9152                      .dwattr DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9153                      .dwendtag DW$T$78
    9154              
    9155              DW$T$251        .dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$79)
    9156                      .dwattr DW$T$251, DW_AT_language(DW_LANG_C)
    9157              DW$T$255        .dwtag  DW_TAG_typedef, DW_AT_name("manrefsumstruct"), DW_AT_type(*DW$T$80)
    9158                      .dwattr DW$T$255, DW_AT_language(DW_LANG_C)
    9159              
    9160              DW$T$81 .dwtag  DW_TAG_structure_type
    9161                      .dwattr DW$T$81, DW_AT_name("tag_dynamicalarmsstruct")
    9162                      .dwattr DW$T$81, DW_AT_byte_size(0x24)
    9163              DW$1023 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9164                      .dwattr DW$1023, DW_AT_name("rpmav"), DW_AT_symbol_name("_rpmav")
    9165                      .dwattr DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9166                      .dwattr DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9167              DW$1024 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9168                      .dwattr DW$1024, DW_AT_name("single1"), DW_AT_symbol_name("_single1")
    9169                      .dwattr DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9170                      .dwattr DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9171              DW$1025 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9172                      .dwattr DW$1025, DW_AT_name("cyl1"), DW_AT_symbol_name("_cyl1")
    9173                      .dwattr DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9174                      .dwattr DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    9175              DW$1026 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9176                      .dwattr DW$1026, DW_AT_name("mbsum1"), DW_AT_symbol_name("_mbsum1")
    9177                      .dwattr DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9178                      .dwattr DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9179              DW$1027 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9180                      .dwattr DW$1027, DW_AT_name("single2"), DW_AT_symbol_name("_single2")
    9181                      .dwattr DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9182                      .dwattr DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9183              DW$1028 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  192

    9184                      .dwattr DW$1028, DW_AT_name("cyl2"), DW_AT_symbol_name("_cyl2")
    9185                      .dwattr DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9186                      .dwattr DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9187              DW$1029 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9188                      .dwattr DW$1029, DW_AT_name("mbsum2"), DW_AT_symbol_name("_mbsum2")
    9189                      .dwattr DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9190                      .dwattr DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9191              DW$1030 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9192                      .dwattr DW$1030, DW_AT_name("deltarpmprev"), DW_AT_symbol_name("_deltarpmprev")
    9193                      .dwattr DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9194                      .dwattr DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9195              DW$1031 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9196                      .dwattr DW$1031, DW_AT_name("deltarpm"), DW_AT_symbol_name("_deltarpm")
    9197                      .dwattr DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9198                      .dwattr DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9199              DW$1032 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9200                      .dwattr DW$1032, DW_AT_name("deltarpm_int"), DW_AT_symbol_name("_deltarpm_int")
    9201                      .dwattr DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9202                      .dwattr DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    9203              DW$1033 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9204                      .dwattr DW$1033, DW_AT_name("rpmav_int"), DW_AT_symbol_name("_rpmav_int")
    9205                      .dwattr DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    9206                      .dwattr DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9207              DW$1034 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9208                      .dwattr DW$1034, DW_AT_name("deltarpmprev_int"), DW_AT_symbol_name("_deltarpmprev_int")
    9209                      .dwattr DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9210                      .dwattr DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    9211              DW$1035 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9212                      .dwattr DW$1035, DW_AT_name("single"), DW_AT_symbol_name("_single")
    9213                      .dwattr DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    9214                      .dwattr DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    9215              DW$1036 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9216                      .dwattr DW$1036, DW_AT_name("cyl"), DW_AT_symbol_name("_cyl")
    9217                      .dwattr DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9218                      .dwattr DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    9219              DW$1037 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9220                      .dwattr DW$1037, DW_AT_name("mbsum"), DW_AT_symbol_name("_mbsum")
    9221                      .dwattr DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    9222                      .dwattr DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    9223              DW$1038 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9224                      .dwattr DW$1038, DW_AT_name("singleprev"), DW_AT_symbol_name("_singleprev")
    9225                      .dwattr DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9226                      .dwattr DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    9227              DW$1039 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9228                      .dwattr DW$1039, DW_AT_name("cylprev"), DW_AT_symbol_name("_cylprev")
    9229                      .dwattr DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    9230                      .dwattr DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    9231              DW$1040 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9232                      .dwattr DW$1040, DW_AT_name("mbsumprev"), DW_AT_symbol_name("_mbsumprev")
    9233                      .dwattr DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9234                      .dwattr DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    9235              DW$1041 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9236                      .dwattr DW$1041, DW_AT_name("single1_int"), DW_AT_symbol_name("_single1_int")
    9237                      .dwattr DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    9238                      .dwattr DW$1041, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  193

    9239              DW$1042 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9240                      .dwattr DW$1042, DW_AT_name("cyl1_int"), DW_AT_symbol_name("_cyl1_int")
    9241                      .dwattr DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9242                      .dwattr DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    9243              DW$1043 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9244                      .dwattr DW$1043, DW_AT_name("mbsum1_int"), DW_AT_symbol_name("_mbsum1_int")
    9245                      .dwattr DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    9246                      .dwattr DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    9247              DW$1044 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9248                      .dwattr DW$1044, DW_AT_name("single2_int"), DW_AT_symbol_name("_single2_int")
    9249                      .dwattr DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9250                      .dwattr DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    9251              DW$1045 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9252                      .dwattr DW$1045, DW_AT_name("cyl2_int"), DW_AT_symbol_name("_cyl2_int")
    9253                      .dwattr DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    9254                      .dwattr DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    9255              DW$1046 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9256                      .dwattr DW$1046, DW_AT_name("mbsum2_int"), DW_AT_symbol_name("_mbsum2_int")
    9257                      .dwattr DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9258                      .dwattr DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    9259              DW$1047 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9260                      .dwattr DW$1047, DW_AT_name("hits"), DW_AT_symbol_name("_hits")
    9261                      .dwattr DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9262                      .dwattr DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    9263                      .dwendtag DW$T$81
    9264              
    9265              
    9266              DW$T$83 .dwtag  DW_TAG_structure_type
    9267                      .dwattr DW$T$83, DW_AT_name("tag_damalarmsstruct")
    9268                      .dwattr DW$T$83, DW_AT_byte_size(0x04)
    9269              DW$1048 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    9270                      .dwattr DW$1048, DW_AT_name("single"), DW_AT_symbol_name("_single")
    9271                      .dwattr DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9272                      .dwattr DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    9273              DW$1049 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9274                      .dwattr DW$1049, DW_AT_name("cylinder"), DW_AT_symbol_name("_cylinder")
    9275                      .dwattr DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9276                      .dwattr DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    9277              DW$1050 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9278                      .dwattr DW$1050, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
    9279                      .dwattr DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9280                      .dwattr DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    9281                      .dwendtag DW$T$83
    9282              
    9283              
    9284              DW$T$84 .dwtag  DW_TAG_structure_type
    9285                      .dwattr DW$T$84, DW_AT_name("tag_mancalstruct")
    9286                      .dwattr DW$T$84, DW_AT_byte_size(0x04)
    9287              DW$1051 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9288                      .dwattr DW$1051, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
    9289                      .dwattr DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9290                      .dwattr DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    9291              DW$1052 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9292                      .dwattr DW$1052, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
    9293                      .dwattr DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  194

    9294                      .dwattr DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    9295              DW$1053 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9296                      .dwattr DW$1053, DW_AT_name("percentleft"), DW_AT_symbol_name("_percentleft")
    9297                      .dwattr DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9298                      .dwattr DW$1053, DW_AT_accessibility(DW_ACCESS_public)
    9299              DW$1054 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9300                      .dwattr DW$1054, DW_AT_name("manupdateflag"), DW_AT_symbol_name("_manupdateflag")
    9301                      .dwattr DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9302                      .dwattr DW$1054, DW_AT_accessibility(DW_ACCESS_public)
    9303                      .dwendtag DW$T$84
    9304              
    9305              
    9306              DW$T$91 .dwtag  DW_TAG_structure_type
    9307                      .dwattr DW$T$91, DW_AT_name("tag_calibrationstruct")
    9308                      .dwattr DW$T$91, DW_AT_byte_size(0x31a)
    9309              DW$1055 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9310                      .dwattr DW$1055, DW_AT_name("rpmpoints"), DW_AT_symbol_name("_rpmpoints")
    9311                      .dwattr DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9312                      .dwattr DW$1055, DW_AT_accessibility(DW_ACCESS_public)
    9313              DW$1056 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
    9314                      .dwattr DW$1056, DW_AT_name("speedcalpoints"), DW_AT_symbol_name("_speedcalpoints")
    9315                      .dwattr DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9316                      .dwattr DW$1056, DW_AT_accessibility(DW_ACCESS_public)
    9317              DW$1057 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    9318                      .dwattr DW$1057, DW_AT_name("roughnumpoints"), DW_AT_symbol_name("_roughnumpoints")
    9319                      .dwattr DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9320                      .dwattr DW$1057, DW_AT_accessibility(DW_ACCESS_public)
    9321              DW$1058 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
    9322                      .dwattr DW$1058, DW_AT_name("numpoints"), DW_AT_symbol_name("_numpoints")
    9323                      .dwattr DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9324                      .dwattr DW$1058, DW_AT_accessibility(DW_ACCESS_public)
    9325              DW$1059 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    9326                      .dwattr DW$1059, DW_AT_name("averagespeedacc"), DW_AT_symbol_name("_averagespeedacc")
    9327                      .dwattr DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
    9328                      .dwattr DW$1059, DW_AT_accessibility(DW_ACCESS_public)
    9329              DW$1060 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    9330                      .dwattr DW$1060, DW_AT_name("averagevalacc"), DW_AT_symbol_name("_averagevalacc")
    9331                      .dwattr DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e2]
    9332                      .dwattr DW$1060, DW_AT_accessibility(DW_ACCESS_public)
    9333              DW$1061 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9334                      .dwattr DW$1061, DW_AT_name("validpoints"), DW_AT_symbol_name("_validpoints")
    9335                      .dwattr DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x28a]
    9336                      .dwattr DW$1061, DW_AT_accessibility(DW_ACCESS_public)
    9337              DW$1062 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    9338                      .dwattr DW$1062, DW_AT_name("rpmatcal"), DW_AT_symbol_name("_rpmatcal")
    9339                      .dwattr DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x28b]
    9340                      .dwattr DW$1062, DW_AT_accessibility(DW_ACCESS_public)
    9341              DW$1063 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    9342                      .dwattr DW$1063, DW_AT_name("manroughcalpts"), DW_AT_symbol_name("_manroughcalpts")
    9343                      .dwattr DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x28e]
    9344                      .dwattr DW$1063, DW_AT_accessibility(DW_ACCESS_public)
    9345              DW$1064 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    9346                      .dwattr DW$1064, DW_AT_name("manroughmin"), DW_AT_symbol_name("_manroughmin")
    9347                      .dwattr DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e2]
    9348                      .dwattr DW$1064, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  195

    9349              DW$1065 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    9350                      .dwattr DW$1065, DW_AT_name("manroughmax"), DW_AT_symbol_name("_manroughmax")
    9351                      .dwattr DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x2fe]
    9352                      .dwattr DW$1065, DW_AT_accessibility(DW_ACCESS_public)
    9353                      .dwendtag DW$T$91
    9354              
    9355              
    9356              DW$T$92 .dwtag  DW_TAG_structure_type
    9357                      .dwattr DW$T$92, DW_AT_name("tag_speedcompstruct")
    9358                      .dwattr DW$T$92, DW_AT_byte_size(0x19)
    9359              DW$1066 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9360                      .dwattr DW$1066, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
    9361                      .dwattr DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9362                      .dwattr DW$1066, DW_AT_accessibility(DW_ACCESS_public)
    9363              DW$1067 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9364                      .dwattr DW$1067, DW_AT_name("status"), DW_AT_symbol_name("_status")
    9365                      .dwattr DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9366                      .dwattr DW$1067, DW_AT_accessibility(DW_ACCESS_public)
    9367              DW$1068 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
    9368                      .dwattr DW$1068, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
    9369                      .dwattr DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9370                      .dwattr DW$1068, DW_AT_accessibility(DW_ACCESS_public)
    9371              DW$1069 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9372                      .dwattr DW$1069, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
    9373                      .dwattr DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9374                      .dwattr DW$1069, DW_AT_accessibility(DW_ACCESS_public)
    9375              DW$1070 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9376                      .dwattr DW$1070, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
    9377                      .dwattr DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    9378                      .dwattr DW$1070, DW_AT_accessibility(DW_ACCESS_public)
    9379              DW$1071 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9380                      .dwattr DW$1071, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
    9381                      .dwattr DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9382                      .dwattr DW$1071, DW_AT_accessibility(DW_ACCESS_public)
    9383              DW$1072 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9384                      .dwattr DW$1072, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
    9385                      .dwattr DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9386                      .dwattr DW$1072, DW_AT_accessibility(DW_ACCESS_public)
    9387              DW$1073 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9388                      .dwattr DW$1073, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
    9389                      .dwattr DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9390                      .dwattr DW$1073, DW_AT_accessibility(DW_ACCESS_public)
    9391              DW$1074 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9392                      .dwattr DW$1074, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
    9393                      .dwattr DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9394                      .dwattr DW$1074, DW_AT_accessibility(DW_ACCESS_public)
    9395              DW$1075 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9396                      .dwattr DW$1075, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
    9397                      .dwattr DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9398                      .dwattr DW$1075, DW_AT_accessibility(DW_ACCESS_public)
    9399              DW$1076 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9400                      .dwattr DW$1076, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
    9401                      .dwattr DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    9402                      .dwattr DW$1076, DW_AT_accessibility(DW_ACCESS_public)
    9403              DW$1077 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  196

    9404                      .dwattr DW$1077, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    9405                      .dwattr DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9406                      .dwattr DW$1077, DW_AT_accessibility(DW_ACCESS_public)
    9407              DW$1078 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9408                      .dwattr DW$1078, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    9409                      .dwattr DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    9410                      .dwattr DW$1078, DW_AT_accessibility(DW_ACCESS_public)
    9411              DW$1079 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9412                      .dwattr DW$1079, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    9413                      .dwattr DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9414                      .dwattr DW$1079, DW_AT_accessibility(DW_ACCESS_public)
    9415              DW$1080 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9416                      .dwattr DW$1080, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    9417                      .dwattr DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    9418                      .dwattr DW$1080, DW_AT_accessibility(DW_ACCESS_public)
    9419              DW$1081 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9420                      .dwattr DW$1081, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    9421                      .dwattr DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9422                      .dwattr DW$1081, DW_AT_accessibility(DW_ACCESS_public)
    9423              DW$1082 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9424                      .dwattr DW$1082, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    9425                      .dwattr DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    9426                      .dwattr DW$1082, DW_AT_accessibility(DW_ACCESS_public)
    9427              DW$1083 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9428                      .dwattr DW$1083, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    9429                      .dwattr DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9430                      .dwattr DW$1083, DW_AT_accessibility(DW_ACCESS_public)
    9431              DW$1084 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9432                      .dwattr DW$1084, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    9433                      .dwattr DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    9434                      .dwattr DW$1084, DW_AT_accessibility(DW_ACCESS_public)
    9435              DW$1085 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9436                      .dwattr DW$1085, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    9437                      .dwattr DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9438                      .dwattr DW$1085, DW_AT_accessibility(DW_ACCESS_public)
    9439                      .dwendtag DW$T$92
    9440              
    9441              DW$1086 .dwtag  DW_TAG_far_type
    9442                      .dwattr DW$1086, DW_AT_type(*DW$T$96)
    9443              DW$T$145        .dwtag  DW_TAG_const_type
    9444                      .dwattr DW$T$145, DW_AT_type(*DW$1086)
    9445              
    9446              DW$T$99 .dwtag  DW_TAG_structure_type
    9447                      .dwattr DW$T$99, DW_AT_name("tag_sdfilestruct")
    9448                      .dwattr DW$T$99, DW_AT_byte_size(0x14e)
    9449              DW$1087 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9450                      .dwattr DW$1087, DW_AT_name("year1"), DW_AT_symbol_name("_year1")
    9451                      .dwattr DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9452                      .dwattr DW$1087, DW_AT_accessibility(DW_ACCESS_public)
    9453              DW$1088 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9454                      .dwattr DW$1088, DW_AT_name("month1"), DW_AT_symbol_name("_month1")
    9455                      .dwattr DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9456                      .dwattr DW$1088, DW_AT_accessibility(DW_ACCESS_public)
    9457              DW$1089 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9458                      .dwattr DW$1089, DW_AT_name("date1"), DW_AT_symbol_name("_date1")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  197

    9459                      .dwattr DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9460                      .dwattr DW$1089, DW_AT_accessibility(DW_ACCESS_public)
    9461              DW$1090 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9462                      .dwattr DW$1090, DW_AT_name("yearn"), DW_AT_symbol_name("_yearn")
    9463                      .dwattr DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9464                      .dwattr DW$1090, DW_AT_accessibility(DW_ACCESS_public)
    9465              DW$1091 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9466                      .dwattr DW$1091, DW_AT_name("monthn"), DW_AT_symbol_name("_monthn")
    9467                      .dwattr DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9468                      .dwattr DW$1091, DW_AT_accessibility(DW_ACCESS_public)
    9469              DW$1092 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9470                      .dwattr DW$1092, DW_AT_name("daten"), DW_AT_symbol_name("_daten")
    9471                      .dwattr DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9472                      .dwattr DW$1092, DW_AT_accessibility(DW_ACCESS_public)
    9473              DW$1093 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9474                      .dwattr DW$1093, DW_AT_name("readyear"), DW_AT_symbol_name("_readyear")
    9475                      .dwattr DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9476                      .dwattr DW$1093, DW_AT_accessibility(DW_ACCESS_public)
    9477              DW$1094 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9478                      .dwattr DW$1094, DW_AT_name("readmonth"), DW_AT_symbol_name("_readmonth")
    9479                      .dwattr DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9480                      .dwattr DW$1094, DW_AT_accessibility(DW_ACCESS_public)
    9481              DW$1095 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9482                      .dwattr DW$1095, DW_AT_name("readdate"), DW_AT_symbol_name("_readdate")
    9483                      .dwattr DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9484                      .dwattr DW$1095, DW_AT_accessibility(DW_ACCESS_public)
    9485              DW$1096 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    9486                      .dwattr DW$1096, DW_AT_name("file"), DW_AT_symbol_name("_file")
    9487                      .dwattr DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9488                      .dwattr DW$1096, DW_AT_accessibility(DW_ACCESS_public)
    9489              DW$1097 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    9490                      .dwattr DW$1097, DW_AT_name("readbuffer"), DW_AT_symbol_name("_readbuffer")
    9491                      .dwattr DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9492                      .dwattr DW$1097, DW_AT_accessibility(DW_ACCESS_public)
    9493              DW$1098 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9494                      .dwattr DW$1098, DW_AT_name("entryposition"), DW_AT_symbol_name("_entryposition")
    9495                      .dwattr DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    9496                      .dwattr DW$1098, DW_AT_accessibility(DW_ACCESS_public)
    9497              DW$1099 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9498                      .dwattr DW$1099, DW_AT_name("logtype"), DW_AT_symbol_name("_logtype")
    9499                      .dwattr DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
    9500                      .dwattr DW$1099, DW_AT_accessibility(DW_ACCESS_public)
    9501              DW$1100 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    9502                      .dwattr DW$1100, DW_AT_name("directorystr"), DW_AT_symbol_name("_directorystr")
    9503                      .dwattr DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0x13b]
    9504                      .dwattr DW$1100, DW_AT_accessibility(DW_ACCESS_public)
    9505              DW$1101 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
    9506                      .dwattr DW$1101, DW_AT_name("filenamestr"), DW_AT_symbol_name("_filenamestr")
    9507                      .dwattr DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0x13f]
    9508                      .dwattr DW$1101, DW_AT_accessibility(DW_ACCESS_public)
    9509              DW$1102 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9510                      .dwattr DW$1102, DW_AT_name("getnumwords"), DW_AT_symbol_name("_getnumwords")
    9511                      .dwattr DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0x146]
    9512                      .dwattr DW$1102, DW_AT_accessibility(DW_ACCESS_public)
    9513              DW$1103 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:25 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
PCModBus.asm                                                         PAGE  198

    9514                      .dwattr DW$1103, DW_AT_name("setnumwords"), DW_AT_symbol_name("_setnumwords")
    9515                      .dwattr DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    9516                      .dwattr DW$1103, DW_AT_accessibility(DW_ACCESS_public)
    9517              DW$1104 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9518                      .dwattr DW$1104, DW_AT_name("setoffset"), DW_AT_symbol_name("_setoffset")
    9519                      .dwattr DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x14a]
    9520                      .dwattr DW$1104, DW_AT_accessibility(DW_ACCESS_public)
    9521              DW$1105 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9522                      .dwattr DW$1105, DW_AT_name("readwriteflag"), DW_AT_symbol_name("_readwriteflag")
    9523                      .dwattr DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
    9524                      .dwattr DW$1105, DW_AT_accessibility(DW_ACCESS_public)
    9525              DW$1106 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9526                      .dwattr DW$1106, DW_AT_name("readwriteprogress"), DW_AT_symbol_name("_readwriteprogress")
    9527                      .dwattr DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0x14d]
    9528                      .dwattr DW$1106, DW_AT_accessibility(DW_ACCESS_public)
    9529                      .dwendtag DW$T$99
    9530              
    9531              
    9532              DW$T$101        .dwtag  DW_TAG_structure_type
    9533                      .dwattr DW$T$101, DW_AT_name("tag_sdsettingsstruct")
    9534                      .dwattr DW$T$101, DW_AT_byte_size(0x04)
    9535              DW$1107 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9536                      .dwattr DW$1107, DW_AT_name("present"), DW_AT_symbol_name("_present")
    9537                      .dwattr DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9538                      .dwattr DW$1107, DW_AT_accessibility(DW_ACCESS_public)
    9539              DW$1108 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9540                      .dwattr DW$1108, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
    9541                      .dwattr DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9542                      .dwattr DW$1108, DW_AT_accessibility(DW_ACCESS_public)
    9543              DW$1109 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9544                      .dwattr DW$1109, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
    9545                      .dwattr DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9546                      .dwattr DW$1109, DW_AT_accessibility(DW_ACCESS_public)
    9547              DW$1110 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
    9548                      .dwattr DW$1110, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
    9549                      .dwattr DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9550                      .dwattr DW$1110, DW_AT_accessibility(DW_ACCESS_public)
    9551                      .dwendtag DW$T$101
    9552              
    9553              
    9554              DW$T$104        .dwtag  DW_TAG_structure_type
