TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
port.asm                                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:26 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("port.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     452                      .dwattr DW$24, DW_AT_begin_file("port.c")
     453                      .dwattr DW$24, DW_AT_begin_line(0xcd)
     454                      .dwattr DW$24, DW_AT_begin_column(0x06)
     455                      .dwattr DW$24, DW_AT_frame_base[DW_OP_breg20 -2]
     456                      .dwattr DW$24, DW_AT_skeletal(0x01)
     457                      .dwpsn  "port.c",206,1
     458              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
port.asm                                                             PAGE   10

     459              ;***************************************************************
     460              ;* FNAME: _fn_gettaskID                 FR SIZE:   0           *
     461              ;*                                                             *
     462              ;* FUNCTION ENVIRONMENT                                        *
     463              ;*                                                             *
     464              ;* FUNCTION PROPERTIES                                         *
     465              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     466              ;***************************************************************
     467              
     468 00000098       _fn_gettaskID:
     469 00000098 0201          MOVB      ACC,#1
     470                      .dwpsn  "port.c",208,1
     471 00000099 0006          LRETR
     472                      ; return occurs
     473                      .dwattr DW$24, DW_AT_end_file("port.c")
     474                      .dwattr DW$24, DW_AT_end_line(0xd0)
     475                      .dwattr DW$24, DW_AT_end_column(0x01)
     476                      .dwendtag DW$24
     477              
     478              ;***************************************************************
     479              ;* UNDEFINED EXTERNAL REFERENCES                               *
     480              ;***************************************************************
     481                      .global _BCDtoInt
     482                      .global _clocktime
     483              
     484              ;***************************************************************
     485              ;* TYPE INFORMATION                                            *
     486              ;***************************************************************
     487              
     488              DW$T$20 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$9)
     489                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     490              
     491              DW$T$22 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     492                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     493              DW$25   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$21)
     494                      .dwendtag DW$T$22
     495              
     496              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     497                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     498                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     499              
     500              DW$T$23 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
     501                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     502              DW$26   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     503                      .dwendtag DW$T$23
     504              
     505              
     506              DW$T$27 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
     507                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     508              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     509                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     510                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
     511              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
     512                      .dwattr DW$T$21, DW_AT_address_class(0x16)
     513              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
port.asm                                                             PAGE   11

     514              DW$T$29 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
     515                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     516              DW$27   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
     517                      .dwendtag DW$T$29
     518              
     519              DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("clockstruct"), DW_AT_type(*DW$T$19)
     520                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     521              DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     522                      .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     523                      .dwattr DW$T$9, DW_AT_byte_size(0x01)
     524              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     525                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     526                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     527              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
     528                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
     529                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
     530              
     531              DW$T$19 .dwtag  DW_TAG_structure_type
     532                      .dwattr DW$T$19, DW_AT_name("tag_clockstruct")
     533                      .dwattr DW$T$19, DW_AT_byte_size(0x0e)
     534              DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     535                      .dwattr DW$28, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
     536                      .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537                      .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     538              DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     539                      .dwattr DW$29, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
     540                      .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     541                      .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     542              DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     543                      .dwattr DW$30, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
     544                      .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     545                      .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     546              DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     547                      .dwattr DW$31, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
     548                      .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     549                      .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     550              DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     551                      .dwattr DW$32, DW_AT_name("day"), DW_AT_symbol_name("_day")
     552                      .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     553                      .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     554              DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     555                      .dwattr DW$33, DW_AT_name("date"), DW_AT_symbol_name("_date")
     556                      .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     557                      .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     558              DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     559                      .dwattr DW$34, DW_AT_name("month"), DW_AT_symbol_name("_month")
     560                      .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     561                      .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     562              DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     563                      .dwattr DW$35, DW_AT_name("year"), DW_AT_symbol_name("_year")
     564                      .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     565                      .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     566              DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     567                      .dwattr DW$36, DW_AT_name("control"), DW_AT_symbol_name("_control")
     568                      .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
port.asm                                                             PAGE   12

     569                      .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     570              DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
     571                      .dwattr DW$37, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
     572                      .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     573                      .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     574              DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     575                      .dwattr DW$38, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
     576                      .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     577                      .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     578                      .dwendtag DW$T$19
     579              
     580              
     581                      .dwattr DW$14, DW_AT_external(0x01)
     582                      .dwattr DW$14, DW_AT_type(*DW$T$9)
     583                      .dwattr DW$5, DW_AT_external(0x01)
     584                      .dwattr DW$5, DW_AT_type(*DW$T$13)
     585                      .dwattr DW$15, DW_AT_external(0x01)
     586                      .dwattr DW$15, DW_AT_type(*DW$T$9)
     587                      .dwattr DW$16, DW_AT_external(0x01)
     588                      .dwattr DW$16, DW_AT_type(*DW$T$10)
     589                      .dwattr DW$18, DW_AT_external(0x01)
     590                      .dwattr DW$18, DW_AT_type(*DW$T$10)
     591                      .dwattr DW$20, DW_AT_external(0x01)
     592                      .dwattr DW$20, DW_AT_type(*DW$T$10)
     593                      .dwattr DW$22, DW_AT_external(0x01)
     594                      .dwattr DW$22, DW_AT_type(*DW$T$10)
     595                      .dwattr DW$24, DW_AT_external(0x01)
     596                      .dwattr DW$24, DW_AT_type(*DW$T$12)
     597                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     598              
     599              ;***************************************************************
     600              ;* DWARF REGISTER MAP                                          *
     601              ;***************************************************************
     602              
     603              DW$39   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     604                      .dwattr DW$39, DW_AT_location[DW_OP_reg0]
     605              DW$40   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
     606                      .dwattr DW$40, DW_AT_location[DW_OP_reg1]
     607              DW$41   .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
     608                      .dwattr DW$41, DW_AT_location[DW_OP_reg2]
     609              DW$42   .dwtag  DW_TAG_assign_register, DW_AT_name("PH")
     610                      .dwattr DW$42, DW_AT_location[DW_OP_reg3]
     611              DW$43   .dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
     612                      .dwattr DW$43, DW_AT_location[DW_OP_reg4]
     613              DW$44   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
     614                      .dwattr DW$44, DW_AT_location[DW_OP_reg5]
     615              DW$45   .dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
     616                      .dwattr DW$45, DW_AT_location[DW_OP_reg6]
     617              DW$46   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
     618                      .dwattr DW$46, DW_AT_location[DW_OP_reg7]
     619              DW$47   .dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
     620                      .dwattr DW$47, DW_AT_location[DW_OP_reg8]
     621              DW$48   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
     622                      .dwattr DW$48, DW_AT_location[DW_OP_reg9]
     623              DW$49   .dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
port.asm                                                             PAGE   13

     624                      .dwattr DW$49, DW_AT_location[DW_OP_reg10]
     625              DW$50   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
     626                      .dwattr DW$50, DW_AT_location[DW_OP_reg11]
     627              DW$51   .dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
     628                      .dwattr DW$51, DW_AT_location[DW_OP_reg12]
     629              DW$52   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
