TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:27 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("reprog.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("sprintf"), DW_AT_symbol_name("_sprintf")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$10)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    4784                      .dwattr DW$126, DW_AT_upper_bound(0x63)
    4785                      .dwendtag DW$T$85
    4786              
    4787              DW$127  .dwtag  DW_TAG_far_type
    4788                      .dwattr DW$127, DW_AT_type(*DW$T$86)
    4789              DW$T$87 .dwtag  DW_TAG_volatile_type
    4790                      .dwattr DW$T$87, DW_AT_type(*DW$127)
    4791              
    4792              DW$T$89 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$88)
    4793                      .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    4794                      .dwattr DW$T$89, DW_AT_byte_size(0x8d6)
    4795              DW$128  .dwtag  DW_TAG_subrange_type
    4796                      .dwattr DW$128, DW_AT_upper_bound(0x8d5)
    4797                      .dwendtag DW$T$89
    4798              
    4799              DW$T$59 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
    4800                      .dwattr DW$T$59, DW_AT_address_class(0x16)
    4801              DW$129  .dwtag  DW_TAG_far_type
    4802                      .dwattr DW$129, DW_AT_type(*DW$T$95)
    4803              DW$T$96 .dwtag  DW_TAG_volatile_type
    4804                      .dwattr DW$T$96, DW_AT_type(*DW$129)
    4805              DW$130  .dwtag  DW_TAG_far_type
    4806                      .dwattr DW$130, DW_AT_type(*DW$T$99)
    4807              DW$T$100        .dwtag  DW_TAG_volatile_type
    4808                      .dwattr DW$T$100, DW_AT_type(*DW$130)
    4809              DW$T$49 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    4810                      .dwattr DW$T$49, DW_AT_address_class(0x16)
    4811              DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    4812                      .dwattr DW$T$64, DW_AT_address_class(0x16)
    4813              
    4814              DW$T$103        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$27)
    4815                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    4816                      .dwattr DW$T$103, DW_AT_byte_size(0x64)
    4817              DW$131  .dwtag  DW_TAG_subrange_type
    4818                      .dwattr DW$131, DW_AT_upper_bound(0x63)
    4819                      .dwendtag DW$T$103
    4820              
    4821              DW$T$104        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadA"), DW_AT_type(*DW$T$28)
    4822                      .dwattr DW$T$104, DW_AT_language(DW_LANG_C)
    4823              DW$T$106        .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$30)
    4824                      .dwattr DW$T$106, DW_AT_language(DW_LANG_C)
    4825              DW$132  .dwtag  DW_TAG_far_type
    4826                      .dwattr DW$132, DW_AT_type(*DW$T$107)
    4827              DW$T$108        .dwtag  DW_TAG_volatile_type
    4828                      .dwattr DW$T$108, DW_AT_type(*DW$132)
    4829              DW$T$110        .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$35)
    4830                      .dwattr DW$T$110, DW_AT_language(DW_LANG_C)
    4831              DW$T$111        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$42)
    4832                      .dwattr DW$T$111, DW_AT_language(DW_LANG_C)
    4833              DW$T$112        .dwtag  DW_TAG_typedef, DW_AT_name("PCCmdStruct"), DW_AT_type(*DW$T$44)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE   98

    4834                      .dwattr DW$T$112, DW_AT_language(DW_LANG_C)
    4835              DW$T$113        .dwtag  DW_TAG_typedef, DW_AT_name("slavecmdstruct"), DW_AT_type(*DW$T$46)
    4836                      .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
    4837              DW$T$114        .dwtag  DW_TAG_typedef, DW_AT_name("reprogramstruct"), DW_AT_type(*DW$T$48)
    4838                      .dwattr DW$T$114, DW_AT_language(DW_LANG_C)
    4839              DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("uint"), DW_AT_type(*DW$T$11)
    4840                      .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    4841              DW$133  .dwtag  DW_TAG_far_type
    4842                      .dwattr DW$133, DW_AT_type(*DW$T$11)
    4843              DW$T$88 .dwtag  DW_TAG_const_type
    4844                      .dwattr DW$T$88, DW_AT_type(*DW$133)
    4845              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    4846                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4847                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    4848              DW$T$95 .dwtag  DW_TAG_typedef, DW_AT_name("gpaport"), DW_AT_type(*DW$T$21)
    4849                      .dwattr DW$T$95, DW_AT_language(DW_LANG_C)
    4850              DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("gpdport"), DW_AT_type(*DW$T$24)
    4851                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    4852              DW$T$27 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    4853                      .dwattr DW$T$27, DW_AT_encoding(DW_ATE_signed_char)
    4854                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    4855              DW$134  .dwtag  DW_TAG_far_type
    4856                      .dwattr DW$134, DW_AT_type(*DW$T$27)
    4857              DW$T$63 .dwtag  DW_TAG_const_type
    4858                      .dwattr DW$T$63, DW_AT_type(*DW$134)
    4859              
    4860              DW$T$28 .dwtag  DW_TAG_structure_type
    4861                      .dwattr DW$T$28, DW_AT_name("tag_uartreadA")
    4862                      .dwattr DW$T$28, DW_AT_byte_size(0x96)
    4863              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4864                      .dwattr DW$135, DW_AT_name("headptr"), DW_AT_symbol_name("_headptr")
    4865                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4866                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    4867              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4868                      .dwattr DW$136, DW_AT_name("tailptr"), DW_AT_symbol_name("_tailptr")
    4869                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4870                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    4871              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4872                      .dwattr DW$137, DW_AT_name("eobuf"), DW_AT_symbol_name("_eobuf")
    4873                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4874                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    4875              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4876                      .dwattr DW$138, DW_AT_name("charcount"), DW_AT_symbol_name("_charcount")
    4877                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4878                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    4879              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4880                      .dwattr DW$139, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
    4881                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4882                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    4883              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4884                      .dwattr DW$140, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    4885                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4886                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    4887              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    4888                      .dwattr DW$141, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE   99

    4889                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4890                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    4891              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    4892                      .dwattr DW$142, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    4893                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x95]
    4894                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    4895                      .dwendtag DW$T$28
    4896              
    4897              
    4898              DW$T$30 .dwtag  DW_TAG_structure_type
    4899                      .dwattr DW$T$30, DW_AT_name("tag_settingsstruct")
    4900                      .dwattr DW$T$30, DW_AT_byte_size(0x24)
    4901              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4902                      .dwattr DW$143, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    4903                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4904                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    4905              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4906                      .dwattr DW$144, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    4907                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4908                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    4909              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4910                      .dwattr DW$145, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    4911                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4912                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    4913              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4914                      .dwattr DW$146, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    4915                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4916                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    4917              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4918                      .dwattr DW$147, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    4919                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4920                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    4921              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4922                      .dwattr DW$148, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    4923                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4924                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    4925              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4926                      .dwattr DW$149, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    4927                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4928                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    4929              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4930                      .dwattr DW$150, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    4931                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4932                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    4933              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4934                      .dwattr DW$151, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    4935                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4936                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    4937              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4938                      .dwattr DW$152, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    4939                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4940                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    4941              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4942                      .dwattr DW$153, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    4943                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  100

    4944                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    4945              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4946                      .dwattr DW$154, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    4947                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4948                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    4949              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4950                      .dwattr DW$155, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    4951                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4952                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    4953              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4954                      .dwattr DW$156, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    4955                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4956                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    4957              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4958                      .dwattr DW$157, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    4959                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4960                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    4961              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4962                      .dwattr DW$158, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    4963                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4964                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    4965              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4966                      .dwattr DW$159, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    4967                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4968                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    4969              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4970                      .dwattr DW$160, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    4971                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4972                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    4973              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4974                      .dwattr DW$161, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    4975                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4976                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    4977              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4978                      .dwattr DW$162, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    4979                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4980                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    4981              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4982                      .dwattr DW$163, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    4983                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4984                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    4985              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4986                      .dwattr DW$164, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    4987                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4988                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4989              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4990                      .dwattr DW$165, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    4991                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4992                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    4993              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4994                      .dwattr DW$166, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    4995                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4996                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4997              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4998                      .dwattr DW$167, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  101

    4999                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5000                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    5001              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5002                      .dwattr DW$168, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    5003                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5004                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    5005              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5006                      .dwattr DW$169, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    5007                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5008                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    5009              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5010                      .dwattr DW$170, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    5011                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5012                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    5013              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5014                      .dwattr DW$171, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    5015                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5016                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    5017              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5018                      .dwattr DW$172, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    5019                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5020                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    5021              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5022                      .dwattr DW$173, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    5023                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5024                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    5025              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    5026                      .dwattr DW$174, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    5027                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5028                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    5029              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5030                      .dwattr DW$175, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    5031                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5032                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    5033              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5034                      .dwattr DW$176, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    5035                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5036                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    5037              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5038                      .dwattr DW$177, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    5039                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5040                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    5041                      .dwendtag DW$T$30
    5042              
    5043              DW$T$107        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$32)
    5044                      .dwattr DW$T$107, DW_AT_language(DW_LANG_C)
    5045              
    5046              DW$T$35 .dwtag  DW_TAG_structure_type
    5047                      .dwattr DW$T$35, DW_AT_name("tag_allsensorstruct")
    5048                      .dwattr DW$T$35, DW_AT_byte_size(0x2d)
    5049              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5050                      .dwattr DW$178, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    5051                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5052                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    5053              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  102

    5054                      .dwattr DW$179, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    5055                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5056                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    5057              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5058                      .dwattr DW$180, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    5059                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5060                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    5061              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5062                      .dwattr DW$181, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    5063                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5064                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    5065              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5066                      .dwattr DW$182, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    5067                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5068                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    5069              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5070                      .dwattr DW$183, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    5071                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5072                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    5073              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5074                      .dwattr DW$184, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    5075                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5076                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    5077              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5078                      .dwattr DW$185, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    5079                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5080                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    5081              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5082                      .dwattr DW$186, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    5083                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5084                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    5085              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5086                      .dwattr DW$187, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    5087                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5088                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    5089              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5090                      .dwattr DW$188, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    5091                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5092                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    5093              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5094                      .dwattr DW$189, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    5095                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5096                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    5097              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5098                      .dwattr DW$190, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    5099                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5100                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    5101              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5102                      .dwattr DW$191, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    5103                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5104                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    5105              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5106                      .dwattr DW$192, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    5107                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5108                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  103

    5109              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5110                      .dwattr DW$193, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    5111                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5112                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    5113              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    5114                      .dwattr DW$194, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    5115                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5116                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    5117              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5118                      .dwattr DW$195, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    5119                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5120                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    5121              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5122                      .dwattr DW$196, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    5123                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5124                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    5125              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5126                      .dwattr DW$197, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    5127                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    5128                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    5129              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5130                      .dwattr DW$198, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    5131                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5132                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    5133              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5134                      .dwattr DW$199, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    5135                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5136                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    5137              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5138                      .dwattr DW$200, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    5139                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5140                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    5141              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5142                      .dwattr DW$201, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    5143                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5144                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    5145              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5146                      .dwattr DW$202, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    5147                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    5148                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    5149              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5150                      .dwattr DW$203, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    5151                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5152                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    5153              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5154                      .dwattr DW$204, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    5155                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5156                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    5157              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5158                      .dwattr DW$205, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    5159                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5160                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    5161              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5162                      .dwattr DW$206, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    5163                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  104

    5164                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    5165              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    5166                      .dwattr DW$207, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    5167                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5168                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    5169              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5170                      .dwattr DW$208, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    5171                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    5172                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    5173              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5174                      .dwattr DW$209, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    5175                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5176                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    5177                      .dwendtag DW$T$35
    5178              
    5179              
    5180              DW$T$42 .dwtag  DW_TAG_structure_type
    5181                      .dwattr DW$T$42, DW_AT_name("tag_configstruct")
    5182                      .dwattr DW$T$42, DW_AT_byte_size(0x18)
    5183              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    5184                      .dwattr DW$210, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    5185                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5186                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    5187              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    5188                      .dwattr DW$211, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    5189                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5190                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    5191              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    5192                      .dwattr DW$212, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    5193                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5194                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    5195              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    5196                      .dwattr DW$213, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    5197                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5198                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    5199              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    5200                      .dwattr DW$214, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    5201                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5202                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    5203              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    5204                      .dwattr DW$215, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    5205                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5206                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    5207                      .dwendtag DW$T$42
    5208              
    5209              
    5210              DW$T$44 .dwtag  DW_TAG_structure_type
    5211                      .dwattr DW$T$44, DW_AT_name("tag_PCCmdStruct")
    5212                      .dwattr DW$T$44, DW_AT_byte_size(0x110)
    5213              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5214                      .dwattr DW$216, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
    5215                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5216                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    5217              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5218                      .dwattr DW$217, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  105

    5219                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5220                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    5221              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5222                      .dwattr DW$218, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
    5223                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5224                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    5225              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5226                      .dwattr DW$219, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
    5227                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5228                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    5229              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5230                      .dwattr DW$220, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
    5231                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5232                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    5233              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    5234                      .dwattr DW$221, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
    5235                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5236                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    5237              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5238                      .dwattr DW$222, DW_AT_name("errorflag"), DW_AT_symbol_name("_errorflag")
    5239                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    5240                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    5241                      .dwendtag DW$T$44
    5242              
    5243              
    5244              DW$T$46 .dwtag  DW_TAG_structure_type
    5245                      .dwattr DW$T$46, DW_AT_name("tag_slavecmdstruct")
    5246                      .dwattr DW$T$46, DW_AT_byte_size(0x48)
    5247              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5248                      .dwattr DW$223, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
    5249                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5250                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    5251              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5252                      .dwattr DW$224, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
    5253                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5254                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    5255              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5256                      .dwattr DW$225, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
    5257                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5258                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    5259              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5260                      .dwattr DW$226, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
    5261                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5262                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    5263              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5264                      .dwattr DW$227, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
    5265                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5266                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    5267              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    5268                      .dwattr DW$228, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
    5269                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5270                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    5271              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5272                      .dwattr DW$229, DW_AT_name("txmode"), DW_AT_symbol_name("_txmode")
    5273                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  106

    5274                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    5275              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5276                      .dwattr DW$230, DW_AT_name("slavelost"), DW_AT_symbol_name("_slavelost")
    5277                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5278                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    5279              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5280                      .dwattr DW$231, DW_AT_name("slavenotready"), DW_AT_symbol_name("_slavenotready")
    5281                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    5282                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    5283                      .dwendtag DW$T$46
    5284              
    5285              
    5286              DW$T$48 .dwtag  DW_TAG_structure_type
    5287                      .dwattr DW$T$48, DW_AT_name("tag_reprogramstruct")
    5288                      .dwattr DW$T$48, DW_AT_byte_size(0x10)
    5289              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    5290                      .dwattr DW$232, DW_AT_name("spi"), DW_AT_symbol_name("_spi")
    5291                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5292                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    5293              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5294                      .dwattr DW$233, DW_AT_name("programkey"), DW_AT_symbol_name("_programkey")
    5295                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5296                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    5297              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5298                      .dwattr DW$234, DW_AT_name("reprogramnow"), DW_AT_symbol_name("_reprogramnow")
    5299                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5300                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    5301              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5302                      .dwattr DW$235, DW_AT_name("slavecmdok"), DW_AT_symbol_name("_slavecmdok")
    5303                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5304                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    5305              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5306                      .dwattr DW$236, DW_AT_name("slavestatus"), DW_AT_symbol_name("_slavestatus")
    5307                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5308                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    5309              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5310                      .dwattr DW$237, DW_AT_name("slavetx"), DW_AT_symbol_name("_slavetx")
    5311                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5312                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    5313              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5314                      .dwattr DW$238, DW_AT_name("slaverx"), DW_AT_symbol_name("_slaverx")
    5315                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5316                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    5317              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5318                      .dwattr DW$239, DW_AT_name("slaveset"), DW_AT_symbol_name("_slaveset")
    5319                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5320                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    5321                      .dwendtag DW$T$48
    5322              
    5323              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    5324                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5325                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    5326              
    5327              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    5328                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  107

    5329                      .dwattr DW$T$26, DW_AT_byte_size(0x8c)
    5330              DW$240  .dwtag  DW_TAG_subrange_type
    5331                      .dwattr DW$240, DW_AT_upper_bound(0x8b)
    5332                      .dwendtag DW$T$26
    5333              
    5334              
    5335              DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    5336                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    5337                      .dwattr DW$T$31, DW_AT_byte_size(0x0e)
    5338              DW$241  .dwtag  DW_TAG_subrange_type
    5339                      .dwattr DW$241, DW_AT_upper_bound(0x0d)
    5340                      .dwendtag DW$T$31
    5341              
    5342              
    5343              DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    5344                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    5345                      .dwattr DW$T$45, DW_AT_byte_size(0x40)
    5346              DW$242  .dwtag  DW_TAG_subrange_type
    5347                      .dwattr DW$242, DW_AT_upper_bound(0x3f)
    5348                      .dwendtag DW$T$45
    5349              
    5350              
    5351              DW$T$21 .dwtag  DW_TAG_structure_type
    5352                      .dwattr DW$T$21, DW_AT_name("taggpaport")
    5353                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    5354              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5355                      .dwattr DW$243, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    5356                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5357                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    5358                      .dwendtag DW$T$21
    5359              
    5360              
    5361              DW$T$24 .dwtag  DW_TAG_structure_type
    5362                      .dwattr DW$T$24, DW_AT_name("taggpdport")
    5363                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    5364              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5365                      .dwattr DW$244, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    5366                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5367                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5368                      .dwendtag DW$T$24
    5369              
    5370              
    5371              DW$T$29 .dwtag  DW_TAG_structure_type
    5372                      .dwattr DW$T$29, DW_AT_byte_size(0x02)
    5373              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5374                      .dwattr DW$245, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    5375                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5376                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    5377              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5378                      .dwattr DW$246, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    5379                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5380                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    5381                      .dwendtag DW$T$29
    5382              
    5383              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  108

    5384              DW$T$32 .dwtag  DW_TAG_structure_type
    5385                      .dwattr DW$T$32, DW_AT_name("tag_timers")
    5386                      .dwattr DW$T$32, DW_AT_byte_size(0x4c)
    5387              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5388                      .dwattr DW$247, DW_AT_name("update"), DW_AT_symbol_name("_update")
    5389                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5390                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    5391              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5392                      .dwattr DW$248, DW_AT_name("general"), DW_AT_symbol_name("_general")
    5393                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5394                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    5395              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5396                      .dwattr DW$249, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    5397                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5398                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5399              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5400                      .dwattr DW$250, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    5401                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5402                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5403              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5404                      .dwattr DW$251, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    5405                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5406                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5407              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5408                      .dwattr DW$252, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    5409                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5410                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5411              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5412                      .dwattr DW$253, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    5413                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5414                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5415              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5416                      .dwattr DW$254, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    5417                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5418                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5419              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5420                      .dwattr DW$255, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    5421                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5422                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5423              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5424                      .dwattr DW$256, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    5425                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5426                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5427              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5428                      .dwattr DW$257, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    5429                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5430                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5431              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5432                      .dwattr DW$258, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    5433                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5434                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5435              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5436                      .dwattr DW$259, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    5437                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5438                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  109

    5439              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5440                      .dwattr DW$260, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    5441                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5442                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5443              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5444                      .dwattr DW$261, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    5445                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5446                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5447              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5448                      .dwattr DW$262, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    5449                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5450                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5451              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5452                      .dwattr DW$263, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    5453                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5454                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5455              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5456                      .dwattr DW$264, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    5457                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    5458                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5459              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5460                      .dwattr DW$265, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    5461                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5462                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5463              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5464                      .dwattr DW$266, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    5465                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    5466                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5467              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5468                      .dwattr DW$267, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    5469                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5470                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5471              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5472                      .dwattr DW$268, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    5473                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5474                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5475              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5476                      .dwattr DW$269, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    5477                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    5478                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5479              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5480                      .dwattr DW$270, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    5481                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5482                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5483              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5484                      .dwattr DW$271, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    5485                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    5486                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5487              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5488                      .dwattr DW$272, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    5489                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5490                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5491              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5492                      .dwattr DW$273, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    5493                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  110

    5494                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5495              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5496                      .dwattr DW$274, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    5497                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5498                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5499              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5500                      .dwattr DW$275, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    5501                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    5502                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5503              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5504                      .dwattr DW$276, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    5505                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5506                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5507              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5508                      .dwattr DW$277, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    5509                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5510                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5511              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5512                      .dwattr DW$278, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    5513                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    5514                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5515              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5516                      .dwattr DW$279, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    5517                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    5518                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5519              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5520                      .dwattr DW$280, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    5521                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5522                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5523              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5524                      .dwattr DW$281, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    5525                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    5526                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5527              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5528                      .dwattr DW$282, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    5529                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5530                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5531              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5532                      .dwattr DW$283, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    5533                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    5534                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5535              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5536                      .dwattr DW$284, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    5537                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5538                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5539              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5540                      .dwattr DW$285, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    5541                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    5542                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5543              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5544                      .dwattr DW$286, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    5545                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5546                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5547              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5548                      .dwattr DW$287, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  111

    5549                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    5550                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5551              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5552                      .dwattr DW$288, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    5553                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5554                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5555              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5556                      .dwattr DW$289, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    5557                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    5558                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5559                      .dwendtag DW$T$32
    5560              
    5561              
    5562              DW$T$33 .dwtag  DW_TAG_structure_type
    5563                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
    5564              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5565                      .dwattr DW$290, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
    5566                      .dwattr DW$290, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5567                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5568                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5569              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5570                      .dwattr DW$291, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    5571                      .dwattr DW$291, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5572                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5573                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5574              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5575                      .dwattr DW$292, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
    5576                      .dwattr DW$292, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5577                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5578                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5579              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5580                      .dwattr DW$293, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
    5581                      .dwattr DW$293, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5582                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5583                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5584              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5585                      .dwattr DW$294, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    5586                      .dwattr DW$294, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    5587                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5588                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5589                      .dwendtag DW$T$33
    5590              
    5591              
    5592              DW$T$34 .dwtag  DW_TAG_structure_type
    5593                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    5594              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5595                      .dwattr DW$295, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
    5596                      .dwattr DW$295, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5597                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5598                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5599              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5600                      .dwattr DW$296, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    5601                      .dwattr DW$296, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    5602                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5603                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  112

    5604                      .dwendtag DW$T$34
    5605              
    5606              
    5607              DW$T$36 .dwtag  DW_TAG_structure_type
    5608                      .dwattr DW$T$36, DW_AT_byte_size(0x01)
    5609              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5610                      .dwattr DW$297, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    5611                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5612                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5613                      .dwendtag DW$T$36
    5614              
    5615              
    5616              DW$T$37 .dwtag  DW_TAG_structure_type
    5617                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    5618              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5619                      .dwattr DW$298, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    5620                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5621                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5622                      .dwendtag DW$T$37
    5623              
    5624              
    5625              DW$T$38 .dwtag  DW_TAG_structure_type
    5626                      .dwattr DW$T$38, DW_AT_byte_size(0x01)
    5627              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5628                      .dwattr DW$299, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    5629                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5630                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5631                      .dwendtag DW$T$38
    5632              
    5633              
    5634              DW$T$39 .dwtag  DW_TAG_structure_type
    5635                      .dwattr DW$T$39, DW_AT_byte_size(0x03)
    5636              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5637                      .dwattr DW$300, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    5638                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5639                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5640              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5641                      .dwattr DW$301, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    5642                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5643                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5644              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5645                      .dwattr DW$302, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    5646                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5647                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5648                      .dwendtag DW$T$39
    5649              
    5650              
    5651              DW$T$40 .dwtag  DW_TAG_structure_type
    5652                      .dwattr DW$T$40, DW_AT_byte_size(0x02)
    5653              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5654                      .dwattr DW$303, DW_AT_name("shortlrate"), DW_AT_symbol_name("_shortlrate")
    5655                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5656                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5657              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5658                      .dwattr DW$304, DW_AT_name("longlrate"), DW_AT_symbol_name("_longlrate")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  113

    5659                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5660                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5661                      .dwendtag DW$T$40
    5662              
    5663              
    5664              DW$T$41 .dwtag  DW_TAG_structure_type
    5665                      .dwattr DW$T$41, DW_AT_byte_size(0x10)
    5666              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5667                      .dwattr DW$305, DW_AT_name("wiorequest"), DW_AT_symbol_name("_wiorequest")
    5668                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5669                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5670              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5671                      .dwattr DW$306, DW_AT_name("wiocancelled"), DW_AT_symbol_name("_wiocancelled")
    5672                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5673                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5674              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5675                      .dwattr DW$307, DW_AT_name("wioreceived"), DW_AT_symbol_name("_wioreceived")
    5676                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5677                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5678              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5679                      .dwattr DW$308, DW_AT_name("slaverequest"), DW_AT_symbol_name("_slaverequest")
    5680                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5681                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5682              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5683                      .dwattr DW$309, DW_AT_name("slavereceived"), DW_AT_symbol_name("_slavereceived")
    5684                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5685                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5686              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5687                      .dwattr DW$310, DW_AT_name("slaveretry"), DW_AT_symbol_name("_slaveretry")
    5688                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5689                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5690              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5691                      .dwattr DW$311, DW_AT_name("pcrequest"), DW_AT_symbol_name("_pcrequest")
    5692                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5693                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5694              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5695                      .dwattr DW$312, DW_AT_name("pcreqtimeout"), DW_AT_symbol_name("_pcreqtimeout")
    5696                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5697                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5698                      .dwendtag DW$T$41
    5699              
    5700              
    5701              DW$T$47 .dwtag  DW_TAG_structure_type
    5702                      .dwattr DW$T$47, DW_AT_byte_size(0x08)
    5703              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5704                      .dwattr DW$313, DW_AT_name("programgo"), DW_AT_symbol_name("_programgo")
    5705                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5706                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5707              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5708                      .dwattr DW$314, DW_AT_name("status"), DW_AT_symbol_name("_status")
    5709                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5710                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5711              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5712                      .dwattr DW$315, DW_AT_name("erase"), DW_AT_symbol_name("_erase")
    5713                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  114

    5714                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5715              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5716                      .dwattr DW$316, DW_AT_name("address"), DW_AT_symbol_name("_address")
    5717                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5718                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5719              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5720                      .dwattr DW$317, DW_AT_name("size"), DW_AT_symbol_name("_size")
    5721                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5722                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5723                      .dwendtag DW$T$47
    5724              
    5725              
    5726              DW$T$20 .dwtag  DW_TAG_union_type
    5727                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    5728              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5729                      .dwattr DW$318, DW_AT_name("port"), DW_AT_symbol_name("_port")
    5730                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5731                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5732              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5733                      .dwattr DW$319, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    5734                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5735                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5736                      .dwendtag DW$T$20
    5737              
    5738              
    5739              DW$T$23 .dwtag  DW_TAG_union_type
    5740                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    5741              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5742                      .dwattr DW$320, DW_AT_name("port"), DW_AT_symbol_name("_port")
    5743                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5744                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5745              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    5746                      .dwattr DW$321, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    5747                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5748                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5749                      .dwendtag DW$T$23
    5750              
    5751              
    5752              DW$T$19 .dwtag  DW_TAG_structure_type
    5753                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    5754              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5755                      .dwattr DW$322, DW_AT_name("anain_select1"), DW_AT_symbol_name("_anain_select1")
    5756                      .dwattr DW$322, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5757                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5758                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5759              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5760                      .dwattr DW$323, DW_AT_name("anain_select2"), DW_AT_symbol_name("_anain_select2")
    5761                      .dwattr DW$323, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5762                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5763                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5764              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5765                      .dwattr DW$324, DW_AT_name("anain_select3"), DW_AT_symbol_name("_anain_select3")
    5766                      .dwattr DW$324, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5767                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5768                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  115

    5769              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5770                      .dwattr DW$325, DW_AT_name("program_cs"), DW_AT_symbol_name("_program_cs")
    5771                      .dwattr DW$325, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5772                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5773                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5774              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5775                      .dwattr DW$326, DW_AT_name("com_select"), DW_AT_symbol_name("_com_select")
    5776                      .dwattr DW$326, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5777                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5778                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5779              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5780                      .dwattr DW$327, DW_AT_name("s1"), DW_AT_symbol_name("_s1")
    5781                      .dwattr DW$327, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5782                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5783                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5784              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5785                      .dwattr DW$328, DW_AT_name("s2"), DW_AT_symbol_name("_s2")
    5786                      .dwattr DW$328, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5787                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5788                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5789              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5790                      .dwattr DW$329, DW_AT_name("s3"), DW_AT_symbol_name("_s3")
    5791                      .dwattr DW$329, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5792                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5793                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5794              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5795                      .dwattr DW$330, DW_AT_name("s4"), DW_AT_symbol_name("_s4")
    5796                      .dwattr DW$330, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5797                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5798                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5799              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5800                      .dwattr DW$331, DW_AT_name("s5"), DW_AT_symbol_name("_s5")
    5801                      .dwattr DW$331, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5802                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5803                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5804              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5805                      .dwattr DW$332, DW_AT_name("s6"), DW_AT_symbol_name("_s6")
    5806                      .dwattr DW$332, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5807                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5808                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5809              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5810                      .dwattr DW$333, DW_AT_name("s7"), DW_AT_symbol_name("_s7")
    5811                      .dwattr DW$333, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5812                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5813                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5814              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5815                      .dwattr DW$334, DW_AT_name("s8"), DW_AT_symbol_name("_s8")
    5816                      .dwattr DW$334, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5817                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5818                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5819              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5820                      .dwattr DW$335, DW_AT_name("s9"), DW_AT_symbol_name("_s9")
    5821                      .dwattr DW$335, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5822                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5823                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  116

    5824              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5825                      .dwattr DW$336, DW_AT_name("s10"), DW_AT_symbol_name("_s10")
    5826                      .dwattr DW$336, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    5827                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5828                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5829              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5830                      .dwattr DW$337, DW_AT_name("s11"), DW_AT_symbol_name("_s11")
    5831                      .dwattr DW$337, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    5832                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5833                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5834                      .dwendtag DW$T$19
    5835              
    5836              
    5837              DW$T$22 .dwtag  DW_TAG_structure_type
    5838                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    5839              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5840                      .dwattr DW$338, DW_AT_name("modeswitch"), DW_AT_symbol_name("_modeswitch")
    5841                      .dwattr DW$338, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5842                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5843                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5844              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5845                      .dwattr DW$339, DW_AT_name("led1"), DW_AT_symbol_name("_led1")
    5846                      .dwattr DW$339, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5847                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5848                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5849              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5850                      .dwattr DW$340, DW_AT_name("bit2"), DW_AT_symbol_name("_bit2")
    5851                      .dwattr DW$340, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5852                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5853                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5854              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5855                      .dwattr DW$341, DW_AT_name("bit3"), DW_AT_symbol_name("_bit3")
    5856                      .dwattr DW$341, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5857                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5858                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5859              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5860                      .dwattr DW$342, DW_AT_name("bit4"), DW_AT_symbol_name("_bit4")
    5861                      .dwattr DW$342, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5862                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5863                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5864              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5865                      .dwattr DW$343, DW_AT_name("ccselect1"), DW_AT_symbol_name("_ccselect1")
    5866                      .dwattr DW$343, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5867                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5868                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5869              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5870                      .dwattr DW$344, DW_AT_name("ccselect2"), DW_AT_symbol_name("_ccselect2")
    5871                      .dwattr DW$344, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5872                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5873                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5874              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5875                      .dwattr DW$345, DW_AT_name("bit7"), DW_AT_symbol_name("_bit7")
    5876                      .dwattr DW$345, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5877                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5878                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:27 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
reprog.asm                                                           PAGE  117

    5879              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5880                      .dwattr DW$346, DW_AT_name("bit8"), DW_AT_symbol_name("_bit8")
    5881                      .dwattr DW$346, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5882                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5883                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5884              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5885                      .dwattr DW$347, DW_AT_name("bit9"), DW_AT_symbol_name("_bit9")
    5886                      .dwattr DW$347, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5887                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5888                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5889              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5890                      .dwattr DW$348, DW_AT_name("bit10"), DW_AT_symbol_name("_bit10")
    5891                      .dwattr DW$348, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5892                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5893                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5894              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5895                      .dwattr DW$349, DW_AT_name("bit11"), DW_AT_symbol_name("_bit11")
    5896                      .dwattr DW$349, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5897                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5898                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    5899              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5900                      .dwattr DW$350, DW_AT_name("bit12"), DW_AT_symbol_name("_bit12")
    5901                      .dwattr DW$350, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5902                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5903                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5904              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5905                      .dwattr DW$351, DW_AT_name("bit13"), DW_AT_symbol_name("_bit13")
    5906                      .dwattr DW$351, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5907                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5908                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
