TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Sep 14 09:00:58 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("sci.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("NOPDelay"), DW_AT_symbol_name("_NOPDelay")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)

    1996                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
    1997              DW$81   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1998                      .dwendtag DW$T$71
    1999              
    2000              
    2001              DW$T$72 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    2002                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    2003              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2004                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2005                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2006              DW$T$49 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
    2007                      .dwattr DW$T$49, DW_AT_address_class(0x16)
    2008              
    2009              DW$T$80 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
    2010                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    2011              DW$82   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2012                      .dwendtag DW$T$80
    2013              
    2014              DW$83   .dwtag  DW_TAG_far_type
    2015                      .dwattr DW$83, DW_AT_type(*DW$T$87)
    2016              DW$T$88 .dwtag  DW_TAG_volatile_type
    2017                      .dwattr DW$T$88, DW_AT_type(*DW$83)
    2018              DW$84   .dwtag  DW_TAG_far_type
    2019                      .dwattr DW$84, DW_AT_type(*DW$T$91)
    2020              DW$T$92 .dwtag  DW_TAG_volatile_type
    2021                      .dwattr DW$T$92, DW_AT_type(*DW$84)
    2022              DW$85   .dwtag  DW_TAG_far_type
    2023                      .dwattr DW$85, DW_AT_type(*DW$T$95)
    2024              DW$T$96 .dwtag  DW_TAG_volatile_type
    2025                      .dwattr DW$T$96, DW_AT_type(*DW$85)
    2026              DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$29)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   45

    2027                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    2028              DW$T$100        .dwtag  DW_TAG_typedef, DW_AT_name("safestruct2struct"), DW_AT_type(*DW$T$42)
    2029                      .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    2030              DW$86   .dwtag  DW_TAG_far_type
    2031                      .dwattr DW$86, DW_AT_type(*DW$T$101)
    2032              DW$T$102        .dwtag  DW_TAG_volatile_type
    2033                      .dwattr DW$T$102, DW_AT_type(*DW$86)
    2034              DW$T$104        .dwtag  DW_TAG_typedef, DW_AT_name("PCCmdStruct"), DW_AT_type(*DW$T$46)
    2035                      .dwattr DW$T$104, DW_AT_language(DW_LANG_C)
    2036              DW$87   .dwtag  DW_TAG_far_type
    2037                      .dwattr DW$87, DW_AT_type(*DW$T$105)
    2038              DW$T$106        .dwtag  DW_TAG_volatile_type
    2039                      .dwattr DW$T$106, DW_AT_type(*DW$87)
    2040              DW$T$51 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    2041                      .dwattr DW$T$51, DW_AT_encoding(DW_ATE_signed_char)
    2042                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    2043              DW$T$65 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
    2044                      .dwattr DW$T$65, DW_AT_address_class(0x16)
    2045              
    2046              DW$T$110        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$51)
    2047                      .dwattr DW$T$110, DW_AT_language(DW_LANG_C)
    2048              DW$88   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$51)
    2049                      .dwendtag DW$T$110
    2050              
    2051              
    2052              DW$T$111        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$51)
    2053                      .dwattr DW$T$111, DW_AT_language(DW_LANG_C)
    2054              DW$T$113        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadA"), DW_AT_type(*DW$T$52)
    2055                      .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
    2056              DW$T$115        .dwtag  DW_TAG_typedef, DW_AT_name("uartwrite"), DW_AT_type(*DW$T$55)
    2057                      .dwattr DW$T$115, DW_AT_language(DW_LANG_C)
    2058              DW$T$117        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadB"), DW_AT_type(*DW$T$56)
    2059                      .dwattr DW$T$117, DW_AT_language(DW_LANG_C)
    2060              DW$T$119        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadC"), DW_AT_type(*DW$T$58)
    2061                      .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
    2062              DW$T$121        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadD"), DW_AT_type(*DW$T$60)
    2063                      .dwattr DW$T$121, DW_AT_language(DW_LANG_C)
    2064              DW$T$87 .dwtag  DW_TAG_typedef, DW_AT_name("gpaport"), DW_AT_type(*DW$T$21)
    2065                      .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    2066              DW$T$91 .dwtag  DW_TAG_typedef, DW_AT_name("gpbport"), DW_AT_type(*DW$T$24)
    2067                      .dwattr DW$T$91, DW_AT_language(DW_LANG_C)
    2068              DW$T$95 .dwtag  DW_TAG_typedef, DW_AT_name("gpfport"), DW_AT_type(*DW$T$27)
    2069                      .dwattr DW$T$95, DW_AT_language(DW_LANG_C)
    2070              
    2071              DW$T$29 .dwtag  DW_TAG_structure_type
    2072                      .dwattr DW$T$29, DW_AT_name("tag_settingsstruct")
    2073                      .dwattr DW$T$29, DW_AT_byte_size(0x24)
    2074              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2075                      .dwattr DW$89, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    2076                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2078              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2079                      .dwattr DW$90, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    2080                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2081                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   46

    2082              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2083                      .dwattr DW$91, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    2084                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2085                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2086              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2087                      .dwattr DW$92, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    2088                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2089                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2090              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2091                      .dwattr DW$93, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    2092                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2093                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2094              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2095                      .dwattr DW$94, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    2096                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2097                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2098              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2099                      .dwattr DW$95, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    2100                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2101                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2102              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2103                      .dwattr DW$96, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    2104                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2105                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2106              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2107                      .dwattr DW$97, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    2108                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2109                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2110              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2111                      .dwattr DW$98, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    2112                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2113                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2114              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2115                      .dwattr DW$99, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    2116                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2117                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2118              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2119                      .dwattr DW$100, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    2120                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2121                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2122              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2123                      .dwattr DW$101, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    2124                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2125                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2126              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2127                      .dwattr DW$102, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    2128                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2129                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2130              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2131                      .dwattr DW$103, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    2132                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2133                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2134              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2135                      .dwattr DW$104, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    2136                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   47

    2137                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2138              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2139                      .dwattr DW$105, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    2140                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2141                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2142              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2143                      .dwattr DW$106, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    2144                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2145                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2146              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2147                      .dwattr DW$107, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    2148                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2149                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2150              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2151                      .dwattr DW$108, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    2152                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2153                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2154              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2155                      .dwattr DW$109, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    2156                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2157                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2158              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2159                      .dwattr DW$110, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    2160                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2161                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2162              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2163                      .dwattr DW$111, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    2164                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2165                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2166              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2167                      .dwattr DW$112, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    2168                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2169                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2170              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2171                      .dwattr DW$113, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    2172                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2173                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2174              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2175                      .dwattr DW$114, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2176                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2177                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2178              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2179                      .dwattr DW$115, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    2180                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2181                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2182              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2183                      .dwattr DW$116, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2184                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2185                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2186              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2187                      .dwattr DW$117, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2188                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2189                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2190              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2191                      .dwattr DW$118, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   48

    2192                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2193                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2194              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2195                      .dwattr DW$119, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    2196                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2197                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2198              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    2199                      .dwattr DW$120, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    2200                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2201                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2202              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2203                      .dwattr DW$121, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    2204                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2205                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2206              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2207                      .dwattr DW$122, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    2208                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2209                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2210              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2211                      .dwattr DW$123, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2212                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2213                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2214                      .dwendtag DW$T$29
    2215              
    2216              
    2217              DW$T$42 .dwtag  DW_TAG_structure_type
    2218                      .dwattr DW$T$42, DW_AT_name("tag_safestruct2struct")
    2219                      .dwattr DW$T$42, DW_AT_byte_size(0x1e)
    2220              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2221                      .dwattr DW$124, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    2222                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2223                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2224              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    2225                      .dwattr DW$125, DW_AT_name("log"), DW_AT_symbol_name("_log")
    2226                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2227                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2228              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2229                      .dwattr DW$126, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
    2230                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2231                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2232              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2233                      .dwattr DW$127, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    2234                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2235                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2236              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2237                      .dwattr DW$128, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    2238                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2239                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2240              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2241                      .dwattr DW$129, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
    2242                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2243                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2244              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2245                      .dwattr DW$130, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
    2246                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   49

    2247                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2248              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    2249                      .dwattr DW$131, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
    2250                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2251                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2252              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    2253                      .dwattr DW$132, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    2254                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2255                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2256              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    2257                      .dwattr DW$133, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    2258                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2259                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2260              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    2261                      .dwattr DW$134, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
    2262                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2263                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2264                      .dwendtag DW$T$42
    2265              
    2266              DW$T$101        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$44)
    2267                      .dwattr DW$T$101, DW_AT_language(DW_LANG_C)
    2268              
    2269              DW$T$46 .dwtag  DW_TAG_structure_type
    2270                      .dwattr DW$T$46, DW_AT_name("tag_PCCmdStruct")
    2271                      .dwattr DW$T$46, DW_AT_byte_size(0x110)
    2272              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2273                      .dwattr DW$135, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
    2274                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2276              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2277                      .dwattr DW$136, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
    2278                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2279                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2280              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2281                      .dwattr DW$137, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
    2282                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2283                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2284              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2285                      .dwattr DW$138, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
    2286                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2287                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2288              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2289                      .dwattr DW$139, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
    2290                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2291                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2292              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    2293                      .dwattr DW$140, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
    2294                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2295                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2296              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2297                      .dwattr DW$141, DW_AT_name("errorflag"), DW_AT_symbol_name("_errorflag")
    2298                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x10f]
    2299                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2300                      .dwendtag DW$T$46
    2301              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   50

    2302              DW$T$105        .dwtag  DW_TAG_typedef, DW_AT_name("sciport"), DW_AT_type(*DW$T$48)
    2303                      .dwattr DW$T$105, DW_AT_language(DW_LANG_C)
    2304              
    2305              DW$T$52 .dwtag  DW_TAG_structure_type
    2306                      .dwattr DW$T$52, DW_AT_name("tag_uartreadA")
    2307                      .dwattr DW$T$52, DW_AT_byte_size(0x96)
    2308              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2309                      .dwattr DW$142, DW_AT_name("headptr"), DW_AT_symbol_name("_headptr")
    2310                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2311                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2312              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2313                      .dwattr DW$143, DW_AT_name("tailptr"), DW_AT_symbol_name("_tailptr")
    2314                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2315                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2316              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2317                      .dwattr DW$144, DW_AT_name("eobuf"), DW_AT_symbol_name("_eobuf")
    2318                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2319                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2320              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2321                      .dwattr DW$145, DW_AT_name("charcount"), DW_AT_symbol_name("_charcount")
    2322                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2323                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2324              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2325                      .dwattr DW$146, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
    2326                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2327                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2328              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2329                      .dwattr DW$147, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    2330                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2331                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2332              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2333                      .dwattr DW$148, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    2334                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2335                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2336              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    2337                      .dwattr DW$149, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    2338                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x95]
    2339                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2340                      .dwendtag DW$T$52
    2341              
    2342              
    2343              DW$T$55 .dwtag  DW_TAG_structure_type
    2344                      .dwattr DW$T$55, DW_AT_name("tag_uartwrite")
    2345                      .dwattr DW$T$55, DW_AT_byte_size(0x0c)
    2346              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    2347                      .dwattr DW$150, DW_AT_name("headptr"), DW_AT_symbol_name("_headptr")
    2348                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2350              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    2351                      .dwattr DW$151, DW_AT_name("tailptr"), DW_AT_symbol_name("_tailptr")
    2352                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2353                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2354              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    2355                      .dwattr DW$152, DW_AT_name("eobuf"), DW_AT_symbol_name("_eobuf")
    2356                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   51

    2357                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2358              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    2359                      .dwattr DW$153, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    2360                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2361                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2362                      .dwendtag DW$T$55
    2363              
    2364              
    2365              DW$T$56 .dwtag  DW_TAG_structure_type
    2366                      .dwattr DW$T$56, DW_AT_name("tag_uartreadB")
    2367                      .dwattr DW$T$56, DW_AT_byte_size(0x96)
    2368              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2369                      .dwattr DW$154, DW_AT_name("headptr"), DW_AT_symbol_name("_headptr")
    2370                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2372              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2373                      .dwattr DW$155, DW_AT_name("tailptr"), DW_AT_symbol_name("_tailptr")
    2374                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2375                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2376              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2377                      .dwattr DW$156, DW_AT_name("eobuf"), DW_AT_symbol_name("_eobuf")
    2378                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2379                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2380              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2381                      .dwattr DW$157, DW_AT_name("charcount"), DW_AT_symbol_name("_charcount")
    2382                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2383                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2384              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2385                      .dwattr DW$158, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
    2386                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2387                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2388              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2389                      .dwattr DW$159, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    2390                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2391                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2392              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2393                      .dwattr DW$160, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    2394                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2395                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2396              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    2397                      .dwattr DW$161, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    2398                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x95]
    2399                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2400                      .dwendtag DW$T$56
    2401              
    2402              
    2403              DW$T$58 .dwtag  DW_TAG_structure_type
    2404                      .dwattr DW$T$58, DW_AT_name("tag_uartreadC")
    2405                      .dwattr DW$T$58, DW_AT_byte_size(0x68)
    2406              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2407                      .dwattr DW$162, DW_AT_name("receiveINTR"), DW_AT_symbol_name("_receiveINTR")
    2408                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2409                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2410              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2411                      .dwattr DW$163, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   52

    2412                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2413                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2414              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2415                      .dwattr DW$164, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    2416                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2417                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2418              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    2419                      .dwattr DW$165, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    2420                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2421                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2422              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    2423                      .dwattr DW$166, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    2424                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x67]
    2425                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2426                      .dwendtag DW$T$58
    2427              
    2428              
    2429              DW$T$60 .dwtag  DW_TAG_structure_type
    2430                      .dwattr DW$T$60, DW_AT_name("tag_uartreadD")
    2431                      .dwattr DW$T$60, DW_AT_byte_size(0x1e)
    2432              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2433                      .dwattr DW$167, DW_AT_name("headptr"), DW_AT_symbol_name("_headptr")
    2434                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2436              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2437                      .dwattr DW$168, DW_AT_name("tailptr"), DW_AT_symbol_name("_tailptr")
    2438                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2439                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2440              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    2441                      .dwattr DW$169, DW_AT_name("eobuf"), DW_AT_symbol_name("_eobuf")
    2442                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2443                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2444              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2445                      .dwattr DW$170, DW_AT_name("receiveINTR"), DW_AT_symbol_name("_receiveINTR")
    2446                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2447                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2448              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2449                      .dwattr DW$171, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
    2450                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2451                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2452              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2453                      .dwattr DW$172, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    2454                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2455                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2456              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    2457                      .dwattr DW$173, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    2458                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2459                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2460              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    2461                      .dwattr DW$174, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    2462                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2463                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2464                      .dwendtag DW$T$60
    2465              
    2466              DW$T$53 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   53

    2467                      .dwattr DW$T$53, DW_AT_address_class(0x16)
    2468              
    2469              DW$T$54 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    2470                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    2471                      .dwattr DW$T$54, DW_AT_byte_size(0x05)
    2472              DW$175  .dwtag  DW_TAG_subrange_type
    2473                      .dwattr DW$175, DW_AT_upper_bound(0x04)
    2474                      .dwendtag DW$T$54
    2475              
    2476              
    2477              DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2478                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    2479                      .dwattr DW$T$45, DW_AT_byte_size(0x10a)
    2480              DW$176  .dwtag  DW_TAG_subrange_type
    2481                      .dwattr DW$176, DW_AT_upper_bound(0x109)
    2482                      .dwendtag DW$T$45
    2483              
    2484              
    2485              DW$T$50 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2486                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    2487                      .dwattr DW$T$50, DW_AT_byte_size(0x8c)
    2488              DW$177  .dwtag  DW_TAG_subrange_type
    2489                      .dwattr DW$177, DW_AT_upper_bound(0x8b)
    2490                      .dwendtag DW$T$50
    2491              
    2492              
    2493              DW$T$57 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2494                      .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
    2495                      .dwattr DW$T$57, DW_AT_byte_size(0x64)
    2496              DW$178  .dwtag  DW_TAG_subrange_type
    2497                      .dwattr DW$178, DW_AT_upper_bound(0x63)
    2498                      .dwendtag DW$T$57
    2499              
    2500              
    2501              DW$T$59 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2502                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    2503                      .dwattr DW$T$59, DW_AT_byte_size(0x14)
    2504              DW$179  .dwtag  DW_TAG_subrange_type
    2505                      .dwattr DW$179, DW_AT_upper_bound(0x13)
    2506                      .dwendtag DW$T$59
    2507              
    2508              
    2509              DW$T$21 .dwtag  DW_TAG_structure_type
    2510                      .dwattr DW$T$21, DW_AT_name("taggpaport")
    2511                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    2512              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2513                      .dwattr DW$180, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2514                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2516                      .dwendtag DW$T$21
    2517              
    2518              
    2519              DW$T$24 .dwtag  DW_TAG_structure_type
    2520                      .dwattr DW$T$24, DW_AT_name("taggpbport")
    2521                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   54

    2522              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2523                      .dwattr DW$181, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2524                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2525                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2526                      .dwendtag DW$T$24
    2527              
    2528              
    2529              DW$T$27 .dwtag  DW_TAG_structure_type
    2530                      .dwattr DW$T$27, DW_AT_name("taggpfport")
    2531                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    2532              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2533                      .dwattr DW$182, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    2534                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2536                      .dwendtag DW$T$27
    2537              
    2538              
    2539              DW$T$28 .dwtag  DW_TAG_structure_type
    2540                      .dwattr DW$T$28, DW_AT_byte_size(0x02)
    2541              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2542                      .dwattr DW$183, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    2543                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2545              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2546                      .dwattr DW$184, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2547                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2548                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2549                      .dwendtag DW$T$28
    2550              
    2551              
    2552              DW$T$31 .dwtag  DW_TAG_structure_type
    2553                      .dwattr DW$T$31, DW_AT_byte_size(0x0b)
    2554              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    2555                      .dwattr DW$185, DW_AT_name("calprtzero"), DW_AT_symbol_name("_calprtzero")
    2556                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2558              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    2559                      .dwattr DW$186, DW_AT_name("calprtfullscale"), DW_AT_symbol_name("_calprtfullscale")
    2560                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2561                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2562              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2563                      .dwattr DW$187, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    2564                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2565                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2566              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2567                      .dwattr DW$188, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2568                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2569                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2570              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2571                      .dwattr DW$189, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    2572                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2573                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2574                      .dwendtag DW$T$31
    2575              
    2576              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   55

    2577              DW$T$32 .dwtag  DW_TAG_structure_type
    2578                      .dwattr DW$T$32, DW_AT_byte_size(0x03)
    2579              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2580                      .dwattr DW$190, DW_AT_name("mainrate"), DW_AT_symbol_name("_mainrate")
    2581                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2582                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2583              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2584                      .dwattr DW$191, DW_AT_name("trendrate"), DW_AT_symbol_name("_trendrate")
    2585                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2586                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2587              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2588                      .dwattr DW$192, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2589                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2590                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2591                      .dwendtag DW$T$32
    2592              
    2593              
    2594              DW$T$33 .dwtag  DW_TAG_structure_type
    2595                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
    2596              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2597                      .dwattr DW$193, DW_AT_name("address"), DW_AT_symbol_name("_address")
    2598                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2600                      .dwendtag DW$T$33
    2601              
    2602              
    2603              DW$T$34 .dwtag  DW_TAG_structure_type
    2604                      .dwattr DW$T$34, DW_AT_byte_size(0x02)
    2605              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2606                      .dwattr DW$194, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    2607                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2608                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2609              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2610                      .dwattr DW$195, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2611                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2612                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2613                      .dwendtag DW$T$34
    2614              
    2615              
    2616              DW$T$35 .dwtag  DW_TAG_structure_type
    2617                      .dwattr DW$T$35, DW_AT_byte_size(0x03)
    2618              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2619                      .dwattr DW$196, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    2620                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2621                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2622              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2623                      .dwattr DW$197, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    2624                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2625                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2626              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2627                      .dwattr DW$198, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    2628                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2629                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2630                      .dwendtag DW$T$35
    2631              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   56

    2632              
    2633              DW$T$36 .dwtag  DW_TAG_structure_type
    2634                      .dwattr DW$T$36, DW_AT_byte_size(0x01)
    2635              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2636                      .dwattr DW$199, DW_AT_name("rate"), DW_AT_symbol_name("_rate")
    2637                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2638                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2639                      .dwendtag DW$T$36
    2640              
    2641              
    2642              DW$T$37 .dwtag  DW_TAG_structure_type
    2643                      .dwattr DW$T$37, DW_AT_byte_size(0x02)
    2644              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2645                      .dwattr DW$200, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    2646                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2647                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2648              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2649                      .dwattr DW$201, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    2650                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2651                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2652                      .dwendtag DW$T$37
    2653              
    2654              
    2655              DW$T$38 .dwtag  DW_TAG_structure_type
    2656                      .dwattr DW$T$38, DW_AT_byte_size(0x04)
    2657              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2658                      .dwattr DW$202, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    2659                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2661              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2662                      .dwattr DW$203, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    2663                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2664                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2665              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2666                      .dwattr DW$204, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    2667                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2668                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2669              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2670                      .dwattr DW$205, DW_AT_name("notused4"), DW_AT_symbol_name("_notused4")
    2671                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2672                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2673                      .dwendtag DW$T$38
    2674              
    2675              
    2676              DW$T$39 .dwtag  DW_TAG_structure_type
    2677                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    2678              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2679                      .dwattr DW$206, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    2680                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2681                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2682                      .dwendtag DW$T$39
    2683              
    2684              
    2685              DW$T$40 .dwtag  DW_TAG_structure_type
    2686                      .dwattr DW$T$40, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   57

    2687              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2688                      .dwattr DW$207, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    2689                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2691                      .dwendtag DW$T$40
    2692              
    2693              
    2694              DW$T$41 .dwtag  DW_TAG_structure_type
    2695                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    2696              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2697                      .dwattr DW$208, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    2698                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2700                      .dwendtag DW$T$41
    2701              
    2702              
    2703              DW$T$44 .dwtag  DW_TAG_structure_type
    2704                      .dwattr DW$T$44, DW_AT_name("tag_timers")
    2705                      .dwattr DW$T$44, DW_AT_byte_size(0x4c)
    2706              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2707                      .dwattr DW$209, DW_AT_name("update"), DW_AT_symbol_name("_update")
    2708                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2709                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2710              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2711                      .dwattr DW$210, DW_AT_name("general"), DW_AT_symbol_name("_general")
    2712                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2713                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2714              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2715                      .dwattr DW$211, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    2716                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2717                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2718              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2719                      .dwattr DW$212, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    2720                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2721                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2722              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2723                      .dwattr DW$213, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    2724                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2725                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2726              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2727                      .dwattr DW$214, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    2728                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2729                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2730              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2731                      .dwattr DW$215, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    2732                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2733                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2734              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2735                      .dwattr DW$216, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    2736                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2737                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2738              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2739                      .dwattr DW$217, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    2740                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2741                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   58

    2742              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2743                      .dwattr DW$218, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    2744                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2745                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2746              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    2747                      .dwattr DW$219, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    2748                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2749                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2750              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    2751                      .dwattr DW$220, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    2752                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2753                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2754              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2755                      .dwattr DW$221, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    2756                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2757                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2758              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2759                      .dwattr DW$222, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    2760                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2761                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2762              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2763                      .dwattr DW$223, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    2764                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2765                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2766              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2767                      .dwattr DW$224, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2768                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2769                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2770              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2771                      .dwattr DW$225, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    2772                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2773                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2774              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2775                      .dwattr DW$226, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    2776                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2777                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2778              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2779                      .dwattr DW$227, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    2780                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2781                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2782              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2783                      .dwattr DW$228, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    2784                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2785                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2786              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2787                      .dwattr DW$229, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    2788                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2789                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2790              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2791                      .dwattr DW$230, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    2792                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2793                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2794              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2795                      .dwattr DW$231, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    2796                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   59

    2797                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2798              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2799                      .dwattr DW$232, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    2800                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2801                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2802              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2803                      .dwattr DW$233, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    2804                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2805                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2806              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2807                      .dwattr DW$234, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    2808                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2809                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2810              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2811                      .dwattr DW$235, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    2812                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2813                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2814              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2815                      .dwattr DW$236, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    2816                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2817                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2818              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2819                      .dwattr DW$237, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    2820                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2821                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2822              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2823                      .dwattr DW$238, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    2824                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2825                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2826              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2827                      .dwattr DW$239, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    2828                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2829                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2830              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2831                      .dwattr DW$240, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    2832                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2833                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2834              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2835                      .dwattr DW$241, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    2836                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    2837                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2838              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2839                      .dwattr DW$242, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    2840                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2841                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2842              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2843                      .dwattr DW$243, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    2844                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2845                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2846              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2847                      .dwattr DW$244, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    2848                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2849                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2850              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2851                      .dwattr DW$245, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   60

    2852                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2853                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2854              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2855                      .dwattr DW$246, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    2856                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2857                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2858              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2859                      .dwattr DW$247, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    2860                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2861                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2862              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2863                      .dwattr DW$248, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    2864                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2865                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2866              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2867                      .dwattr DW$249, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    2868                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2869                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2870              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2871                      .dwattr DW$250, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    2872                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2873                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2874              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2875                      .dwattr DW$251, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    2876                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2877                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2878                      .dwendtag DW$T$44
    2879              
    2880              
    2881              DW$T$48 .dwtag  DW_TAG_structure_type
    2882                      .dwattr DW$T$48, DW_AT_name("tag_sciport")
    2883                      .dwattr DW$T$48, DW_AT_byte_size(0x0e)
    2884              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2885                      .dwattr DW$252, DW_AT_name("sciccr"), DW_AT_symbol_name("_sciccr")
    2886                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2887                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2888              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2889                      .dwattr DW$253, DW_AT_name("scictl1"), DW_AT_symbol_name("_scictl1")
    2890                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2891                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2892              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2893                      .dwattr DW$254, DW_AT_name("scihbaud"), DW_AT_symbol_name("_scihbaud")
    2894                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2895                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2896              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2897                      .dwattr DW$255, DW_AT_name("scilbaud"), DW_AT_symbol_name("_scilbaud")
    2898                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2899                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2900              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2901                      .dwattr DW$256, DW_AT_name("scictl2"), DW_AT_symbol_name("_scictl2")
    2902                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2903                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2904              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2905                      .dwattr DW$257, DW_AT_name("scirxst"), DW_AT_symbol_name("_scirxst")
    2906                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   61

    2907                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2908              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2909                      .dwattr DW$258, DW_AT_name("scirxemu"), DW_AT_symbol_name("_scirxemu")
    2910                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2911                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2912              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2913                      .dwattr DW$259, DW_AT_name("scirxbuf"), DW_AT_symbol_name("_scirxbuf")
    2914                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2915                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2916              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2917                      .dwattr DW$260, DW_AT_name("dummy"), DW_AT_symbol_name("_dummy")
    2918                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2919                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2920              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2921                      .dwattr DW$261, DW_AT_name("scitxbuf"), DW_AT_symbol_name("_scitxbuf")
    2922                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2923                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2924              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2925                      .dwattr DW$262, DW_AT_name("scifftx"), DW_AT_symbol_name("_scifftx")
    2926                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2927                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2928              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2929                      .dwattr DW$263, DW_AT_name("sciffrx"), DW_AT_symbol_name("_sciffrx")
    2930                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2931                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2932              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2933                      .dwattr DW$264, DW_AT_name("sciffct"), DW_AT_symbol_name("_sciffct")
    2934                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2935                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2936              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2937                      .dwattr DW$265, DW_AT_name("scipri"), DW_AT_symbol_name("_scipri")
    2938                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2939                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2940                      .dwendtag DW$T$48
    2941              
    2942              DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("uint16"), DW_AT_type(*DW$T$9)
    2943                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    2944              
    2945              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2946                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    2947                      .dwattr DW$T$30, DW_AT_byte_size(0x04)
    2948              DW$266  .dwtag  DW_TAG_subrange_type
    2949                      .dwattr DW$266, DW_AT_upper_bound(0x03)
    2950                      .dwendtag DW$T$30
    2951              
    2952              
    2953              DW$T$43 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2954                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    2955                      .dwattr DW$T$43, DW_AT_byte_size(0x0e)
    2956              DW$267  .dwtag  DW_TAG_subrange_type
    2957                      .dwattr DW$267, DW_AT_upper_bound(0x0d)
    2958                      .dwendtag DW$T$43
    2959              
    2960              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    2961                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   62

    2962                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    2963              
    2964              DW$T$20 .dwtag  DW_TAG_union_type
    2965                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    2966              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2967                      .dwattr DW$268, DW_AT_name("port"), DW_AT_symbol_name("_port")
    2968                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2969                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2970              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2971                      .dwattr DW$269, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2972                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2973                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2974                      .dwendtag DW$T$20
    2975              
    2976              
    2977              DW$T$23 .dwtag  DW_TAG_union_type
    2978                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    2979              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2980                      .dwattr DW$270, DW_AT_name("port"), DW_AT_symbol_name("_port")
    2981                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2982                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2983              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2984                      .dwattr DW$271, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2985                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2986                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2987                      .dwendtag DW$T$23
    2988              
    2989              
    2990              DW$T$26 .dwtag  DW_TAG_union_type
    2991                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    2992              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2993                      .dwattr DW$272, DW_AT_name("port"), DW_AT_symbol_name("_port")
    2994                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2995                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2996              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2997                      .dwattr DW$273, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2998                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2999                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3000                      .dwendtag DW$T$26
    3001              
    3002              DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    3003                      .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3004                      .dwattr DW$T$9, DW_AT_byte_size(0x01)
    3005              
    3006              DW$T$19 .dwtag  DW_TAG_structure_type
    3007                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    3008              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3009                      .dwattr DW$274, DW_AT_name("anain_select1"), DW_AT_symbol_name("_anain_select1")
    3010                      .dwattr DW$274, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3011                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3012                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3013              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3014                      .dwattr DW$275, DW_AT_name("anain_select2"), DW_AT_symbol_name("_anain_select2")
    3015                      .dwattr DW$275, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3016                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   63

    3017                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3018              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3019                      .dwattr DW$276, DW_AT_name("anain_select3"), DW_AT_symbol_name("_anain_select3")
    3020                      .dwattr DW$276, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3021                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3022                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3023              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3024                      .dwattr DW$277, DW_AT_name("program_cs"), DW_AT_symbol_name("_program_cs")
    3025                      .dwattr DW$277, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3026                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3027                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3028              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3029                      .dwattr DW$278, DW_AT_name("com_select"), DW_AT_symbol_name("_com_select")
    3030                      .dwattr DW$278, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3031                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3032                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3033              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3034                      .dwattr DW$279, DW_AT_name("s1"), DW_AT_symbol_name("_s1")
    3035                      .dwattr DW$279, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3036                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3037                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3038              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3039                      .dwattr DW$280, DW_AT_name("s2"), DW_AT_symbol_name("_s2")
    3040                      .dwattr DW$280, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3041                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3042                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3043              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3044                      .dwattr DW$281, DW_AT_name("s3"), DW_AT_symbol_name("_s3")
    3045                      .dwattr DW$281, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3046                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3047                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3048              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3049                      .dwattr DW$282, DW_AT_name("s4"), DW_AT_symbol_name("_s4")
    3050                      .dwattr DW$282, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3051                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3052                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3053              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3054                      .dwattr DW$283, DW_AT_name("s5"), DW_AT_symbol_name("_s5")
    3055                      .dwattr DW$283, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3056                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3057                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3058              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3059                      .dwattr DW$284, DW_AT_name("s6"), DW_AT_symbol_name("_s6")
    3060                      .dwattr DW$284, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3061                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3062                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3063              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3064                      .dwattr DW$285, DW_AT_name("s7"), DW_AT_symbol_name("_s7")
    3065                      .dwattr DW$285, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3066                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3067                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3068              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3069                      .dwattr DW$286, DW_AT_name("s8"), DW_AT_symbol_name("_s8")
    3070                      .dwattr DW$286, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3071                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   64

    3072                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3073              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3074                      .dwattr DW$287, DW_AT_name("s9"), DW_AT_symbol_name("_s9")
    3075                      .dwattr DW$287, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3076                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3077                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3078              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3079                      .dwattr DW$288, DW_AT_name("s10"), DW_AT_symbol_name("_s10")
    3080                      .dwattr DW$288, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3081                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3082                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3083              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3084                      .dwattr DW$289, DW_AT_name("s11"), DW_AT_symbol_name("_s11")
    3085                      .dwattr DW$289, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3086                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3087                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3088                      .dwendtag DW$T$19
    3089              
    3090              
    3091              DW$T$22 .dwtag  DW_TAG_structure_type
    3092                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    3093              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3094                      .dwattr DW$290, DW_AT_name("s12"), DW_AT_symbol_name("_s12")
    3095                      .dwattr DW$290, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3096                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3097                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3098              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3099                      .dwattr DW$291, DW_AT_name("s13"), DW_AT_symbol_name("_s13")
    3100                      .dwattr DW$291, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3101                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3102                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3103              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3104                      .dwattr DW$292, DW_AT_name("s14"), DW_AT_symbol_name("_s14")
    3105                      .dwattr DW$292, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3106                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3107                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3108              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3109                      .dwattr DW$293, DW_AT_name("s15"), DW_AT_symbol_name("_s15")
    3110                      .dwattr DW$293, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3111                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3112                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3113              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3114                      .dwattr DW$294, DW_AT_name("s16"), DW_AT_symbol_name("_s16")
    3115                      .dwattr DW$294, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3116                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3117                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3118              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3119                      .dwattr DW$295, DW_AT_name("s17"), DW_AT_symbol_name("_s17")
    3120                      .dwattr DW$295, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3121                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3123              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3124                      .dwattr DW$296, DW_AT_name("s18"), DW_AT_symbol_name("_s18")
    3125                      .dwattr DW$296, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3126                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Sep 14 09:00:58 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sci.asm                                                              PAGE   65

    3127                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3128              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3129                      .dwattr DW$297, DW_AT_name("s19"), DW_AT_symbol_name("_s19")
    3130                      .dwattr DW$297, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3131                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3132                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3133              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3134                      .dwattr DW$298, DW_AT_name("disp485txen"), DW_AT_symbol_name("_disp485txen")
    3135                      .dwattr DW$298, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3136                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3137                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3138              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3139                      .dwattr DW$299, DW_AT_name("disp485rxen"), DW_AT_symbol_name("_disp485rxen")
    3140                      .dwattr DW$299, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3141                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3142                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3143              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3144                      .dwattr DW$300, DW_AT_name("gpio1"), DW_AT_symbol_name("_gpio1")
    3145                      .dwattr DW$300, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3146                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3147                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3148              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3149                      .dwattr DW$301, DW_AT_name("gpio2"), DW_AT_symbol_name("_gpio2")
    3150                      .dwattr DW$301, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
