TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:29 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("sdcard.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

   12672              DW$T$346        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$345)
   12673                      .dwattr DW$T$346, DW_AT_language(DW_LANG_C)
   12674                      .dwattr DW$T$346, DW_AT_byte_size(0x118)
   12675              DW$565  .dwtag  DW_TAG_subrange_type
   12676                      .dwattr DW$565, DW_AT_upper_bound(0x1b)
   12677                      .dwendtag DW$T$346
   12678              
   12679              DW$T$349        .dwtag  DW_TAG_typedef, DW_AT_name("damagemonstruct"), DW_AT_type(*DW$T$79)
   12680                      .dwattr DW$T$349, DW_AT_language(DW_LANG_C)
   12681              DW$T$351        .dwtag  DW_TAG_typedef, DW_AT_name("dynamicalarmsstruct"), DW_AT_type(*DW$T$80)
   12682                      .dwattr DW$T$351, DW_AT_language(DW_LANG_C)
   12683              DW$T$352        .dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$83)
   12684                      .dwattr DW$T$352, DW_AT_language(DW_LANG_C)
   12685              DW$T$354        .dwtag  DW_TAG_typedef, DW_AT_name("wiosettingsstruct"), DW_AT_type(*DW$T$84)
   12686                      .dwattr DW$T$354, DW_AT_language(DW_LANG_C)
   12687              DW$T$356        .dwtag  DW_TAG_typedef, DW_AT_name("slemsettingsstruct"), DW_AT_type(*DW$T$85)
   12688                      .dwattr DW$T$356, DW_AT_language(DW_LANG_C)
   12689              DW$T$358        .dwtag  DW_TAG_typedef, DW_AT_name("slemstruct"), DW_AT_type(*DW$T$87)
   12690                      .dwattr DW$T$358, DW_AT_language(DW_LANG_C)
   12691              DW$T$359        .dwtag  DW_TAG_typedef, DW_AT_name("cppsettingsstruct"), DW_AT_type(*DW$T$88)
   12692                      .dwattr DW$T$359, DW_AT_language(DW_LANG_C)
   12693              DW$T$361        .dwtag  DW_TAG_typedef, DW_AT_name("sensorMovingstruct"), DW_AT_type(*DW$T$89)
   12694                      .dwattr DW$T$361, DW_AT_language(DW_LANG_C)
   12695              DW$T$363        .dwtag  DW_TAG_typedef, DW_AT_name("dcmodechecksstruct"), DW_AT_type(*DW$T$93)
   12696                      .dwattr DW$T$363, DW_AT_language(DW_LANG_C)
   12697              DW$566  .dwtag  DW_TAG_far_type
   12698                      .dwattr DW$566, DW_AT_type(*DW$T$365)
   12699              DW$T$366        .dwtag  DW_TAG_volatile_type
   12700                      .dwattr DW$T$366, DW_AT_type(*DW$566)
   12701              DW$T$369        .dwtag  DW_TAG_typedef, DW_AT_name("sdfilestruct"), DW_AT_type(*DW$T$111)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  264

   12702                      .dwattr DW$T$369, DW_AT_language(DW_LANG_C)
   12703              DW$T$371        .dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$113)
   12704                      .dwattr DW$T$371, DW_AT_language(DW_LANG_C)
   12705              DW$T$373        .dwtag  DW_TAG_typedef, DW_AT_name("shorttermlogstruct"), DW_AT_type(*DW$T$119)
   12706                      .dwattr DW$T$373, DW_AT_language(DW_LANG_C)
   12707              DW$T$375        .dwtag  DW_TAG_typedef, DW_AT_name("longtermlogstruct"), DW_AT_type(*DW$T$121)
   12708                      .dwattr DW$T$375, DW_AT_language(DW_LANG_C)
   12709              DW$T$377        .dwtag  DW_TAG_typedef, DW_AT_name("asciilogstruct"), DW_AT_type(*DW$T$123)
   12710                      .dwattr DW$T$377, DW_AT_language(DW_LANG_C)
   12711              DW$T$378        .dwtag  DW_TAG_typedef, DW_AT_name("mansdstruct"), DW_AT_type(*DW$T$125)
   12712                      .dwattr DW$T$378, DW_AT_language(DW_LANG_C)
   12713              DW$567  .dwtag  DW_TAG_far_type
   12714                      .dwattr DW$567, DW_AT_type(*DW$T$380)
   12715              DW$T$381        .dwtag  DW_TAG_const_type
   12716                      .dwattr DW$T$381, DW_AT_type(*DW$567)
   12717              DW$568  .dwtag  DW_TAG_far_type
   12718              DW$T$131        .dwtag  DW_TAG_const_type
   12719                      .dwattr DW$T$131, DW_AT_type(*DW$568)
   12720              DW$T$167        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$166)
   12721                      .dwattr DW$T$167, DW_AT_address_class(0x16)
   12722              DW$T$164        .dwtag  DW_TAG_typedef, DW_AT_name("F_FUNC"), DW_AT_type(*DW$T$39)
   12723                      .dwattr DW$T$164, DW_AT_language(DW_LANG_C)
   12724              DW$T$40 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
   12725                      .dwattr DW$T$40, DW_AT_encoding(DW_ATE_signed_char)
   12726                      .dwattr DW$T$40, DW_AT_byte_size(0x01)
   12727              DW$569  .dwtag  DW_TAG_far_type
   12728                      .dwattr DW$569, DW_AT_type(*DW$T$40)
   12729              DW$T$148        .dwtag  DW_TAG_const_type
   12730                      .dwattr DW$T$148, DW_AT_type(*DW$569)
   12731              
   12732              DW$T$306        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$148)
   12733                      .dwattr DW$T$306, DW_AT_language(DW_LANG_C)
   12734                      .dwattr DW$T$306, DW_AT_byte_size(0x32)
   12735              DW$570  .dwtag  DW_TAG_subrange_type
   12736                      .dwattr DW$570, DW_AT_upper_bound(0x31)
   12737                      .dwendtag DW$T$306
   12738              
   12739              DW$T$308        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$307)
   12740                      .dwattr DW$T$308, DW_AT_address_class(0x16)
   12741              
   12742              DW$T$48 .dwtag  DW_TAG_structure_type
   12743                      .dwattr DW$T$48, DW_AT_byte_size(0x52)
   12744              DW$571  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
   12745                      .dwattr DW$571, DW_AT_name("filename"), DW_AT_symbol_name("_filename")
   12746                      .dwattr DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12747                      .dwattr DW$571, DW_AT_accessibility(DW_ACCESS_public)
   12748              DW$572  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
   12749                      .dwattr DW$572, DW_AT_name("name"), DW_AT_symbol_name("_name")
   12750                      .dwattr DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12751                      .dwattr DW$572, DW_AT_accessibility(DW_ACCESS_public)
   12752              DW$573  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
   12753                      .dwattr DW$573, DW_AT_name("ext"), DW_AT_symbol_name("_ext")
   12754                      .dwattr DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12755                      .dwattr DW$573, DW_AT_accessibility(DW_ACCESS_public)
   12756              DW$574  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  265

   12757                      .dwattr DW$574, DW_AT_name("attr"), DW_AT_symbol_name("_attr")
   12758                      .dwattr DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
   12759                      .dwattr DW$574, DW_AT_accessibility(DW_ACCESS_public)
   12760              DW$575  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   12761                      .dwattr DW$575, DW_AT_name("ctime"), DW_AT_symbol_name("_ctime")
   12762                      .dwattr DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   12763                      .dwattr DW$575, DW_AT_accessibility(DW_ACCESS_public)
   12764              DW$576  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
   12765                      .dwattr DW$576, DW_AT_name("cdate"), DW_AT_symbol_name("_cdate")
   12766                      .dwattr DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   12767                      .dwattr DW$576, DW_AT_accessibility(DW_ACCESS_public)
   12768              DW$577  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   12769                      .dwattr DW$577, DW_AT_name("cluster"), DW_AT_symbol_name("_cluster")
   12770                      .dwattr DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   12771                      .dwattr DW$577, DW_AT_accessibility(DW_ACCESS_public)
   12772              DW$578  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
   12773                      .dwattr DW$578, DW_AT_name("filesize"), DW_AT_symbol_name("_filesize")
   12774                      .dwattr DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   12775                      .dwattr DW$578, DW_AT_accessibility(DW_ACCESS_public)
   12776              DW$579  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
   12777                      .dwattr DW$579, DW_AT_name("findfsname"), DW_AT_symbol_name("_findfsname")
   12778                      .dwattr DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   12779                      .dwattr DW$579, DW_AT_accessibility(DW_ACCESS_public)
   12780              DW$580  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
   12781                      .dwattr DW$580, DW_AT_name("pos"), DW_AT_symbol_name("_pos")
   12782                      .dwattr DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   12783                      .dwattr DW$580, DW_AT_accessibility(DW_ACCESS_public)
   12784                      .dwendtag DW$T$48
   12785              
   12786              DW$T$106        .dwtag  DW_TAG_typedef, DW_AT_name("F_FILE"), DW_AT_type(*DW$T$49)
   12787                      .dwattr DW$T$106, DW_AT_language(DW_LANG_C)
   12788              DW$T$75 .dwtag  DW_TAG_typedef, DW_AT_name("status1struct"), DW_AT_type(*DW$T$50)
   12789                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
   12790              
   12791              DW$T$51 .dwtag  DW_TAG_structure_type
   12792                      .dwattr DW$T$51, DW_AT_name("tag_eventlogvarsstruct")
   12793                      .dwattr DW$T$51, DW_AT_byte_size(0x03)
   12794              DW$581  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12795                      .dwattr DW$581, DW_AT_name("eventlogid"), DW_AT_symbol_name("_eventlogid")
   12796                      .dwattr DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12797                      .dwattr DW$581, DW_AT_accessibility(DW_ACCESS_public)
   12798              DW$582  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12799                      .dwattr DW$582, DW_AT_name("msgqueue"), DW_AT_symbol_name("_msgqueue")
   12800                      .dwattr DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12801                      .dwattr DW$582, DW_AT_accessibility(DW_ACCESS_public)
   12802              DW$583  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12803                      .dwattr DW$583, DW_AT_name("eventlogwrapflag"), DW_AT_symbol_name("_eventlogwrapflag")
   12804                      .dwattr DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12805                      .dwattr DW$583, DW_AT_accessibility(DW_ACCESS_public)
   12806                      .dwendtag DW$T$51
   12807              
   12808              
   12809              DW$T$53 .dwtag  DW_TAG_structure_type
   12810                      .dwattr DW$T$53, DW_AT_name("tag_settingsstruct")
   12811                      .dwattr DW$T$53, DW_AT_byte_size(0x24)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  266

   12812              DW$584  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12813                      .dwattr DW$584, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
   12814                      .dwattr DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12815                      .dwattr DW$584, DW_AT_accessibility(DW_ACCESS_public)
   12816              DW$585  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12817                      .dwattr DW$585, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
   12818                      .dwattr DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12819                      .dwattr DW$585, DW_AT_accessibility(DW_ACCESS_public)
   12820              DW$586  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12821                      .dwattr DW$586, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
   12822                      .dwattr DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12823                      .dwattr DW$586, DW_AT_accessibility(DW_ACCESS_public)
   12824              DW$587  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12825                      .dwattr DW$587, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
   12826                      .dwattr DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12827                      .dwattr DW$587, DW_AT_accessibility(DW_ACCESS_public)
   12828              DW$588  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12829                      .dwattr DW$588, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
   12830                      .dwattr DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12831                      .dwattr DW$588, DW_AT_accessibility(DW_ACCESS_public)
   12832              DW$589  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12833                      .dwattr DW$589, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
   12834                      .dwattr DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12835                      .dwattr DW$589, DW_AT_accessibility(DW_ACCESS_public)
   12836              DW$590  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12837                      .dwattr DW$590, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
   12838                      .dwattr DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12839                      .dwattr DW$590, DW_AT_accessibility(DW_ACCESS_public)
   12840              DW$591  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12841                      .dwattr DW$591, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
   12842                      .dwattr DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12843                      .dwattr DW$591, DW_AT_accessibility(DW_ACCESS_public)
   12844              DW$592  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12845                      .dwattr DW$592, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
   12846                      .dwattr DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12847                      .dwattr DW$592, DW_AT_accessibility(DW_ACCESS_public)
   12848              DW$593  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12849                      .dwattr DW$593, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
   12850                      .dwattr DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   12851                      .dwattr DW$593, DW_AT_accessibility(DW_ACCESS_public)
   12852              DW$594  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12853                      .dwattr DW$594, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
   12854                      .dwattr DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12855                      .dwattr DW$594, DW_AT_accessibility(DW_ACCESS_public)
   12856              DW$595  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12857                      .dwattr DW$595, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
   12858                      .dwattr DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   12859                      .dwattr DW$595, DW_AT_accessibility(DW_ACCESS_public)
   12860              DW$596  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12861                      .dwattr DW$596, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
   12862                      .dwattr DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12863                      .dwattr DW$596, DW_AT_accessibility(DW_ACCESS_public)
   12864              DW$597  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12865                      .dwattr DW$597, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
   12866                      .dwattr DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  267

   12867                      .dwattr DW$597, DW_AT_accessibility(DW_ACCESS_public)
   12868              DW$598  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12869                      .dwattr DW$598, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
   12870                      .dwattr DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12871                      .dwattr DW$598, DW_AT_accessibility(DW_ACCESS_public)
   12872              DW$599  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12873                      .dwattr DW$599, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
   12874                      .dwattr DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   12875                      .dwattr DW$599, DW_AT_accessibility(DW_ACCESS_public)
   12876              DW$600  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12877                      .dwattr DW$600, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
   12878                      .dwattr DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12879                      .dwattr DW$600, DW_AT_accessibility(DW_ACCESS_public)
   12880              DW$601  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12881                      .dwattr DW$601, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
   12882                      .dwattr DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   12883                      .dwattr DW$601, DW_AT_accessibility(DW_ACCESS_public)
   12884              DW$602  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12885                      .dwattr DW$602, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
   12886                      .dwattr DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12887                      .dwattr DW$602, DW_AT_accessibility(DW_ACCESS_public)
   12888              DW$603  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12889                      .dwattr DW$603, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
   12890                      .dwattr DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   12891                      .dwattr DW$603, DW_AT_accessibility(DW_ACCESS_public)
   12892              DW$604  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12893                      .dwattr DW$604, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
   12894                      .dwattr DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12895                      .dwattr DW$604, DW_AT_accessibility(DW_ACCESS_public)
   12896              DW$605  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12897                      .dwattr DW$605, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
   12898                      .dwattr DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   12899                      .dwattr DW$605, DW_AT_accessibility(DW_ACCESS_public)
   12900              DW$606  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12901                      .dwattr DW$606, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
   12902                      .dwattr DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12903                      .dwattr DW$606, DW_AT_accessibility(DW_ACCESS_public)
   12904              DW$607  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12905                      .dwattr DW$607, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
   12906                      .dwattr DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   12907                      .dwattr DW$607, DW_AT_accessibility(DW_ACCESS_public)
   12908              DW$608  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12909                      .dwattr DW$608, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
   12910                      .dwattr DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12911                      .dwattr DW$608, DW_AT_accessibility(DW_ACCESS_public)
   12912              DW$609  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12913                      .dwattr DW$609, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
   12914                      .dwattr DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   12915                      .dwattr DW$609, DW_AT_accessibility(DW_ACCESS_public)
   12916              DW$610  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12917                      .dwattr DW$610, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
   12918                      .dwattr DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   12919                      .dwattr DW$610, DW_AT_accessibility(DW_ACCESS_public)
   12920              DW$611  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12921                      .dwattr DW$611, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  268

   12922                      .dwattr DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
   12923                      .dwattr DW$611, DW_AT_accessibility(DW_ACCESS_public)
   12924              DW$612  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12925                      .dwattr DW$612, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
   12926                      .dwattr DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12927                      .dwattr DW$612, DW_AT_accessibility(DW_ACCESS_public)
   12928              DW$613  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12929                      .dwattr DW$613, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
   12930                      .dwattr DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   12931                      .dwattr DW$613, DW_AT_accessibility(DW_ACCESS_public)
   12932              DW$614  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12933                      .dwattr DW$614, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
   12934                      .dwattr DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   12935                      .dwattr DW$614, DW_AT_accessibility(DW_ACCESS_public)
   12936              DW$615  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
   12937                      .dwattr DW$615, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
   12938                      .dwattr DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
   12939                      .dwattr DW$615, DW_AT_accessibility(DW_ACCESS_public)
   12940              DW$616  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12941                      .dwattr DW$616, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
   12942                      .dwattr DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   12943                      .dwattr DW$616, DW_AT_accessibility(DW_ACCESS_public)
   12944              DW$617  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12945                      .dwattr DW$617, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
   12946                      .dwattr DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   12947                      .dwattr DW$617, DW_AT_accessibility(DW_ACCESS_public)
   12948              DW$618  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12949                      .dwattr DW$618, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
   12950                      .dwattr DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
   12951                      .dwattr DW$618, DW_AT_accessibility(DW_ACCESS_public)
   12952                      .dwendtag DW$T$53
   12953              
   12954              
   12955              DW$T$54 .dwtag  DW_TAG_structure_type
   12956                      .dwattr DW$T$54, DW_AT_name("tag_livestruct")
   12957                      .dwattr DW$T$54, DW_AT_byte_size(0x03)
   12958              DW$619  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12959                      .dwattr DW$619, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
   12960                      .dwattr DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12961                      .dwattr DW$619, DW_AT_accessibility(DW_ACCESS_public)
   12962              DW$620  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12963                      .dwattr DW$620, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
   12964                      .dwattr DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12965                      .dwattr DW$620, DW_AT_accessibility(DW_ACCESS_public)
   12966              DW$621  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12967                      .dwattr DW$621, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
   12968                      .dwattr DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12969                      .dwattr DW$621, DW_AT_accessibility(DW_ACCESS_public)
   12970                      .dwendtag DW$T$54
   12971              
   12972              
   12973              DW$T$57 .dwtag  DW_TAG_structure_type
   12974                      .dwattr DW$T$57, DW_AT_name("tag_calibrationdatetimestruct")
   12975                      .dwattr DW$T$57, DW_AT_byte_size(0x07)
   12976              DW$622  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  269

   12977                      .dwattr DW$622, DW_AT_name("calcomplete"), DW_AT_symbol_name("_calcomplete")
   12978                      .dwattr DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12979                      .dwattr DW$622, DW_AT_accessibility(DW_ACCESS_public)
   12980              DW$623  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
   12981                      .dwattr DW$623, DW_AT_name("verification"), DW_AT_symbol_name("_verification")
   12982                      .dwattr DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12983                      .dwattr DW$623, DW_AT_accessibility(DW_ACCESS_public)
   12984              DW$624  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12985                      .dwattr DW$624, DW_AT_name("chksum"), DW_AT_symbol_name("_chksum")
   12986                      .dwattr DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12987                      .dwattr DW$624, DW_AT_accessibility(DW_ACCESS_public)
   12988                      .dwendtag DW$T$57
   12989              
   12990              
   12991              DW$T$58 .dwtag  DW_TAG_structure_type
   12992                      .dwattr DW$T$58, DW_AT_name("tag_clockstruct")
   12993                      .dwattr DW$T$58, DW_AT_byte_size(0x0e)
   12994              DW$625  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12995                      .dwattr DW$625, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
   12996                      .dwattr DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12997                      .dwattr DW$625, DW_AT_accessibility(DW_ACCESS_public)
   12998              DW$626  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12999                      .dwattr DW$626, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
   13000                      .dwattr DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13001                      .dwattr DW$626, DW_AT_accessibility(DW_ACCESS_public)
   13002              DW$627  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13003                      .dwattr DW$627, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
   13004                      .dwattr DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13005                      .dwattr DW$627, DW_AT_accessibility(DW_ACCESS_public)
   13006              DW$628  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13007                      .dwattr DW$628, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
   13008                      .dwattr DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13009                      .dwattr DW$628, DW_AT_accessibility(DW_ACCESS_public)
   13010              DW$629  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13011                      .dwattr DW$629, DW_AT_name("day"), DW_AT_symbol_name("_day")
   13012                      .dwattr DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13013                      .dwattr DW$629, DW_AT_accessibility(DW_ACCESS_public)
   13014              DW$630  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13015                      .dwattr DW$630, DW_AT_name("date"), DW_AT_symbol_name("_date")
   13016                      .dwattr DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13017                      .dwattr DW$630, DW_AT_accessibility(DW_ACCESS_public)
   13018              DW$631  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13019                      .dwattr DW$631, DW_AT_name("month"), DW_AT_symbol_name("_month")
   13020                      .dwattr DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13021                      .dwattr DW$631, DW_AT_accessibility(DW_ACCESS_public)
   13022              DW$632  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13023                      .dwattr DW$632, DW_AT_name("year"), DW_AT_symbol_name("_year")
   13024                      .dwattr DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13025                      .dwattr DW$632, DW_AT_accessibility(DW_ACCESS_public)
   13026              DW$633  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13027                      .dwattr DW$633, DW_AT_name("control"), DW_AT_symbol_name("_control")
   13028                      .dwattr DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13029                      .dwattr DW$633, DW_AT_accessibility(DW_ACCESS_public)
   13030              DW$634  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   13031                      .dwattr DW$634, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  270

   13032                      .dwattr DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13033                      .dwattr DW$634, DW_AT_accessibility(DW_ACCESS_public)
   13034              DW$635  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13035                      .dwattr DW$635, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
   13036                      .dwattr DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13037                      .dwattr DW$635, DW_AT_accessibility(DW_ACCESS_public)
   13038                      .dwendtag DW$T$58
   13039              
   13040              DW$T$331        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$60)
   13041                      .dwattr DW$T$331, DW_AT_language(DW_LANG_C)
   13042              
   13043              DW$T$63 .dwtag  DW_TAG_structure_type
   13044                      .dwattr DW$T$63, DW_AT_name("tag_allsensorstruct")
   13045                      .dwattr DW$T$63, DW_AT_byte_size(0x2d)
   13046              DW$636  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13047                      .dwattr DW$636, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
   13048                      .dwattr DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13049                      .dwattr DW$636, DW_AT_accessibility(DW_ACCESS_public)
   13050              DW$637  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13051                      .dwattr DW$637, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
   13052                      .dwattr DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13053                      .dwattr DW$637, DW_AT_accessibility(DW_ACCESS_public)
   13054              DW$638  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13055                      .dwattr DW$638, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
   13056                      .dwattr DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13057                      .dwattr DW$638, DW_AT_accessibility(DW_ACCESS_public)
   13058              DW$639  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13059                      .dwattr DW$639, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
   13060                      .dwattr DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13061                      .dwattr DW$639, DW_AT_accessibility(DW_ACCESS_public)
   13062              DW$640  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13063                      .dwattr DW$640, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
   13064                      .dwattr DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13065                      .dwattr DW$640, DW_AT_accessibility(DW_ACCESS_public)
   13066              DW$641  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13067                      .dwattr DW$641, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
   13068                      .dwattr DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13069                      .dwattr DW$641, DW_AT_accessibility(DW_ACCESS_public)
   13070              DW$642  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13071                      .dwattr DW$642, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
   13072                      .dwattr DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13073                      .dwattr DW$642, DW_AT_accessibility(DW_ACCESS_public)
   13074              DW$643  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13075                      .dwattr DW$643, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
   13076                      .dwattr DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13077                      .dwattr DW$643, DW_AT_accessibility(DW_ACCESS_public)
   13078              DW$644  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13079                      .dwattr DW$644, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
   13080                      .dwattr DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13081                      .dwattr DW$644, DW_AT_accessibility(DW_ACCESS_public)
   13082              DW$645  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13083                      .dwattr DW$645, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
   13084                      .dwattr DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13085                      .dwattr DW$645, DW_AT_accessibility(DW_ACCESS_public)
   13086              DW$646  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  271

   13087                      .dwattr DW$646, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
   13088                      .dwattr DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13089                      .dwattr DW$646, DW_AT_accessibility(DW_ACCESS_public)
   13090              DW$647  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13091                      .dwattr DW$647, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
   13092                      .dwattr DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13093                      .dwattr DW$647, DW_AT_accessibility(DW_ACCESS_public)
   13094              DW$648  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13095                      .dwattr DW$648, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
   13096                      .dwattr DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13097                      .dwattr DW$648, DW_AT_accessibility(DW_ACCESS_public)
   13098              DW$649  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13099                      .dwattr DW$649, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
   13100                      .dwattr DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13101                      .dwattr DW$649, DW_AT_accessibility(DW_ACCESS_public)
   13102              DW$650  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13103                      .dwattr DW$650, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
   13104                      .dwattr DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13105                      .dwattr DW$650, DW_AT_accessibility(DW_ACCESS_public)
   13106              DW$651  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13107                      .dwattr DW$651, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
   13108                      .dwattr DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   13109                      .dwattr DW$651, DW_AT_accessibility(DW_ACCESS_public)
   13110              DW$652  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
   13111                      .dwattr DW$652, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
   13112                      .dwattr DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13113                      .dwattr DW$652, DW_AT_accessibility(DW_ACCESS_public)
   13114              DW$653  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13115                      .dwattr DW$653, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
   13116                      .dwattr DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   13117                      .dwattr DW$653, DW_AT_accessibility(DW_ACCESS_public)
   13118              DW$654  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13119                      .dwattr DW$654, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
   13120                      .dwattr DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13121                      .dwattr DW$654, DW_AT_accessibility(DW_ACCESS_public)
   13122              DW$655  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13123                      .dwattr DW$655, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
   13124                      .dwattr DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   13125                      .dwattr DW$655, DW_AT_accessibility(DW_ACCESS_public)
   13126              DW$656  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13127                      .dwattr DW$656, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
   13128                      .dwattr DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13129                      .dwattr DW$656, DW_AT_accessibility(DW_ACCESS_public)
   13130              DW$657  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
   13131                      .dwattr DW$657, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
   13132                      .dwattr DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   13133                      .dwattr DW$657, DW_AT_accessibility(DW_ACCESS_public)
   13134              DW$658  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13135                      .dwattr DW$658, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
   13136                      .dwattr DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
   13137                      .dwattr DW$658, DW_AT_accessibility(DW_ACCESS_public)
   13138              DW$659  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13139                      .dwattr DW$659, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
   13140                      .dwattr DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   13141                      .dwattr DW$659, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  272

   13142              DW$660  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13143                      .dwattr DW$660, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
   13144                      .dwattr DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
   13145                      .dwattr DW$660, DW_AT_accessibility(DW_ACCESS_public)
   13146              DW$661  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13147                      .dwattr DW$661, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
   13148                      .dwattr DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   13149                      .dwattr DW$661, DW_AT_accessibility(DW_ACCESS_public)
   13150              DW$662  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13151                      .dwattr DW$662, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
   13152                      .dwattr DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   13153                      .dwattr DW$662, DW_AT_accessibility(DW_ACCESS_public)
   13154              DW$663  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13155                      .dwattr DW$663, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
   13156                      .dwattr DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   13157                      .dwattr DW$663, DW_AT_accessibility(DW_ACCESS_public)
   13158              DW$664  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13159                      .dwattr DW$664, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
   13160                      .dwattr DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
   13161                      .dwattr DW$664, DW_AT_accessibility(DW_ACCESS_public)
   13162              DW$665  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
   13163                      .dwattr DW$665, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
   13164                      .dwattr DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   13165                      .dwattr DW$665, DW_AT_accessibility(DW_ACCESS_public)
   13166              DW$666  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13167                      .dwattr DW$666, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
   13168                      .dwattr DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
   13169                      .dwattr DW$666, DW_AT_accessibility(DW_ACCESS_public)
   13170              DW$667  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13171                      .dwattr DW$667, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
   13172                      .dwattr DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   13173                      .dwattr DW$667, DW_AT_accessibility(DW_ACCESS_public)
   13174                      .dwendtag DW$T$63
   13175              
   13176              
   13177              DW$T$64 .dwtag  DW_TAG_structure_type
   13178                      .dwattr DW$T$64, DW_AT_name("tag_engingestruct")
   13179                      .dwattr DW$T$64, DW_AT_byte_size(0x02)
   13180              DW$668  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   13181                      .dwattr DW$668, DW_AT_name("runtime"), DW_AT_symbol_name("_runtime")
   13182                      .dwattr DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13183                      .dwattr DW$668, DW_AT_accessibility(DW_ACCESS_public)
   13184                      .dwendtag DW$T$64
   13185              
   13186              
   13187              DW$T$71 .dwtag  DW_TAG_structure_type
   13188                      .dwattr DW$T$71, DW_AT_name("tag_configstruct")
   13189                      .dwattr DW$T$71, DW_AT_byte_size(0x18)
   13190              DW$669  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
   13191                      .dwattr DW$669, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
   13192                      .dwattr DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13193                      .dwattr DW$669, DW_AT_accessibility(DW_ACCESS_public)
   13194              DW$670  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
   13195                      .dwattr DW$670, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
   13196                      .dwattr DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  273

   13197                      .dwattr DW$670, DW_AT_accessibility(DW_ACCESS_public)
   13198              DW$671  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
   13199                      .dwattr DW$671, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
   13200                      .dwattr DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13201                      .dwattr DW$671, DW_AT_accessibility(DW_ACCESS_public)
   13202              DW$672  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
   13203                      .dwattr DW$672, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
   13204                      .dwattr DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13205                      .dwattr DW$672, DW_AT_accessibility(DW_ACCESS_public)
   13206              DW$673  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
   13207                      .dwattr DW$673, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
   13208                      .dwattr DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13209                      .dwattr DW$673, DW_AT_accessibility(DW_ACCESS_public)
   13210              DW$674  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
   13211                      .dwattr DW$674, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
   13212                      .dwattr DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13213                      .dwattr DW$674, DW_AT_accessibility(DW_ACCESS_public)
   13214                      .dwendtag DW$T$71
   13215              
   13216              
   13217              DW$T$73 .dwtag  DW_TAG_structure_type
   13218                      .dwattr DW$T$73, DW_AT_name("tag_offsetstruct")
   13219                      .dwattr DW$T$73, DW_AT_byte_size(0x1c)
   13220              DW$675  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
   13221                      .dwattr DW$675, DW_AT_name("val"), DW_AT_symbol_name("_val")
   13222                      .dwattr DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13223                      .dwattr DW$675, DW_AT_accessibility(DW_ACCESS_public)
   13224                      .dwendtag DW$T$73
   13225              
   13226              DW$T$341        .dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$77)
   13227                      .dwattr DW$T$341, DW_AT_language(DW_LANG_C)
   13228              DW$T$345        .dwtag  DW_TAG_typedef, DW_AT_name("manrefstruct"), DW_AT_type(*DW$T$78)
   13229                      .dwattr DW$T$345, DW_AT_language(DW_LANG_C)
   13230              
   13231              DW$T$79 .dwtag  DW_TAG_structure_type
   13232                      .dwattr DW$T$79, DW_AT_name("tag_damagemonstruct")
   13233                      .dwattr DW$T$79, DW_AT_byte_size(0x10)
   13234              DW$676  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13235                      .dwattr DW$676, DW_AT_name("ccsplit"), DW_AT_symbol_name("_ccsplit")
   13236                      .dwattr DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13237                      .dwattr DW$676, DW_AT_accessibility(DW_ACCESS_public)
   13238              DW$677  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13239                      .dwattr DW$677, DW_AT_name("kvalue"), DW_AT_symbol_name("_kvalue")
   13240                      .dwattr DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13241                      .dwattr DW$677, DW_AT_accessibility(DW_ACCESS_public)
   13242              DW$678  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13243                      .dwattr DW$678, DW_AT_name("betavalue"), DW_AT_symbol_name("_betavalue")
   13244                      .dwattr DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13245                      .dwattr DW$678, DW_AT_accessibility(DW_ACCESS_public)
   13246              DW$679  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13247                      .dwattr DW$679, DW_AT_name("rpmlevelx"), DW_AT_symbol_name("_rpmlevelx")
   13248                      .dwattr DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13249                      .dwattr DW$679, DW_AT_accessibility(DW_ACCESS_public)
   13250              DW$680  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13251                      .dwattr DW$680, DW_AT_name("reflevelx"), DW_AT_symbol_name("_reflevelx")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  274

   13252                      .dwattr DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13253                      .dwattr DW$680, DW_AT_accessibility(DW_ACCESS_public)
   13254              DW$681  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13255                      .dwattr DW$681, DW_AT_name("presentstatex"), DW_AT_symbol_name("_presentstatex")
   13256                      .dwattr DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13257                      .dwattr DW$681, DW_AT_accessibility(DW_ACCESS_public)
   13258              DW$682  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13259                      .dwattr DW$682, DW_AT_name("alarmlevelsingle"), DW_AT_symbol_name("_alarmlevelsingle")
   13260                      .dwattr DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13261                      .dwattr DW$682, DW_AT_accessibility(DW_ACCESS_public)
   13262              DW$683  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13263                      .dwattr DW$683, DW_AT_name("alarmlevelcyl"), DW_AT_symbol_name("_alarmlevelcyl")
   13264                      .dwattr DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13265                      .dwattr DW$683, DW_AT_accessibility(DW_ACCESS_public)
   13266              DW$684  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13267                      .dwattr DW$684, DW_AT_name("alarmlevelmbsum"), DW_AT_symbol_name("_alarmlevelmbsum")
   13268                      .dwattr DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13269                      .dwattr DW$684, DW_AT_accessibility(DW_ACCESS_public)
   13270              DW$685  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13271                      .dwattr DW$685, DW_AT_name("cylneighbour"), DW_AT_symbol_name("_cylneighbour")
   13272                      .dwattr DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13273                      .dwattr DW$685, DW_AT_accessibility(DW_ACCESS_public)
   13274              DW$686  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13275                      .dwattr DW$686, DW_AT_name("mbneighbour"), DW_AT_symbol_name("_mbneighbour")
   13276                      .dwattr DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13277                      .dwattr DW$686, DW_AT_accessibility(DW_ACCESS_public)
   13278              DW$687  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13279                      .dwattr DW$687, DW_AT_name("cylneighbouralarms"), DW_AT_symbol_name("_cylneighbouralarms")
   13280                      .dwattr DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13281                      .dwattr DW$687, DW_AT_accessibility(DW_ACCESS_public)
   13282              DW$688  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13283                      .dwattr DW$688, DW_AT_name("mbneighbouralarms"), DW_AT_symbol_name("_mbneighbouralarms")
   13284                      .dwattr DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13285                      .dwattr DW$688, DW_AT_accessibility(DW_ACCESS_public)
   13286              DW$689  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13287                      .dwattr DW$689, DW_AT_name("deltarpmlimit"), DW_AT_symbol_name("_deltarpmlimit")
   13288                      .dwattr DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13289                      .dwattr DW$689, DW_AT_accessibility(DW_ACCESS_public)
   13290              DW$690  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13291                      .dwattr DW$690, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
   13292                      .dwattr DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13293                      .dwattr DW$690, DW_AT_accessibility(DW_ACCESS_public)
   13294              DW$691  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13295                      .dwattr DW$691, DW_AT_name("damagemonenb"), DW_AT_symbol_name("_damagemonenb")
   13296                      .dwattr DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   13297                      .dwattr DW$691, DW_AT_accessibility(DW_ACCESS_public)
   13298                      .dwendtag DW$T$79
   13299              
   13300              
   13301              DW$T$80 .dwtag  DW_TAG_structure_type
   13302                      .dwattr DW$T$80, DW_AT_name("tag_dynamicalarmsstruct")
   13303                      .dwattr DW$T$80, DW_AT_byte_size(0x24)
   13304              DW$692  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13305                      .dwattr DW$692, DW_AT_name("rpmav"), DW_AT_symbol_name("_rpmav")
   13306                      .dwattr DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  275

   13307                      .dwattr DW$692, DW_AT_accessibility(DW_ACCESS_public)
   13308              DW$693  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13309                      .dwattr DW$693, DW_AT_name("single1"), DW_AT_symbol_name("_single1")
   13310                      .dwattr DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13311                      .dwattr DW$693, DW_AT_accessibility(DW_ACCESS_public)
   13312              DW$694  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13313                      .dwattr DW$694, DW_AT_name("cyl1"), DW_AT_symbol_name("_cyl1")
   13314                      .dwattr DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13315                      .dwattr DW$694, DW_AT_accessibility(DW_ACCESS_public)
   13316              DW$695  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13317                      .dwattr DW$695, DW_AT_name("mbsum1"), DW_AT_symbol_name("_mbsum1")
   13318                      .dwattr DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13319                      .dwattr DW$695, DW_AT_accessibility(DW_ACCESS_public)
   13320              DW$696  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13321                      .dwattr DW$696, DW_AT_name("single2"), DW_AT_symbol_name("_single2")
   13322                      .dwattr DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13323                      .dwattr DW$696, DW_AT_accessibility(DW_ACCESS_public)
   13324              DW$697  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13325                      .dwattr DW$697, DW_AT_name("cyl2"), DW_AT_symbol_name("_cyl2")
   13326                      .dwattr DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13327                      .dwattr DW$697, DW_AT_accessibility(DW_ACCESS_public)
   13328              DW$698  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13329                      .dwattr DW$698, DW_AT_name("mbsum2"), DW_AT_symbol_name("_mbsum2")
   13330                      .dwattr DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13331                      .dwattr DW$698, DW_AT_accessibility(DW_ACCESS_public)
   13332              DW$699  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13333                      .dwattr DW$699, DW_AT_name("deltarpmprev"), DW_AT_symbol_name("_deltarpmprev")
   13334                      .dwattr DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13335                      .dwattr DW$699, DW_AT_accessibility(DW_ACCESS_public)
   13336              DW$700  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   13337                      .dwattr DW$700, DW_AT_name("deltarpm"), DW_AT_symbol_name("_deltarpm")
   13338                      .dwattr DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13339                      .dwattr DW$700, DW_AT_accessibility(DW_ACCESS_public)
   13340              DW$701  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13341                      .dwattr DW$701, DW_AT_name("deltarpm_int"), DW_AT_symbol_name("_deltarpm_int")
   13342                      .dwattr DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13343                      .dwattr DW$701, DW_AT_accessibility(DW_ACCESS_public)
   13344              DW$702  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13345                      .dwattr DW$702, DW_AT_name("rpmav_int"), DW_AT_symbol_name("_rpmav_int")
   13346                      .dwattr DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   13347                      .dwattr DW$702, DW_AT_accessibility(DW_ACCESS_public)
   13348              DW$703  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13349                      .dwattr DW$703, DW_AT_name("deltarpmprev_int"), DW_AT_symbol_name("_deltarpmprev_int")
   13350                      .dwattr DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13351                      .dwattr DW$703, DW_AT_accessibility(DW_ACCESS_public)
   13352              DW$704  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13353                      .dwattr DW$704, DW_AT_name("single"), DW_AT_symbol_name("_single")
   13354                      .dwattr DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   13355                      .dwattr DW$704, DW_AT_accessibility(DW_ACCESS_public)
   13356              DW$705  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13357                      .dwattr DW$705, DW_AT_name("cyl"), DW_AT_symbol_name("_cyl")
   13358                      .dwattr DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13359                      .dwattr DW$705, DW_AT_accessibility(DW_ACCESS_public)
   13360              DW$706  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13361                      .dwattr DW$706, DW_AT_name("mbsum"), DW_AT_symbol_name("_mbsum")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  276

   13362                      .dwattr DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   13363                      .dwattr DW$706, DW_AT_accessibility(DW_ACCESS_public)
   13364              DW$707  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13365                      .dwattr DW$707, DW_AT_name("singleprev"), DW_AT_symbol_name("_singleprev")
   13366                      .dwattr DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13367                      .dwattr DW$707, DW_AT_accessibility(DW_ACCESS_public)
   13368              DW$708  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13369                      .dwattr DW$708, DW_AT_name("cylprev"), DW_AT_symbol_name("_cylprev")
   13370                      .dwattr DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   13371                      .dwattr DW$708, DW_AT_accessibility(DW_ACCESS_public)
   13372              DW$709  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13373                      .dwattr DW$709, DW_AT_name("mbsumprev"), DW_AT_symbol_name("_mbsumprev")
   13374                      .dwattr DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13375                      .dwattr DW$709, DW_AT_accessibility(DW_ACCESS_public)
   13376              DW$710  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13377                      .dwattr DW$710, DW_AT_name("single1_int"), DW_AT_symbol_name("_single1_int")
   13378                      .dwattr DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
   13379                      .dwattr DW$710, DW_AT_accessibility(DW_ACCESS_public)
   13380              DW$711  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13381                      .dwattr DW$711, DW_AT_name("cyl1_int"), DW_AT_symbol_name("_cyl1_int")
   13382                      .dwattr DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13383                      .dwattr DW$711, DW_AT_accessibility(DW_ACCESS_public)
   13384              DW$712  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13385                      .dwattr DW$712, DW_AT_name("mbsum1_int"), DW_AT_symbol_name("_mbsum1_int")
   13386                      .dwattr DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   13387                      .dwattr DW$712, DW_AT_accessibility(DW_ACCESS_public)
   13388              DW$713  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13389                      .dwattr DW$713, DW_AT_name("single2_int"), DW_AT_symbol_name("_single2_int")
   13390                      .dwattr DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   13391                      .dwattr DW$713, DW_AT_accessibility(DW_ACCESS_public)
   13392              DW$714  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13393                      .dwattr DW$714, DW_AT_name("cyl2_int"), DW_AT_symbol_name("_cyl2_int")
   13394                      .dwattr DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
   13395                      .dwattr DW$714, DW_AT_accessibility(DW_ACCESS_public)
   13396              DW$715  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13397                      .dwattr DW$715, DW_AT_name("mbsum2_int"), DW_AT_symbol_name("_mbsum2_int")
   13398                      .dwattr DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   13399                      .dwattr DW$715, DW_AT_accessibility(DW_ACCESS_public)
   13400              DW$716  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   13401                      .dwattr DW$716, DW_AT_name("hits"), DW_AT_symbol_name("_hits")
   13402                      .dwattr DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   13403                      .dwattr DW$716, DW_AT_accessibility(DW_ACCESS_public)
   13404                      .dwendtag DW$T$80
   13405              
   13406              
   13407              DW$T$83 .dwtag  DW_TAG_structure_type
   13408                      .dwattr DW$T$83, DW_AT_name("tag_speedcompstruct")
   13409                      .dwattr DW$T$83, DW_AT_byte_size(0x19)
   13410              DW$717  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13411                      .dwattr DW$717, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
   13412                      .dwattr DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13413                      .dwattr DW$717, DW_AT_accessibility(DW_ACCESS_public)
   13414              DW$718  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13415                      .dwattr DW$718, DW_AT_name("status"), DW_AT_symbol_name("_status")
   13416                      .dwattr DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  277

   13417                      .dwattr DW$718, DW_AT_accessibility(DW_ACCESS_public)
   13418              DW$719  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
   13419                      .dwattr DW$719, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
   13420                      .dwattr DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13421                      .dwattr DW$719, DW_AT_accessibility(DW_ACCESS_public)
   13422              DW$720  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13423                      .dwattr DW$720, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
   13424                      .dwattr DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13425                      .dwattr DW$720, DW_AT_accessibility(DW_ACCESS_public)
   13426              DW$721  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13427                      .dwattr DW$721, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
   13428                      .dwattr DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13429                      .dwattr DW$721, DW_AT_accessibility(DW_ACCESS_public)
   13430              DW$722  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13431                      .dwattr DW$722, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
   13432                      .dwattr DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13433                      .dwattr DW$722, DW_AT_accessibility(DW_ACCESS_public)
   13434              DW$723  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13435                      .dwattr DW$723, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
   13436                      .dwattr DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13437                      .dwattr DW$723, DW_AT_accessibility(DW_ACCESS_public)
   13438              DW$724  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13439                      .dwattr DW$724, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
   13440                      .dwattr DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13441                      .dwattr DW$724, DW_AT_accessibility(DW_ACCESS_public)
   13442              DW$725  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13443                      .dwattr DW$725, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
   13444                      .dwattr DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13445                      .dwattr DW$725, DW_AT_accessibility(DW_ACCESS_public)
   13446              DW$726  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13447                      .dwattr DW$726, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
   13448                      .dwattr DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13449                      .dwattr DW$726, DW_AT_accessibility(DW_ACCESS_public)
   13450              DW$727  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13451                      .dwattr DW$727, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
   13452                      .dwattr DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   13453                      .dwattr DW$727, DW_AT_accessibility(DW_ACCESS_public)
   13454              DW$728  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13455                      .dwattr DW$728, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
   13456                      .dwattr DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13457                      .dwattr DW$728, DW_AT_accessibility(DW_ACCESS_public)
   13458              DW$729  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13459                      .dwattr DW$729, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
   13460                      .dwattr DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   13461                      .dwattr DW$729, DW_AT_accessibility(DW_ACCESS_public)
   13462              DW$730  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13463                      .dwattr DW$730, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
   13464                      .dwattr DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13465                      .dwattr DW$730, DW_AT_accessibility(DW_ACCESS_public)
   13466              DW$731  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13467                      .dwattr DW$731, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
   13468                      .dwattr DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   13469                      .dwattr DW$731, DW_AT_accessibility(DW_ACCESS_public)
   13470              DW$732  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13471                      .dwattr DW$732, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  278

   13472                      .dwattr DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13473                      .dwattr DW$732, DW_AT_accessibility(DW_ACCESS_public)
   13474              DW$733  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13475                      .dwattr DW$733, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
   13476                      .dwattr DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   13477                      .dwattr DW$733, DW_AT_accessibility(DW_ACCESS_public)
   13478              DW$734  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13479                      .dwattr DW$734, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
   13480                      .dwattr DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13481                      .dwattr DW$734, DW_AT_accessibility(DW_ACCESS_public)
   13482              DW$735  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13483                      .dwattr DW$735, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
   13484                      .dwattr DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   13485                      .dwattr DW$735, DW_AT_accessibility(DW_ACCESS_public)
   13486              DW$736  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13487                      .dwattr DW$736, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
   13488                      .dwattr DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13489                      .dwattr DW$736, DW_AT_accessibility(DW_ACCESS_public)
   13490                      .dwendtag DW$T$83
   13491              
   13492              
   13493              DW$T$84 .dwtag  DW_TAG_structure_type
   13494                      .dwattr DW$T$84, DW_AT_name("tag_wiosettingsstruct")
   13495                      .dwattr DW$T$84, DW_AT_byte_size(0x0a)
   13496              DW$737  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13497                      .dwattr DW$737, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
   13498                      .dwattr DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13499                      .dwattr DW$737, DW_AT_accessibility(DW_ACCESS_public)
   13500              DW$738  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13501                      .dwattr DW$738, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
   13502                      .dwattr DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13503                      .dwattr DW$738, DW_AT_accessibility(DW_ACCESS_public)
   13504              DW$739  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13505                      .dwattr DW$739, DW_AT_name("alarmupperlevel"), DW_AT_symbol_name("_alarmupperlevel")
   13506                      .dwattr DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13507                      .dwattr DW$739, DW_AT_accessibility(DW_ACCESS_public)
   13508              DW$740  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13509                      .dwattr DW$740, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
   13510                      .dwattr DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13511                      .dwattr DW$740, DW_AT_accessibility(DW_ACCESS_public)
   13512              DW$741  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13513                      .dwattr DW$741, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
   13514                      .dwattr DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13515                      .dwattr DW$741, DW_AT_accessibility(DW_ACCESS_public)
   13516              DW$742  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13517                      .dwattr DW$742, DW_AT_name("scaledmin"), DW_AT_symbol_name("_scaledmin")
   13518                      .dwattr DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13519                      .dwattr DW$742, DW_AT_accessibility(DW_ACCESS_public)
   13520              DW$743  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13521                      .dwattr DW$743, DW_AT_name("scaledmax"), DW_AT_symbol_name("_scaledmax")
   13522                      .dwattr DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13523                      .dwattr DW$743, DW_AT_accessibility(DW_ACCESS_public)
   13524              DW$744  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13525                      .dwattr DW$744, DW_AT_name("units"), DW_AT_symbol_name("_units")
   13526                      .dwattr DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  279

   13527                      .dwattr DW$744, DW_AT_accessibility(DW_ACCESS_public)
   13528              DW$745  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13529                      .dwattr DW$745, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
   13530                      .dwattr DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13531                      .dwattr DW$745, DW_AT_accessibility(DW_ACCESS_public)
   13532              DW$746  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13533                      .dwattr DW$746, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
   13534                      .dwattr DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13535                      .dwattr DW$746, DW_AT_accessibility(DW_ACCESS_public)
   13536                      .dwendtag DW$T$84
   13537              
   13538              
   13539              DW$T$85 .dwtag  DW_TAG_structure_type
   13540                      .dwattr DW$T$85, DW_AT_name("tag_slemsettingsstruct")
   13541                      .dwattr DW$T$85, DW_AT_byte_size(0x06)
   13542              DW$747  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13543                      .dwattr DW$747, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
   13544                      .dwattr DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13545                      .dwattr DW$747, DW_AT_accessibility(DW_ACCESS_public)
   13546              DW$748  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13547                      .dwattr DW$748, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
   13548                      .dwattr DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13549                      .dwattr DW$748, DW_AT_accessibility(DW_ACCESS_public)
   13550              DW$749  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13551                      .dwattr DW$749, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
   13552                      .dwattr DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13553                      .dwattr DW$749, DW_AT_accessibility(DW_ACCESS_public)
   13554              DW$750  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13555                      .dwattr DW$750, DW_AT_name("mVfsd"), DW_AT_symbol_name("_mVfsd")
   13556                      .dwattr DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13557                      .dwattr DW$750, DW_AT_accessibility(DW_ACCESS_public)
   13558              DW$751  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13559                      .dwattr DW$751, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
   13560                      .dwattr DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13561                      .dwattr DW$751, DW_AT_accessibility(DW_ACCESS_public)
   13562              DW$752  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13563                      .dwattr DW$752, DW_AT_name("alarmdelay"), DW_AT_symbol_name("_alarmdelay")
   13564                      .dwattr DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13565                      .dwattr DW$752, DW_AT_accessibility(DW_ACCESS_public)
   13566                      .dwendtag DW$T$85
   13567              
   13568              
   13569              DW$T$87 .dwtag  DW_TAG_structure_type
   13570                      .dwattr DW$T$87, DW_AT_name("tag_slemsstruct")
   13571                      .dwattr DW$T$87, DW_AT_byte_size(0x03)
   13572              DW$753  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   13573                      .dwattr DW$753, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
   13574                      .dwattr DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13575                      .dwattr DW$753, DW_AT_accessibility(DW_ACCESS_public)
   13576              DW$754  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
   13577                      .dwattr DW$754, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
   13578                      .dwattr DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13579                      .dwattr DW$754, DW_AT_accessibility(DW_ACCESS_public)
   13580              DW$755  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13581                      .dwattr DW$755, DW_AT_name("levelcount"), DW_AT_symbol_name("_levelcount")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  280

   13582                      .dwattr DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13583                      .dwattr DW$755, DW_AT_accessibility(DW_ACCESS_public)
   13584                      .dwendtag DW$T$87
   13585              
   13586              
   13587              DW$T$88 .dwtag  DW_TAG_structure_type
   13588                      .dwattr DW$T$88, DW_AT_name("tag_cppsettingsstruct")
   13589                      .dwattr DW$T$88, DW_AT_byte_size(0x10)
   13590              DW$756  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13591                      .dwattr DW$756, DW_AT_name("iCppEnable"), DW_AT_symbol_name("_iCppEnable")
   13592                      .dwattr DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13593                      .dwattr DW$756, DW_AT_accessibility(DW_ACCESS_public)
   13594              DW$757  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13595                      .dwattr DW$757, DW_AT_name("iCppLowLimit"), DW_AT_symbol_name("_iCppLowLimit")
   13596                      .dwattr DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13597                      .dwattr DW$757, DW_AT_accessibility(DW_ACCESS_public)
   13598              DW$758  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13599                      .dwattr DW$758, DW_AT_name("iCppHighLimit"), DW_AT_symbol_name("_iCppHighLimit")
   13600                      .dwattr DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13601                      .dwattr DW$758, DW_AT_accessibility(DW_ACCESS_public)
   13602              DW$759  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13603                      .dwattr DW$759, DW_AT_name("cppkvalue"), DW_AT_symbol_name("_cppkvalue")
   13604                      .dwattr DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13605                      .dwattr DW$759, DW_AT_accessibility(DW_ACCESS_public)
   13606              DW$760  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13607                      .dwattr DW$760, DW_AT_name("gammavalue"), DW_AT_symbol_name("_gammavalue")
   13608                      .dwattr DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13609                      .dwattr DW$760, DW_AT_accessibility(DW_ACCESS_public)
   13610              DW$761  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13611                      .dwattr DW$761, DW_AT_name("cpplevelx"), DW_AT_symbol_name("_cpplevelx")
   13612                      .dwattr DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13613                      .dwattr DW$761, DW_AT_accessibility(DW_ACCESS_public)
   13614              DW$762  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13615                      .dwattr DW$762, DW_AT_name("delatRpmPauseDelay"), DW_AT_symbol_name("_delatRpmPauseDelay")
   13616                      .dwattr DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13617                      .dwattr DW$762, DW_AT_accessibility(DW_ACCESS_public)
   13618              DW$763  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13619                      .dwattr DW$763, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
   13620                      .dwattr DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13621                      .dwattr DW$763, DW_AT_accessibility(DW_ACCESS_public)
   13622              DW$764  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13623                      .dwattr DW$764, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
   13624                      .dwattr DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13625                      .dwattr DW$764, DW_AT_accessibility(DW_ACCESS_public)
   13626              DW$765  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13627                      .dwattr DW$765, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
   13628                      .dwattr DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13629                      .dwattr DW$765, DW_AT_accessibility(DW_ACCESS_public)
   13630              DW$766  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13631                      .dwattr DW$766, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
   13632                      .dwattr DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13633                      .dwattr DW$766, DW_AT_accessibility(DW_ACCESS_public)
   13634              DW$767  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13635                      .dwattr DW$767, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
   13636                      .dwattr DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  281

   13637                      .dwattr DW$767, DW_AT_accessibility(DW_ACCESS_public)
   13638              DW$768  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13639                      .dwattr DW$768, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
   13640                      .dwattr DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13641                      .dwattr DW$768, DW_AT_accessibility(DW_ACCESS_public)
   13642              DW$769  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13643                      .dwattr DW$769, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
   13644                      .dwattr DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13645                      .dwattr DW$769, DW_AT_accessibility(DW_ACCESS_public)
   13646              DW$770  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13647                      .dwattr DW$770, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
   13648                      .dwattr DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13649                      .dwattr DW$770, DW_AT_accessibility(DW_ACCESS_public)
   13650              DW$771  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13651                      .dwattr DW$771, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
   13652                      .dwattr DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   13653                      .dwattr DW$771, DW_AT_accessibility(DW_ACCESS_public)
   13654                      .dwendtag DW$T$88
   13655              
   13656              
   13657              DW$T$89 .dwtag  DW_TAG_structure_type
   13658                      .dwattr DW$T$89, DW_AT_name("tag_sensorMoving")
   13659                      .dwattr DW$T$89, DW_AT_byte_size(0x02)
   13660              DW$772  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13661                      .dwattr DW$772, DW_AT_name("calAlarmThreshhold"), DW_AT_symbol_name("_calAlarmThreshhold")
   13662                      .dwattr DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13663                      .dwattr DW$772, DW_AT_accessibility(DW_ACCESS_public)
   13664              DW$773  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13665                      .dwattr DW$773, DW_AT_name("unusedByte"), DW_AT_symbol_name("_unusedByte")
   13666                      .dwattr DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13667                      .dwattr DW$773, DW_AT_accessibility(DW_ACCESS_public)
   13668                      .dwendtag DW$T$89
   13669              
   13670              
   13671              DW$T$93 .dwtag  DW_TAG_structure_type
   13672                      .dwattr DW$T$93, DW_AT_name("tag_dcmodechecksstruct")
   13673                      .dwattr DW$T$93, DW_AT_byte_size(0x0f)
   13674              DW$774  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
   13675                      .dwattr DW$774, DW_AT_name("ideal"), DW_AT_symbol_name("_ideal")
   13676                      .dwattr DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13677                      .dwattr DW$774, DW_AT_accessibility(DW_ACCESS_public)
   13678              DW$775  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
   13679                      .dwattr DW$775, DW_AT_name("ok"), DW_AT_symbol_name("_ok")
   13680                      .dwattr DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13681                      .dwattr DW$775, DW_AT_accessibility(DW_ACCESS_public)
   13682              DW$776  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
   13683                      .dwattr DW$776, DW_AT_name("cylinderComparison"), DW_AT_symbol_name("_cylinderComparison")
   13684                      .dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13685                      .dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
   13686              DW$777  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13687                      .dwattr DW$777, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
   13688                      .dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13689                      .dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
   13690              DW$778  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13691                      .dwattr DW$778, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  282

   13692                      .dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13693                      .dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
   13694              DW$779  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13695                      .dwattr DW$779, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
   13696                      .dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13697                      .dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
   13698              DW$780  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13699                      .dwattr DW$780, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
   13700                      .dwattr DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13701                      .dwattr DW$780, DW_AT_accessibility(DW_ACCESS_public)
   13702              DW$781  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13703                      .dwattr DW$781, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
   13704                      .dwattr DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13705                      .dwattr DW$781, DW_AT_accessibility(DW_ACCESS_public)
   13706              DW$782  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13707                      .dwattr DW$782, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
   13708                      .dwattr DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13709                      .dwattr DW$782, DW_AT_accessibility(DW_ACCESS_public)
   13710              DW$783  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13711                      .dwattr DW$783, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
   13712                      .dwattr DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13713                      .dwattr DW$783, DW_AT_accessibility(DW_ACCESS_public)
   13714              DW$784  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13715                      .dwattr DW$784, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
   13716                      .dwattr DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13717                      .dwattr DW$784, DW_AT_accessibility(DW_ACCESS_public)
   13718              DW$785  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13719                      .dwattr DW$785, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
   13720                      .dwattr DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13721                      .dwattr DW$785, DW_AT_accessibility(DW_ACCESS_public)
   13722                      .dwendtag DW$T$93
   13723              
   13724              DW$T$365        .dwtag  DW_TAG_typedef, DW_AT_name("inputstruct"), DW_AT_type(*DW$T$105)
   13725                      .dwattr DW$T$365, DW_AT_language(DW_LANG_C)
   13726              
   13727              DW$T$111        .dwtag  DW_TAG_structure_type
   13728                      .dwattr DW$T$111, DW_AT_name("tag_sdfilestruct")
   13729                      .dwattr DW$T$111, DW_AT_byte_size(0x14e)
   13730              DW$786  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13731                      .dwattr DW$786, DW_AT_name("year1"), DW_AT_symbol_name("_year1")
   13732                      .dwattr DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13733                      .dwattr DW$786, DW_AT_accessibility(DW_ACCESS_public)
   13734              DW$787  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13735                      .dwattr DW$787, DW_AT_name("month1"), DW_AT_symbol_name("_month1")
   13736                      .dwattr DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13737                      .dwattr DW$787, DW_AT_accessibility(DW_ACCESS_public)
   13738              DW$788  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13739                      .dwattr DW$788, DW_AT_name("date1"), DW_AT_symbol_name("_date1")
   13740                      .dwattr DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13741                      .dwattr DW$788, DW_AT_accessibility(DW_ACCESS_public)
   13742              DW$789  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13743                      .dwattr DW$789, DW_AT_name("yearn"), DW_AT_symbol_name("_yearn")
   13744                      .dwattr DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13745                      .dwattr DW$789, DW_AT_accessibility(DW_ACCESS_public)
   13746              DW$790  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:29 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
sdcard.asm                                                           PAGE  283

   13747                      .dwattr DW$790, DW_AT_name("monthn"), DW_AT_symbol_name("_monthn")
   13748                      .dwattr DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13749                      .dwattr DW$790, DW_AT_accessibility(DW_ACCESS_public)
   13750              DW$791  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13751                      .dwattr DW$791, DW_AT_name("daten"), DW_AT_symbol_name("_daten")
   13752                      .dwattr DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13753                      .dwattr DW$791, DW_AT_accessibility(DW_ACCESS_public)
   13754              DW$792  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13755                      .dwattr DW$792, DW_AT_name("readyear"), DW_AT_symbol_name("_readyear")
   13756                      .dwattr DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13757                      .dwattr DW$792, DW_AT_accessibility(DW_ACCESS_public)
   13758              DW$793  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13759                      .dwattr DW$793, DW_AT_name("readmonth"), DW_AT_symbol_name("_readmonth")
   13760                      .dwattr DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13761                      .dwattr DW$793, DW_AT_accessibility(DW_ACCESS_public)
   13762              DW$794  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   13763                      .dwattr DW$794, DW_AT_name("readdate"), DW_AT_symbol_name("_readdate")
   13764                      .dwattr DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13765                      .dwattr DW$794, DW_AT_accessibility(DW_ACCESS_public)
   13766              DW$795  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
   13767                      .dwattr DW$795, DW_AT_name("file"), DW_AT_symbol_name("_file")
   13768                      .dwattr DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13769                      .dwattr DW$795, DW_AT_accessibility(DW_ACCESS_public)
   13770              DW$796  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
