TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:30 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("setup.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("PerformIsr1"), DW_AT_symbol_name("_PerformIsr1")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

    1861              DW$T$72 .dwtag  DW_TAG_subroutine_type
    1862                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    1863              DW$107  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1864                      .dwendtag DW$T$72
    1865              
    1866              
    1867              DW$T$78 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$77)
    1868                      .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
    1869                      .dwattr DW$T$78, DW_AT_byte_size(0xd2)
    1870              DW$108  .dwtag  DW_TAG_subrange_type
    1871                      .dwattr DW$108, DW_AT_upper_bound(0x68)
    1872                      .dwendtag DW$T$78
    1873              
    1874              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1875                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1876                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    1877              
    1878              DW$T$83 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1879                      .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
    1880              
    1881              DW$T$85 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1882                      .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
    1883              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1884                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1885                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1886              DW$109  .dwtag  DW_TAG_far_type
    1887                      .dwattr DW$109, DW_AT_type(*DW$T$89)
    1888              DW$T$90 .dwtag  DW_TAG_volatile_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   42

    1889                      .dwattr DW$T$90, DW_AT_type(*DW$109)
    1890              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1891                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1892                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1893              
    1894              DW$T$93 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
    1895                      .dwattr DW$T$93, DW_AT_language(DW_LANG_C)
    1896              DW$T$97 .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$20)
    1897                      .dwattr DW$T$97, DW_AT_language(DW_LANG_C)
    1898              DW$T$98 .dwtag  DW_TAG_typedef, DW_AT_name("safestruct1struct"), DW_AT_type(*DW$T$24)
    1899                      .dwattr DW$T$98, DW_AT_language(DW_LANG_C)
    1900              DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("safestruct2struct"), DW_AT_type(*DW$T$37)
    1901                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    1902              DW$T$100        .dwtag  DW_TAG_typedef, DW_AT_name("clockstruct"), DW_AT_type(*DW$T$38)
    1903                      .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    1904              DW$110  .dwtag  DW_TAG_far_type
    1905                      .dwattr DW$110, DW_AT_type(*DW$T$101)
    1906              DW$T$102        .dwtag  DW_TAG_volatile_type
    1907                      .dwattr DW$T$102, DW_AT_type(*DW$110)
    1908              DW$T$105        .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$42)
    1909                      .dwattr DW$T$105, DW_AT_language(DW_LANG_C)
    1910              DW$T$107        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$49)
    1911                      .dwattr DW$T$107, DW_AT_language(DW_LANG_C)
    1912              DW$T$108        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadC"), DW_AT_type(*DW$T$52)
    1913                      .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
    1914              DW$T$109        .dwtag  DW_TAG_typedef, DW_AT_name("rpmstruct"), DW_AT_type(*DW$T$54)
    1915                      .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
    1916              DW$T$110        .dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$57)
    1917                      .dwattr DW$T$110, DW_AT_language(DW_LANG_C)
    1918              DW$T$112        .dwtag  DW_TAG_typedef, DW_AT_name("prewarnstruct"), DW_AT_type(*DW$T$60)
    1919                      .dwattr DW$T$112, DW_AT_language(DW_LANG_C)
    1920              DW$T$113        .dwtag  DW_TAG_typedef, DW_AT_name("offsetstruct"), DW_AT_type(*DW$T$61)
    1921                      .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
    1922              DW$T$115        .dwtag  DW_TAG_typedef, DW_AT_name("wiosettingsstruct"), DW_AT_type(*DW$T$62)
    1923                      .dwattr DW$T$115, DW_AT_language(DW_LANG_C)
    1924              DW$T$116        .dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$64)
    1925                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
    1926              DW$111  .dwtag  DW_TAG_far_type
    1927                      .dwattr DW$111, DW_AT_type(*DW$T$76)
    1928              DW$T$77 .dwtag  DW_TAG_const_type
    1929                      .dwattr DW$T$77, DW_AT_type(*DW$111)
    1930              DW$T$89 .dwtag  DW_TAG_typedef, DW_AT_name("uint"), DW_AT_type(*DW$T$11)
    1931                      .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    1932              
    1933              DW$T$20 .dwtag  DW_TAG_structure_type
    1934                      .dwattr DW$T$20, DW_AT_name("tag_settingsstruct")
    1935                      .dwattr DW$T$20, DW_AT_byte_size(0x24)
    1936              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1937                      .dwattr DW$112, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    1938                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1939                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1940              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1941                      .dwattr DW$113, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    1942                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1943                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   43

    1944              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1945                      .dwattr DW$114, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    1946                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1947                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1948              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1949                      .dwattr DW$115, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    1950                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1951                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1952              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1953                      .dwattr DW$116, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    1954                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1955                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1956              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1957                      .dwattr DW$117, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    1958                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1959                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1960              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1961                      .dwattr DW$118, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    1962                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1963                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1964              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1965                      .dwattr DW$119, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    1966                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1967                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1968              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1969                      .dwattr DW$120, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    1970                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1971                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1972              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1973                      .dwattr DW$121, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    1974                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1975                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1976              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1977                      .dwattr DW$122, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    1978                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1979                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1980              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1981                      .dwattr DW$123, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    1982                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1983                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1984              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1985                      .dwattr DW$124, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    1986                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1987                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1988              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1989                      .dwattr DW$125, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    1990                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1991                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1992              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1993                      .dwattr DW$126, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    1994                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1995                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1996              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1997                      .dwattr DW$127, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    1998                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   44

    1999                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2000              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2001                      .dwattr DW$128, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    2002                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2003                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2004              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2005                      .dwattr DW$129, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    2006                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2007                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2008              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2009                      .dwattr DW$130, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    2010                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2011                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2012              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2013                      .dwattr DW$131, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    2014                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2015                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2016              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2017                      .dwattr DW$132, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    2018                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2019                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2020              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2021                      .dwattr DW$133, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    2022                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2023                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2024              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2025                      .dwattr DW$134, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    2026                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2027                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2028              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2029                      .dwattr DW$135, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    2030                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2031                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2032              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2033                      .dwattr DW$136, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    2034                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2035                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2036              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2037                      .dwattr DW$137, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2038                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2039                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2040              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2041                      .dwattr DW$138, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    2042                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2043                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2044              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2045                      .dwattr DW$139, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2046                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2047                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2048              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2049                      .dwattr DW$140, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2050                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2051                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2052              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2053                      .dwattr DW$141, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   45

    2054                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2055                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2056              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2057                      .dwattr DW$142, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    2058                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2059                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2060              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2061                      .dwattr DW$143, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    2062                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2063                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2064              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2065                      .dwattr DW$144, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    2066                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2067                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2068              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2069                      .dwattr DW$145, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    2070                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2071                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2072              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2073                      .dwattr DW$146, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2074                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2075                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2076                      .dwendtag DW$T$20
    2077              
    2078              
    2079              DW$T$24 .dwtag  DW_TAG_structure_type
    2080                      .dwattr DW$T$24, DW_AT_name("tag_safestruct1struct")
    2081                      .dwattr DW$T$24, DW_AT_byte_size(0x1f)
    2082              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2083                      .dwattr DW$147, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    2084                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2086              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2087                      .dwattr DW$148, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    2088                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2089                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2090                      .dwendtag DW$T$24
    2091              
    2092              
    2093              DW$T$37 .dwtag  DW_TAG_structure_type
    2094                      .dwattr DW$T$37, DW_AT_name("tag_safestruct2struct")
    2095                      .dwattr DW$T$37, DW_AT_byte_size(0x1e)
    2096              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2097                      .dwattr DW$149, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    2098                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2100              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2101                      .dwattr DW$150, DW_AT_name("log"), DW_AT_symbol_name("_log")
    2102                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2103                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2104              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    2105                      .dwattr DW$151, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
    2106                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2107                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2108              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   46

    2109                      .dwattr DW$152, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    2110                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2111                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2112              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    2113                      .dwattr DW$153, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    2114                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2115                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2116              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2117                      .dwattr DW$154, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
    2118                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2119                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2120              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    2121                      .dwattr DW$155, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
    2122                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2123                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2124              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2125                      .dwattr DW$156, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
    2126                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2127                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2128              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2129                      .dwattr DW$157, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    2130                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2131                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2132              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2133                      .dwattr DW$158, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    2134                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2135                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2136              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2137                      .dwattr DW$159, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
    2138                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2139                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2140                      .dwendtag DW$T$37
    2141              
    2142              
    2143              DW$T$38 .dwtag  DW_TAG_structure_type
    2144                      .dwattr DW$T$38, DW_AT_name("tag_clockstruct")
    2145                      .dwattr DW$T$38, DW_AT_byte_size(0x0e)
    2146              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2147                      .dwattr DW$160, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
    2148                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2149                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2150              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2151                      .dwattr DW$161, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
    2152                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2153                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2154              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2155                      .dwattr DW$162, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
    2156                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2157                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2158              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2159                      .dwattr DW$163, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
    2160                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2161                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2162              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2163                      .dwattr DW$164, DW_AT_name("day"), DW_AT_symbol_name("_day")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   47

    2164                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2165                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2166              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2167                      .dwattr DW$165, DW_AT_name("date"), DW_AT_symbol_name("_date")
    2168                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2169                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2170              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2171                      .dwattr DW$166, DW_AT_name("month"), DW_AT_symbol_name("_month")
    2172                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2173                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2174              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2175                      .dwattr DW$167, DW_AT_name("year"), DW_AT_symbol_name("_year")
    2176                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2177                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2178              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2179                      .dwattr DW$168, DW_AT_name("control"), DW_AT_symbol_name("_control")
    2180                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2181                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2182              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2183                      .dwattr DW$169, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
    2184                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2185                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2186              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2187                      .dwattr DW$170, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
    2188                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2189                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2190                      .dwendtag DW$T$38
    2191              
    2192              DW$T$101        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$39)
    2193                      .dwattr DW$T$101, DW_AT_language(DW_LANG_C)
    2194              
    2195              DW$T$42 .dwtag  DW_TAG_structure_type
    2196                      .dwattr DW$T$42, DW_AT_name("tag_allsensorstruct")
    2197                      .dwattr DW$T$42, DW_AT_byte_size(0x2d)
    2198              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2199                      .dwattr DW$171, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    2200                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2201                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2202              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2203                      .dwattr DW$172, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    2204                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2205                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2206              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2207                      .dwattr DW$173, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    2208                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2209                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2210              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2211                      .dwattr DW$174, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    2212                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2213                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2214              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2215                      .dwattr DW$175, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    2216                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2217                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2218              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   48

    2219                      .dwattr DW$176, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    2220                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2221                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2222              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2223                      .dwattr DW$177, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    2224                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2225                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2226              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2227                      .dwattr DW$178, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    2228                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2229                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2230              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2231                      .dwattr DW$179, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    2232                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2233                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2234              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2235                      .dwattr DW$180, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    2236                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2237                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2238              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2239                      .dwattr DW$181, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2240                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2241                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2242              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2243                      .dwattr DW$182, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    2244                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2245                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2246              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2247                      .dwattr DW$183, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    2248                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2249                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2250              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2251                      .dwattr DW$184, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    2252                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2253                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2254              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2255                      .dwattr DW$185, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2256                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2257                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2258              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2259                      .dwattr DW$186, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2260                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2261                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2262              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    2263                      .dwattr DW$187, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    2264                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2265                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2266              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2267                      .dwattr DW$188, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    2268                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2269                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2270              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2271                      .dwattr DW$189, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    2272                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2273                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   49

    2274              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2275                      .dwattr DW$190, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    2276                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2277                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2278              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2279                      .dwattr DW$191, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    2280                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2281                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2282              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2283                      .dwattr DW$192, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    2284                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2285                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2286              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2287                      .dwattr DW$193, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    2288                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2289                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2290              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2291                      .dwattr DW$194, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    2292                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2293                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2294              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2295                      .dwattr DW$195, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    2296                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2297                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2298              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2299                      .dwattr DW$196, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    2300                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2301                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2302              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2303                      .dwattr DW$197, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    2304                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2305                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2306              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2307                      .dwattr DW$198, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    2308                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2309                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2310              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2311                      .dwattr DW$199, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    2312                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2313                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2314              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    2315                      .dwattr DW$200, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2316                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2317                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2318              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2319                      .dwattr DW$201, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    2320                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2321                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2322              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2323                      .dwattr DW$202, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    2324                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2325                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2326                      .dwendtag DW$T$42
    2327              
    2328              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   50

    2329              DW$T$49 .dwtag  DW_TAG_structure_type
    2330                      .dwattr DW$T$49, DW_AT_name("tag_configstruct")
    2331                      .dwattr DW$T$49, DW_AT_byte_size(0x18)
    2332              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    2333                      .dwattr DW$203, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    2334                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2335                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2336              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    2337                      .dwattr DW$204, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    2338                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2339                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2340              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    2341                      .dwattr DW$205, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    2342                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2343                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2344              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    2345                      .dwattr DW$206, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    2346                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2347                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2348              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2349                      .dwattr DW$207, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    2350                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2351                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2352              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    2353                      .dwattr DW$208, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    2354                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2355                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2356                      .dwendtag DW$T$49
    2357              
    2358              
    2359              DW$T$52 .dwtag  DW_TAG_structure_type
    2360                      .dwattr DW$T$52, DW_AT_name("tag_uartreadC")
    2361                      .dwattr DW$T$52, DW_AT_byte_size(0x68)
    2362              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2363                      .dwattr DW$209, DW_AT_name("receiveINTR"), DW_AT_symbol_name("_receiveINTR")
    2364                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2365                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2366              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2367                      .dwattr DW$210, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
    2368                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2369                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2370              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2371                      .dwattr DW$211, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    2372                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2373                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2374              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2375                      .dwattr DW$212, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    2376                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2377                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2378              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    2379                      .dwattr DW$213, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    2380                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x67]
    2381                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2382                      .dwendtag DW$T$52
    2383              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   51

    2384              
    2385              DW$T$54 .dwtag  DW_TAG_structure_type
    2386                      .dwattr DW$T$54, DW_AT_byte_size(0x13)
    2387              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2388                      .dwattr DW$214, DW_AT_name("count"), DW_AT_symbol_name("_count")
    2389                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2390                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2391              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2392                      .dwattr DW$215, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
    2393                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2394                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2395              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2396                      .dwattr DW$216, DW_AT_name("previouscount"), DW_AT_symbol_name("_previouscount")
    2397                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2398                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2399              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2400                      .dwattr DW$217, DW_AT_name("sampleperiod"), DW_AT_symbol_name("_sampleperiod")
    2401                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2402                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2403              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2404                      .dwattr DW$218, DW_AT_name("period"), DW_AT_symbol_name("_period")
    2405                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2406                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2407              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    2408                      .dwattr DW$219, DW_AT_name("stable"), DW_AT_symbol_name("_stable")
    2409                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2410                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2411                      .dwendtag DW$T$54
    2412              
    2413              
    2414              DW$T$57 .dwtag  DW_TAG_structure_type
    2415                      .dwattr DW$T$57, DW_AT_name("tag_speedcompstruct")
    2416                      .dwattr DW$T$57, DW_AT_byte_size(0x19)
    2417              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2418                      .dwattr DW$220, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
    2419                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2421              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2422                      .dwattr DW$221, DW_AT_name("status"), DW_AT_symbol_name("_status")
    2423                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2424                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2425              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    2426                      .dwattr DW$222, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
    2427                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2428                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2429              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2430                      .dwattr DW$223, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
    2431                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2432                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2433              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2434                      .dwattr DW$224, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
    2435                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2436                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2437              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2438                      .dwattr DW$225, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   52

    2439                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2440                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2441              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2442                      .dwattr DW$226, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
    2443                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2444                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2445              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2446                      .dwattr DW$227, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
    2447                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2448                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2449              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2450                      .dwattr DW$228, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
    2451                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2452                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2453              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2454                      .dwattr DW$229, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
    2455                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2456                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2457              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2458                      .dwattr DW$230, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
    2459                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2460                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2461              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2462                      .dwattr DW$231, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2463                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2464                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2465              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2466                      .dwattr DW$232, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    2467                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2468                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2469              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2470                      .dwattr DW$233, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    2471                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2472                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2473              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2474                      .dwattr DW$234, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    2475                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2476                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2477              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2478                      .dwattr DW$235, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    2479                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2480                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2481              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2482                      .dwattr DW$236, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    2483                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2484                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2485              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2486                      .dwattr DW$237, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    2487                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2488                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2489              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2490                      .dwattr DW$238, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    2491                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2492                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2493              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   53

    2494                      .dwattr DW$239, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    2495                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2496                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2497                      .dwendtag DW$T$57
    2498              
    2499              
    2500              DW$T$60 .dwtag  DW_TAG_structure_type
    2501                      .dwattr DW$T$60, DW_AT_name("tag_prewarnstruct")
    2502                      .dwattr DW$T$60, DW_AT_byte_size(0xaa)
    2503              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    2504                      .dwattr DW$240, DW_AT_name("prelevel"), DW_AT_symbol_name("_prelevel")
    2505                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2506                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2507              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    2508                      .dwattr DW$241, DW_AT_name("average"), DW_AT_symbol_name("_average")
    2509                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2510                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2511              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    2512                      .dwattr DW$242, DW_AT_name("calcacc"), DW_AT_symbol_name("_calcacc")
    2513                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2514                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2515              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    2516                      .dwattr DW$243, DW_AT_name("points"), DW_AT_symbol_name("_points")
    2517                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2518                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2519              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2520                      .dwattr DW$244, DW_AT_name("prewarncompleteflag"), DW_AT_symbol_name("_prewarncompleteflag")
    2521                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2522                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2523              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2524                      .dwattr DW$245, DW_AT_name("init"), DW_AT_symbol_name("_init")
    2525                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xa9]
    2526                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2527                      .dwendtag DW$T$60
    2528              
    2529              
    2530              DW$T$61 .dwtag  DW_TAG_structure_type
    2531                      .dwattr DW$T$61, DW_AT_name("tag_offsetstruct")
    2532                      .dwattr DW$T$61, DW_AT_byte_size(0x1c)
    2533              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    2534                      .dwattr DW$246, DW_AT_name("val"), DW_AT_symbol_name("_val")
    2535                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2536                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2537                      .dwendtag DW$T$61
    2538              
    2539              
    2540              DW$T$62 .dwtag  DW_TAG_structure_type
    2541                      .dwattr DW$T$62, DW_AT_name("tag_wiosettingsstruct")
    2542                      .dwattr DW$T$62, DW_AT_byte_size(0x0a)
    2543              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2544                      .dwattr DW$247, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    2545                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2547              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2548                      .dwattr DW$248, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   54

    2549                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2550                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2551              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2552                      .dwattr DW$249, DW_AT_name("alarmupperlevel"), DW_AT_symbol_name("_alarmupperlevel")
    2553                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2554                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2555              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2556                      .dwattr DW$250, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2557                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2558                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2559              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2560                      .dwattr DW$251, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
    2561                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2562                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2563              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2564                      .dwattr DW$252, DW_AT_name("scaledmin"), DW_AT_symbol_name("_scaledmin")
    2565                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2566                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2567              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2568                      .dwattr DW$253, DW_AT_name("scaledmax"), DW_AT_symbol_name("_scaledmax")
    2569                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2570                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2571              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2572                      .dwattr DW$254, DW_AT_name("units"), DW_AT_symbol_name("_units")
    2573                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2574                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2575              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2576                      .dwattr DW$255, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2577                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2578                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2579              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2580                      .dwattr DW$256, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    2581                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2582                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2583                      .dwendtag DW$T$62
    2584              
    2585              
    2586              DW$T$64 .dwtag  DW_TAG_structure_type
    2587                      .dwattr DW$T$64, DW_AT_name("tag_sdsettingsstruct")
    2588                      .dwattr DW$T$64, DW_AT_byte_size(0x04)
    2589              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2590                      .dwattr DW$257, DW_AT_name("present"), DW_AT_symbol_name("_present")
    2591                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2592                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2593              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2594                      .dwattr DW$258, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
    2595                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2596                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2597              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2598                      .dwattr DW$259, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
    2599                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2600                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2601              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    2602                      .dwattr DW$260, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
    2603                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   55

    2604                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2605                      .dwendtag DW$T$64
    2606              
    2607              DW$T$76 .dwtag  DW_TAG_typedef, DW_AT_name("VECTORS"), DW_AT_type(*DW$T$75)
    2608                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    2609              
    2610              DW$T$53 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    2611                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
    2612                      .dwattr DW$T$53, DW_AT_byte_size(0x0e)
    2613              DW$261  .dwtag  DW_TAG_subrange_type
    2614                      .dwattr DW$261, DW_AT_upper_bound(0x0d)
    2615                      .dwendtag DW$T$53
    2616              
    2617              
    2618              DW$T$58 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    2619                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    2620                      .dwattr DW$T$58, DW_AT_byte_size(0x1c)
    2621              DW$262  .dwtag  DW_TAG_subrange_type
    2622                      .dwattr DW$262, DW_AT_upper_bound(0x1b)
    2623                      .dwendtag DW$T$58
    2624              
    2625              
    2626              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2627                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2628                      .dwattr DW$T$21, DW_AT_byte_size(0x0e)
    2629              DW$263  .dwtag  DW_TAG_subrange_type
    2630                      .dwattr DW$263, DW_AT_upper_bound(0x0d)
    2631                      .dwendtag DW$T$21
    2632              
    2633              
    2634              DW$T$50 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2635                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    2636                      .dwattr DW$T$50, DW_AT_byte_size(0x64)
    2637              DW$264  .dwtag  DW_TAG_subrange_type
    2638                      .dwattr DW$264, DW_AT_upper_bound(0x63)
    2639                      .dwendtag DW$T$50
    2640              
    2641              
    2642              DW$T$56 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2643                      .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    2644                      .dwattr DW$T$56, DW_AT_byte_size(0x06)
    2645              DW$265  .dwtag  DW_TAG_subrange_type
    2646                      .dwattr DW$265, DW_AT_upper_bound(0x02)
    2647              DW$266  .dwtag  DW_TAG_subrange_type
    2648                      .dwattr DW$266, DW_AT_upper_bound(0x01)
    2649                      .dwendtag DW$T$56
    2650              
    2651              
    2652              DW$T$59 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
    2653                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    2654                      .dwattr DW$T$59, DW_AT_byte_size(0x38)
    2655              DW$267  .dwtag  DW_TAG_subrange_type
    2656                      .dwattr DW$267, DW_AT_upper_bound(0x1b)
    2657                      .dwendtag DW$T$59
    2658              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   56

    2659              
    2660              DW$T$19 .dwtag  DW_TAG_structure_type
    2661                      .dwattr DW$T$19, DW_AT_byte_size(0x02)
    2662              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2663                      .dwattr DW$268, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    2664                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2665                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2666              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2667                      .dwattr DW$269, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2668                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2669                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2670                      .dwendtag DW$T$19
    2671              
    2672              
    2673              DW$T$22 .dwtag  DW_TAG_structure_type
    2674                      .dwattr DW$T$22, DW_AT_byte_size(0x1e)
    2675              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2676                      .dwattr DW$270, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    2677                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2678                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2679              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2680                      .dwattr DW$271, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    2681                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2682                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2683              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2684                      .dwattr DW$272, DW_AT_name("chan18ma"), DW_AT_symbol_name("_chan18ma")
    2685                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2686                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2687              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2688                      .dwattr DW$273, DW_AT_name("notused"), DW_AT_symbol_name("_notused")
    2689                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2690                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2691                      .dwendtag DW$T$22
    2692              
    2693              
    2694              DW$T$23 .dwtag  DW_TAG_structure_type
    2695                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    2696              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2697                      .dwattr DW$274, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    2698                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2700                      .dwendtag DW$T$23
    2701              
    2702              
    2703              DW$T$26 .dwtag  DW_TAG_structure_type
    2704                      .dwattr DW$T$26, DW_AT_byte_size(0x0b)
    2705              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2706                      .dwattr DW$275, DW_AT_name("calprtzero"), DW_AT_symbol_name("_calprtzero")
    2707                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2708                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2709              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2710                      .dwattr DW$276, DW_AT_name("calprtfullscale"), DW_AT_symbol_name("_calprtfullscale")
    2711                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2712                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2713              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   57

    2714                      .dwattr DW$277, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    2715                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2716                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2717              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2718                      .dwattr DW$278, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2719                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2720                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2721              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2722                      .dwattr DW$279, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    2723                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2724                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2725                      .dwendtag DW$T$26
    2726              
    2727              
    2728              DW$T$27 .dwtag  DW_TAG_structure_type
    2729                      .dwattr DW$T$27, DW_AT_byte_size(0x03)
    2730              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2731                      .dwattr DW$280, DW_AT_name("mainrate"), DW_AT_symbol_name("_mainrate")
    2732                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2733                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2734              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2735                      .dwattr DW$281, DW_AT_name("trendrate"), DW_AT_symbol_name("_trendrate")
    2736                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2737                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2738              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2739                      .dwattr DW$282, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2740                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2741                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2742                      .dwendtag DW$T$27
    2743              
    2744              
    2745              DW$T$28 .dwtag  DW_TAG_structure_type
    2746                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    2747              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2748                      .dwattr DW$283, DW_AT_name("address"), DW_AT_symbol_name("_address")
    2749                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2750                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2751                      .dwendtag DW$T$28
    2752              
    2753              
    2754              DW$T$29 .dwtag  DW_TAG_structure_type
    2755                      .dwattr DW$T$29, DW_AT_byte_size(0x02)
    2756              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2757                      .dwattr DW$284, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    2758                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2759                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2760              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2761                      .dwattr DW$285, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2762                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2763                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2764                      .dwendtag DW$T$29
    2765              
    2766              
    2767              DW$T$30 .dwtag  DW_TAG_structure_type
    2768                      .dwattr DW$T$30, DW_AT_byte_size(0x03)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   58

    2769              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2770                      .dwattr DW$286, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    2771                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2773              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2774                      .dwattr DW$287, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    2775                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2776                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2777              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2778                      .dwattr DW$288, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    2779                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2780                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2781                      .dwendtag DW$T$30
    2782              
    2783              
    2784              DW$T$31 .dwtag  DW_TAG_structure_type
    2785                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    2786              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2787                      .dwattr DW$289, DW_AT_name("rate"), DW_AT_symbol_name("_rate")
    2788                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2789                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2790                      .dwendtag DW$T$31
    2791              
    2792              
    2793              DW$T$32 .dwtag  DW_TAG_structure_type
    2794                      .dwattr DW$T$32, DW_AT_byte_size(0x02)
    2795              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2796                      .dwattr DW$290, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    2797                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2798                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2799              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2800                      .dwattr DW$291, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    2801                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2802                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2803                      .dwendtag DW$T$32
    2804              
    2805              
    2806              DW$T$33 .dwtag  DW_TAG_structure_type
    2807                      .dwattr DW$T$33, DW_AT_byte_size(0x04)
    2808              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2809                      .dwattr DW$292, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    2810                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2811                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2812              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2813                      .dwattr DW$293, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    2814                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2815                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2816              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2817                      .dwattr DW$294, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    2818                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2819                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2820              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2821                      .dwattr DW$295, DW_AT_name("notused4"), DW_AT_symbol_name("_notused4")
    2822                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2823                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   59

    2824                      .dwendtag DW$T$33
    2825              
    2826              
    2827              DW$T$34 .dwtag  DW_TAG_structure_type
    2828                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    2829              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2830                      .dwattr DW$296, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    2831                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2832                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2833                      .dwendtag DW$T$34
    2834              
    2835              
    2836              DW$T$35 .dwtag  DW_TAG_structure_type
    2837                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    2838              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2839                      .dwattr DW$297, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    2840                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2841                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2842                      .dwendtag DW$T$35
    2843              
    2844              
    2845              DW$T$36 .dwtag  DW_TAG_structure_type
    2846                      .dwattr DW$T$36, DW_AT_byte_size(0x01)
    2847              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2848                      .dwattr DW$298, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    2849                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2850                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2851                      .dwendtag DW$T$36
    2852              
    2853              
    2854              DW$T$39 .dwtag  DW_TAG_structure_type
    2855                      .dwattr DW$T$39, DW_AT_name("tag_timers")
    2856                      .dwattr DW$T$39, DW_AT_byte_size(0x4c)
    2857              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2858                      .dwattr DW$299, DW_AT_name("update"), DW_AT_symbol_name("_update")
    2859                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2860                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2861              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2862                      .dwattr DW$300, DW_AT_name("general"), DW_AT_symbol_name("_general")
    2863                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2864                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2865              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2866                      .dwattr DW$301, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    2867                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2868                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2869              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2870                      .dwattr DW$302, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    2871                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2872                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2873              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2874                      .dwattr DW$303, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    2875                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2876                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2877              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2878                      .dwattr DW$304, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   60

    2879                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2880                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2881              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2882                      .dwattr DW$305, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    2883                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2884                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2885              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2886                      .dwattr DW$306, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    2887                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2888                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2889              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2890                      .dwattr DW$307, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    2891                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2892                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2893              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2894                      .dwattr DW$308, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    2895                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2896                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2897              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2898                      .dwattr DW$309, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    2899                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2900                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2901              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2902                      .dwattr DW$310, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    2903                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2904                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2905              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2906                      .dwattr DW$311, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    2907                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2908                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2909              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2910                      .dwattr DW$312, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    2911                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2912                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2913              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2914                      .dwattr DW$313, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    2915                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2916                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2917              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2918                      .dwattr DW$314, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2919                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2920                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2921              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2922                      .dwattr DW$315, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    2923                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2924                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2925              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2926                      .dwattr DW$316, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    2927                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2928                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2929              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2930                      .dwattr DW$317, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    2931                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2932                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2933              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   61

    2934                      .dwattr DW$318, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    2935                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2936                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2937              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2938                      .dwattr DW$319, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    2939                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2940                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2941              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2942                      .dwattr DW$320, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    2943                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2944                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2945              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2946                      .dwattr DW$321, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    2947                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2948                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2949              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2950                      .dwattr DW$322, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    2951                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2952                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2953              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2954                      .dwattr DW$323, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    2955                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2956                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2957              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2958                      .dwattr DW$324, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    2959                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2960                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2961              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2962                      .dwattr DW$325, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    2963                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2964                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2965              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2966                      .dwattr DW$326, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    2967                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2968                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2969              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2970                      .dwattr DW$327, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    2971                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2972                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2973              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2974                      .dwattr DW$328, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    2975                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2976                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2977              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2978                      .dwattr DW$329, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    2979                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2980                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2981              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2982                      .dwattr DW$330, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    2983                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2984                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2985              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2986                      .dwattr DW$331, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    2987                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    2988                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:30 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
setup.asm                                                            PAGE   62

    2989              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2990                      .dwattr DW$332, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    2991                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2992                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2993              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2994                      .dwattr DW$333, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    2995                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2996                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2997              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2998                      .dwattr DW$334, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
