TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:31 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("slave485.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$3)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    2230              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2231                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2232                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2233              DW$T$50 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
    2234                      .dwattr DW$T$50, DW_AT_address_class(0x16)
    2235              
    2236              DW$T$86 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
    2237                      .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    2238              DW$162  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2239                      .dwendtag DW$T$86
    2240              
    2241              DW$163  .dwtag  DW_TAG_far_type
    2242                      .dwattr DW$163, DW_AT_type(*DW$T$11)
    2243              DW$T$88 .dwtag  DW_TAG_const_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   48

    2244                      .dwattr DW$T$88, DW_AT_type(*DW$163)
    2245              
    2246              DW$T$89 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2247                      .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    2248                      .dwattr DW$T$89, DW_AT_byte_size(0x64)
    2249              DW$164  .dwtag  DW_TAG_subrange_type
    2250                      .dwattr DW$164, DW_AT_upper_bound(0x63)
    2251                      .dwendtag DW$T$89
    2252              
    2253              DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
    2254                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    2255              DW$T$93 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$92)
    2256                      .dwattr DW$T$93, DW_AT_address_class(0x16)
    2257              
    2258              DW$T$94 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$93)
    2259                      .dwattr DW$T$94, DW_AT_language(DW_LANG_C)
    2260              DW$165  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2261                      .dwendtag DW$T$94
    2262              
    2263              
    2264              DW$T$95 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$92)
    2265                      .dwattr DW$T$95, DW_AT_language(DW_LANG_C)
    2266                      .dwattr DW$T$95, DW_AT_byte_size(0x1c)
    2267              DW$166  .dwtag  DW_TAG_subrange_type
    2268                      .dwattr DW$166, DW_AT_upper_bound(0x1b)
    2269                      .dwendtag DW$T$95
    2270              
    2271              DW$T$100        .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$21)
    2272                      .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    2273              DW$T$101        .dwtag  DW_TAG_typedef, DW_AT_name("safestruct1struct"), DW_AT_type(*DW$T$25)
    2274                      .dwattr DW$T$101, DW_AT_language(DW_LANG_C)
    2275              DW$T$102        .dwtag  DW_TAG_typedef, DW_AT_name("safestruct2struct"), DW_AT_type(*DW$T$38)
    2276                      .dwattr DW$T$102, DW_AT_language(DW_LANG_C)
    2277              DW$167  .dwtag  DW_TAG_far_type
    2278                      .dwattr DW$167, DW_AT_type(*DW$T$103)
    2279              DW$T$104        .dwtag  DW_TAG_volatile_type
    2280                      .dwattr DW$T$104, DW_AT_type(*DW$167)
    2281              DW$T$106        .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$42)
    2282                      .dwattr DW$T$106, DW_AT_language(DW_LANG_C)
    2283              DW$T$108        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$49)
    2284                      .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
    2285              DW$T$109        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadA"), DW_AT_type(*DW$T$53)
    2286                      .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
    2287              
    2288              DW$T$112        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$111)
    2289                      .dwattr DW$T$112, DW_AT_language(DW_LANG_C)
    2290                      .dwattr DW$T$112, DW_AT_byte_size(0x1f8)
    2291              DW$168  .dwtag  DW_TAG_subrange_type
    2292                      .dwattr DW$168, DW_AT_upper_bound(0x1b)
    2293                      .dwendtag DW$T$112
    2294              
    2295              DW$T$115        .dwtag  DW_TAG_typedef, DW_AT_name("reprogramstruct"), DW_AT_type(*DW$T$60)
    2296                      .dwattr DW$T$115, DW_AT_language(DW_LANG_C)
    2297              DW$T$116        .dwtag  DW_TAG_typedef, DW_AT_name("slavecmdstruct"), DW_AT_type(*DW$T$62)
    2298                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   49

    2299              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    2300                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2301                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    2302              DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("status3struct"), DW_AT_type(*DW$T$19)
    2303                      .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
    2304              
    2305              DW$T$21 .dwtag  DW_TAG_structure_type
    2306                      .dwattr DW$T$21, DW_AT_name("tag_settingsstruct")
    2307                      .dwattr DW$T$21, DW_AT_byte_size(0x24)
    2308              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2309                      .dwattr DW$169, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    2310                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2311                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2312              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2313                      .dwattr DW$170, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    2314                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2315                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2316              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2317                      .dwattr DW$171, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    2318                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2319                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2320              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2321                      .dwattr DW$172, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    2322                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2323                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2324              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2325                      .dwattr DW$173, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    2326                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2327                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2328              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2329                      .dwattr DW$174, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    2330                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2331                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2332              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2333                      .dwattr DW$175, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    2334                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2335                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2336              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2337                      .dwattr DW$176, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    2338                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2339                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2340              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2341                      .dwattr DW$177, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    2342                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2343                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2344              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2345                      .dwattr DW$178, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    2346                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2347                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2348              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2349                      .dwattr DW$179, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    2350                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2351                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2352              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2353                      .dwattr DW$180, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   50

    2354                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2355                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2356              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2357                      .dwattr DW$181, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    2358                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2359                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2360              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2361                      .dwattr DW$182, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    2362                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2363                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2364              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2365                      .dwattr DW$183, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    2366                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2367                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2368              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2369                      .dwattr DW$184, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    2370                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2371                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2372              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2373                      .dwattr DW$185, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    2374                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2375                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2376              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2377                      .dwattr DW$186, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    2378                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2379                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2380              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2381                      .dwattr DW$187, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    2382                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2383                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2384              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2385                      .dwattr DW$188, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    2386                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2387                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2388              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2389                      .dwattr DW$189, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    2390                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2391                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2392              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2393                      .dwattr DW$190, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    2394                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2395                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2396              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2397                      .dwattr DW$191, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    2398                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2399                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2400              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2401                      .dwattr DW$192, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    2402                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2403                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2404              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2405                      .dwattr DW$193, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    2406                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2407                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2408              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   51

    2409                      .dwattr DW$194, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2410                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2411                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2412              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2413                      .dwattr DW$195, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    2414                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2415                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2416              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2417                      .dwattr DW$196, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2418                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2419                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2420              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2421                      .dwattr DW$197, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2422                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2423                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2424              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2425                      .dwattr DW$198, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    2426                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2427                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2428              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2429                      .dwattr DW$199, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    2430                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2431                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2432              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2433                      .dwattr DW$200, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    2434                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2435                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2436              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2437                      .dwattr DW$201, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    2438                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2439                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2440              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2441                      .dwattr DW$202, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    2442                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2443                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2444              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2445                      .dwattr DW$203, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2446                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2447                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2448                      .dwendtag DW$T$21
    2449              
    2450              
    2451              DW$T$25 .dwtag  DW_TAG_structure_type
    2452                      .dwattr DW$T$25, DW_AT_name("tag_safestruct1struct")
    2453                      .dwattr DW$T$25, DW_AT_byte_size(0x1f)
    2454              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2455                      .dwattr DW$204, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    2456                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2458              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2459                      .dwattr DW$205, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    2460                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2461                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2462                      .dwendtag DW$T$25
    2463              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   52

    2464              
    2465              DW$T$38 .dwtag  DW_TAG_structure_type
    2466                      .dwattr DW$T$38, DW_AT_name("tag_safestruct2struct")
    2467                      .dwattr DW$T$38, DW_AT_byte_size(0x1e)
    2468              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2469                      .dwattr DW$206, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    2470                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2471                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2472              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    2473                      .dwattr DW$207, DW_AT_name("log"), DW_AT_symbol_name("_log")
    2474                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2475                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2476              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2477                      .dwattr DW$208, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
    2478                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2479                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2480              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    2481                      .dwattr DW$209, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    2482                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2483                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2484              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2485                      .dwattr DW$210, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    2486                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2487                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2488              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    2489                      .dwattr DW$211, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
    2490                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2491                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2492              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2493                      .dwattr DW$212, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
    2494                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2495                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2496              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2497                      .dwattr DW$213, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
    2498                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2499                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2500              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2501                      .dwattr DW$214, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    2502                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2503                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2504              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2505                      .dwattr DW$215, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    2506                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2507                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2508              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2509                      .dwattr DW$216, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
    2510                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2511                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2512                      .dwendtag DW$T$38
    2513              
    2514              DW$T$103        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$39)
    2515                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    2516              
    2517              DW$T$42 .dwtag  DW_TAG_structure_type
    2518                      .dwattr DW$T$42, DW_AT_name("tag_allsensorstruct")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   53

    2519                      .dwattr DW$T$42, DW_AT_byte_size(0x2d)
    2520              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2521                      .dwattr DW$217, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    2522                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2524              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2525                      .dwattr DW$218, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    2526                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2527                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2528              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2529                      .dwattr DW$219, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    2530                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2531                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2532              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2533                      .dwattr DW$220, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    2534                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2535                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2536              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2537                      .dwattr DW$221, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    2538                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2539                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2540              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2541                      .dwattr DW$222, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    2542                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2543                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2544              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2545                      .dwattr DW$223, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    2546                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2547                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2548              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2549                      .dwattr DW$224, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    2550                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2551                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2552              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2553                      .dwattr DW$225, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    2554                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2555                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2556              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2557                      .dwattr DW$226, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    2558                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2559                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2560              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2561                      .dwattr DW$227, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    2562                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2563                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2564              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2565                      .dwattr DW$228, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    2566                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2567                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2568              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2569                      .dwattr DW$229, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    2570                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2571                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2572              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2573                      .dwattr DW$230, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   54

    2574                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2575                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2576              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2577                      .dwattr DW$231, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    2578                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2579                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2580              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2581                      .dwattr DW$232, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    2582                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2583                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2584              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    2585                      .dwattr DW$233, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    2586                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2587                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2588              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2589                      .dwattr DW$234, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    2590                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2591                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2592              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2593                      .dwattr DW$235, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    2594                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2595                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2596              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2597                      .dwattr DW$236, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    2598                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2599                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2600              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2601                      .dwattr DW$237, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    2602                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2603                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2604              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2605                      .dwattr DW$238, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    2606                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2607                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2608              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2609                      .dwattr DW$239, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    2610                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2611                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2612              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2613                      .dwattr DW$240, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    2614                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2615                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2616              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2617                      .dwattr DW$241, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    2618                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2619                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2620              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2621                      .dwattr DW$242, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    2622                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2623                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2624              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2625                      .dwattr DW$243, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    2626                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2627                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2628              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   55

    2629                      .dwattr DW$244, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    2630                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2631                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2632              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2633                      .dwattr DW$245, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    2634                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2635                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2636              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    2637                      .dwattr DW$246, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    2638                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2639                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2640              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2641                      .dwattr DW$247, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    2642                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2643                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2644              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2645                      .dwattr DW$248, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    2646                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2647                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2648                      .dwendtag DW$T$42
    2649              
    2650              
    2651              DW$T$49 .dwtag  DW_TAG_structure_type
    2652                      .dwattr DW$T$49, DW_AT_name("tag_configstruct")
    2653                      .dwattr DW$T$49, DW_AT_byte_size(0x18)
    2654              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    2655                      .dwattr DW$249, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    2656                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2657                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2658              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    2659                      .dwattr DW$250, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    2660                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2661                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2662              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    2663                      .dwattr DW$251, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    2664                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2665                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2666              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    2667                      .dwattr DW$252, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    2668                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2669                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2670              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2671                      .dwattr DW$253, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    2672                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2673                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2674              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    2675                      .dwattr DW$254, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    2676                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2677                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2678                      .dwendtag DW$T$49
    2679              
    2680              
    2681              DW$T$53 .dwtag  DW_TAG_structure_type
    2682                      .dwattr DW$T$53, DW_AT_name("tag_uartreadA")
    2683                      .dwattr DW$T$53, DW_AT_byte_size(0x96)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   56

    2684              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2685                      .dwattr DW$255, DW_AT_name("headptr"), DW_AT_symbol_name("_headptr")
    2686                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2688              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2689                      .dwattr DW$256, DW_AT_name("tailptr"), DW_AT_symbol_name("_tailptr")
    2690                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2691                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2692              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2693                      .dwattr DW$257, DW_AT_name("eobuf"), DW_AT_symbol_name("_eobuf")
    2694                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2695                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2696              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2697                      .dwattr DW$258, DW_AT_name("charcount"), DW_AT_symbol_name("_charcount")
    2698                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2699                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2700              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2701                      .dwattr DW$259, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
    2702                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2703                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2704              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2705                      .dwattr DW$260, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    2706                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2707                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2708              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    2709                      .dwattr DW$261, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    2710                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2711                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2712              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    2713                      .dwattr DW$262, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    2714                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x95]
    2715                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2716                      .dwendtag DW$T$53
    2717              
    2718              DW$T$111        .dwtag  DW_TAG_typedef, DW_AT_name("sensorstruct"), DW_AT_type(*DW$T$58)
    2719                      .dwattr DW$T$111, DW_AT_language(DW_LANG_C)
    2720              
    2721              DW$T$60 .dwtag  DW_TAG_structure_type
    2722                      .dwattr DW$T$60, DW_AT_name("tag_reprogramstruct")
    2723                      .dwattr DW$T$60, DW_AT_byte_size(0x10)
    2724              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    2725                      .dwattr DW$263, DW_AT_name("spi"), DW_AT_symbol_name("_spi")
    2726                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2727                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2728              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    2729                      .dwattr DW$264, DW_AT_name("programkey"), DW_AT_symbol_name("_programkey")
    2730                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2731                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2732              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2733                      .dwattr DW$265, DW_AT_name("reprogramnow"), DW_AT_symbol_name("_reprogramnow")
    2734                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2735                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2736              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2737                      .dwattr DW$266, DW_AT_name("slavecmdok"), DW_AT_symbol_name("_slavecmdok")
    2738                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   57

    2739                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2740              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2741                      .dwattr DW$267, DW_AT_name("slavestatus"), DW_AT_symbol_name("_slavestatus")
    2742                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2743                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2744              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2745                      .dwattr DW$268, DW_AT_name("slavetx"), DW_AT_symbol_name("_slavetx")
    2746                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2747                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2748              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2749                      .dwattr DW$269, DW_AT_name("slaverx"), DW_AT_symbol_name("_slaverx")
    2750                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2751                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2752              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2753                      .dwattr DW$270, DW_AT_name("slaveset"), DW_AT_symbol_name("_slaveset")
    2754                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2755                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2756                      .dwendtag DW$T$60
    2757              
    2758              
    2759              DW$T$62 .dwtag  DW_TAG_structure_type
    2760                      .dwattr DW$T$62, DW_AT_name("tag_slavecmdstruct")
    2761                      .dwattr DW$T$62, DW_AT_byte_size(0x48)
    2762              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2763                      .dwattr DW$271, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
    2764                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2765                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2766              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2767                      .dwattr DW$272, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
    2768                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2769                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2770              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2771                      .dwattr DW$273, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
    2772                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2773                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2774              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2775                      .dwattr DW$274, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
    2776                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2777                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2778              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2779                      .dwattr DW$275, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
    2780                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2781                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2782              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    2783                      .dwattr DW$276, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
    2784                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2785                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2786              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2787                      .dwattr DW$277, DW_AT_name("txmode"), DW_AT_symbol_name("_txmode")
    2788                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2789                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2790              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2791                      .dwattr DW$278, DW_AT_name("slavelost"), DW_AT_symbol_name("_slavelost")
    2792                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2793                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   58

    2794              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2795                      .dwattr DW$279, DW_AT_name("slavenotready"), DW_AT_symbol_name("_slavenotready")
    2796                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2797                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2798                      .dwendtag DW$T$62
    2799              
    2800              
    2801              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2802                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    2803                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    2804              DW$280  .dwtag  DW_TAG_subrange_type
    2805                      .dwattr DW$280, DW_AT_upper_bound(0x0d)
    2806                      .dwendtag DW$T$22
    2807              
    2808              
    2809              DW$T$51 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2810                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
    2811                      .dwattr DW$T$51, DW_AT_byte_size(0x8c)
    2812              DW$281  .dwtag  DW_TAG_subrange_type
    2813                      .dwattr DW$281, DW_AT_upper_bound(0x8b)
    2814                      .dwendtag DW$T$51
    2815              
    2816              
    2817              DW$T$61 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2818                      .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    2819                      .dwattr DW$T$61, DW_AT_byte_size(0x40)
    2820              DW$282  .dwtag  DW_TAG_subrange_type
    2821                      .dwattr DW$282, DW_AT_upper_bound(0x3f)
    2822                      .dwendtag DW$T$61
    2823              
    2824              
    2825              DW$T$19 .dwtag  DW_TAG_structure_type
    2826                      .dwattr DW$T$19, DW_AT_name("tag_status3struct")
    2827                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    2828              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2829                      .dwattr DW$283, DW_AT_name("nopulse"), DW_AT_symbol_name("_nopulse")
    2830                      .dwattr DW$283, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2831                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2832                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2833              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2834                      .dwattr DW$284, DW_AT_name("low"), DW_AT_symbol_name("_low")
    2835                      .dwattr DW$284, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2836                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2837                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2838              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2839                      .dwattr DW$285, DW_AT_name("high"), DW_AT_symbol_name("_high")
    2840                      .dwattr DW$285, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2841                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2842                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2843              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2844                      .dwattr DW$286, DW_AT_name("rpmoor"), DW_AT_symbol_name("_rpmoor")
    2845                      .dwattr DW$286, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2846                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2847                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2848              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   59

    2849                      .dwattr DW$287, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    2850                      .dwattr DW$287, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2851                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2852                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2853              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2854                      .dwattr DW$288, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    2855                      .dwattr DW$288, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2856                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2857                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2858              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2859                      .dwattr DW$289, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    2860                      .dwattr DW$289, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2861                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2862                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2863              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2864                      .dwattr DW$290, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    2865                      .dwattr DW$290, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2866                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2867                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2868              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2869                      .dwattr DW$291, DW_AT_name("nopulselatched"), DW_AT_symbol_name("_nopulselatched")
    2870                      .dwattr DW$291, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2871                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2872                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2873              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2874                      .dwattr DW$292, DW_AT_name("lowlatched"), DW_AT_symbol_name("_lowlatched")
    2875                      .dwattr DW$292, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2876                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2877                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2878              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2879                      .dwattr DW$293, DW_AT_name("highlatched"), DW_AT_symbol_name("_highlatched")
    2880                      .dwattr DW$293, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2881                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2882                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2883              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2884                      .dwattr DW$294, DW_AT_name("rpmoorlatched"), DW_AT_symbol_name("_rpmoorlatched")
    2885                      .dwattr DW$294, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2886                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2887                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2888              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2889                      .dwattr DW$295, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    2890                      .dwattr DW$295, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2891                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2892                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2893              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2894                      .dwattr DW$296, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    2895                      .dwattr DW$296, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2896                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2897                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2898              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2899                      .dwattr DW$297, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    2900                      .dwattr DW$297, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2901                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2902                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2903              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   60

    2904                      .dwattr DW$298, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    2905                      .dwattr DW$298, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2906                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2907                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2908                      .dwendtag DW$T$19
    2909              
    2910              
    2911              DW$T$20 .dwtag  DW_TAG_structure_type
    2912                      .dwattr DW$T$20, DW_AT_byte_size(0x02)
    2913              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2914                      .dwattr DW$299, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    2915                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2916                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2917              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2918                      .dwattr DW$300, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2919                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2920                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2921                      .dwendtag DW$T$20
    2922              
    2923              
    2924              DW$T$23 .dwtag  DW_TAG_structure_type
    2925                      .dwattr DW$T$23, DW_AT_byte_size(0x1e)
    2926              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2927                      .dwattr DW$301, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    2928                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2929                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2930              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2931                      .dwattr DW$302, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    2932                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2933                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2934              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2935                      .dwattr DW$303, DW_AT_name("chan18ma"), DW_AT_symbol_name("_chan18ma")
    2936                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2937                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2938              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2939                      .dwattr DW$304, DW_AT_name("notused"), DW_AT_symbol_name("_notused")
    2940                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2941                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2942                      .dwendtag DW$T$23
    2943              
    2944              
    2945              DW$T$24 .dwtag  DW_TAG_structure_type
    2946                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    2947              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2948                      .dwattr DW$305, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    2949                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2950                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2951                      .dwendtag DW$T$24
    2952              
    2953              
    2954              DW$T$27 .dwtag  DW_TAG_structure_type
    2955                      .dwattr DW$T$27, DW_AT_byte_size(0x0b)
    2956              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2957                      .dwattr DW$306, DW_AT_name("calprtzero"), DW_AT_symbol_name("_calprtzero")
    2958                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   61

    2959                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2960              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2961                      .dwattr DW$307, DW_AT_name("calprtfullscale"), DW_AT_symbol_name("_calprtfullscale")
    2962                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2963                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2964              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2965                      .dwattr DW$308, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    2966                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2967                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2968              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2969                      .dwattr DW$309, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2970                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2971                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2972              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2973                      .dwattr DW$310, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    2974                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2975                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2976                      .dwendtag DW$T$27
    2977              
    2978              
    2979              DW$T$28 .dwtag  DW_TAG_structure_type
    2980                      .dwattr DW$T$28, DW_AT_byte_size(0x03)
    2981              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2982                      .dwattr DW$311, DW_AT_name("mainrate"), DW_AT_symbol_name("_mainrate")
    2983                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2984                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2985              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2986                      .dwattr DW$312, DW_AT_name("trendrate"), DW_AT_symbol_name("_trendrate")
    2987                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2988                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2989              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2990                      .dwattr DW$313, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    2991                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2992                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2993                      .dwendtag DW$T$28
    2994              
    2995              
    2996              DW$T$29 .dwtag  DW_TAG_structure_type
    2997                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
    2998              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2999                      .dwattr DW$314, DW_AT_name("address"), DW_AT_symbol_name("_address")
    3000                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3001                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3002                      .dwendtag DW$T$29
    3003              
    3004              
    3005              DW$T$30 .dwtag  DW_TAG_structure_type
    3006                      .dwattr DW$T$30, DW_AT_byte_size(0x02)
    3007              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3008                      .dwattr DW$315, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    3009                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3010                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3011              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3012                      .dwattr DW$316, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    3013                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   62

    3014                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3015                      .dwendtag DW$T$30
    3016              
    3017              
    3018              DW$T$31 .dwtag  DW_TAG_structure_type
    3019                      .dwattr DW$T$31, DW_AT_byte_size(0x03)
    3020              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3021                      .dwattr DW$317, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    3022                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3023                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3024              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3025                      .dwattr DW$318, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    3026                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3027                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3028              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3029                      .dwattr DW$319, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    3030                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3031                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3032                      .dwendtag DW$T$31
    3033              
    3034              
    3035              DW$T$32 .dwtag  DW_TAG_structure_type
    3036                      .dwattr DW$T$32, DW_AT_byte_size(0x01)
    3037              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3038                      .dwattr DW$320, DW_AT_name("rate"), DW_AT_symbol_name("_rate")
    3039                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3040                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3041                      .dwendtag DW$T$32
    3042              
    3043              
    3044              DW$T$33 .dwtag  DW_TAG_structure_type
    3045                      .dwattr DW$T$33, DW_AT_byte_size(0x02)
    3046              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3047                      .dwattr DW$321, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    3048                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3049                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3050              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3051                      .dwattr DW$322, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    3052                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3053                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3054                      .dwendtag DW$T$33
    3055              
    3056              
    3057              DW$T$34 .dwtag  DW_TAG_structure_type
    3058                      .dwattr DW$T$34, DW_AT_byte_size(0x04)
    3059              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3060                      .dwattr DW$323, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    3061                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3062                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3063              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3064                      .dwattr DW$324, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    3065                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3066                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3067              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3068                      .dwattr DW$325, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   63

    3069                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3070                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3071              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3072                      .dwattr DW$326, DW_AT_name("notused4"), DW_AT_symbol_name("_notused4")
    3073                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3074                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3075                      .dwendtag DW$T$34
    3076              
    3077              
    3078              DW$T$35 .dwtag  DW_TAG_structure_type
    3079                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    3080              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3081                      .dwattr DW$327, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    3082                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3083                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3084                      .dwendtag DW$T$35
    3085              
    3086              
    3087              DW$T$36 .dwtag  DW_TAG_structure_type
    3088                      .dwattr DW$T$36, DW_AT_byte_size(0x01)
    3089              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3090                      .dwattr DW$328, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    3091                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3092                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3093                      .dwendtag DW$T$36
    3094              
    3095              
    3096              DW$T$37 .dwtag  DW_TAG_structure_type
    3097                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    3098              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3099                      .dwattr DW$329, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    3100                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3101                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3102                      .dwendtag DW$T$37
    3103              
    3104              
    3105              DW$T$39 .dwtag  DW_TAG_structure_type
    3106                      .dwattr DW$T$39, DW_AT_name("tag_timers")
    3107                      .dwattr DW$T$39, DW_AT_byte_size(0x4c)
    3108              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3109                      .dwattr DW$330, DW_AT_name("update"), DW_AT_symbol_name("_update")
    3110                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3111                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3112              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3113                      .dwattr DW$331, DW_AT_name("general"), DW_AT_symbol_name("_general")
    3114                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3115                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3116              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3117                      .dwattr DW$332, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    3118                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3119                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3120              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3121                      .dwattr DW$333, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    3122                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3123                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   64

    3124              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3125                      .dwattr DW$334, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    3126                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3127                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3128              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3129                      .dwattr DW$335, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    3130                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3131                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3132              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3133                      .dwattr DW$336, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    3134                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3135                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3136              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3137                      .dwattr DW$337, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    3138                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3139                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3140              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3141                      .dwattr DW$338, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    3142                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3143                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3144              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3145                      .dwattr DW$339, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    3146                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3147                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3148              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3149                      .dwattr DW$340, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    3150                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3151                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3152              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3153                      .dwattr DW$341, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    3154                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3155                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3156              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3157                      .dwattr DW$342, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    3158                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3159                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3160              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3161                      .dwattr DW$343, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    3162                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3163                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3164              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3165                      .dwattr DW$344, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    3166                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3167                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3168              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3169                      .dwattr DW$345, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    3170                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3171                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3172              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3173                      .dwattr DW$346, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    3174                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3175                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3176              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3177                      .dwattr DW$347, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    3178                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   65

    3179                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3180              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3181                      .dwattr DW$348, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    3182                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3183                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3184              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3185                      .dwattr DW$349, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    3186                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3187                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3188              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3189                      .dwattr DW$350, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    3190                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3191                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3192              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3193                      .dwattr DW$351, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    3194                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3195                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3196              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3197                      .dwattr DW$352, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    3198                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    3199                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3200              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3201                      .dwattr DW$353, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    3202                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3203                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3204              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3205                      .dwattr DW$354, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    3206                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3207                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3208              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3209                      .dwattr DW$355, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    3210                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3211                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3212              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3213                      .dwattr DW$356, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    3214                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3215                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3216              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3217                      .dwattr DW$357, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    3218                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3219                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3220              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3221                      .dwattr DW$358, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    3222                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    3223                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3224              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3225                      .dwattr DW$359, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    3226                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3227                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3228              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3229                      .dwattr DW$360, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    3230                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3231                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3232              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3233                      .dwattr DW$361, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   66

    3234                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3235                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3236              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3237                      .dwattr DW$362, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    3238                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    3239                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3240              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3241                      .dwattr DW$363, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    3242                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3243                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3244              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3245                      .dwattr DW$364, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    3246                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3247                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3248              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3249                      .dwattr DW$365, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    3250                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3251                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3252              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3253                      .dwattr DW$366, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    3254                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3255                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3256              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3257                      .dwattr DW$367, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    3258                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3259                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3260              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3261                      .dwattr DW$368, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    3262                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3263                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3264              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3265                      .dwattr DW$369, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    3266                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3267                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3268              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3269                      .dwattr DW$370, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    3270                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    3271                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3272              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3273                      .dwattr DW$371, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    3274                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3275                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3276              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3277                      .dwattr DW$372, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    3278                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3279                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3280                      .dwendtag DW$T$39
    3281              
    3282              
    3283              DW$T$40 .dwtag  DW_TAG_structure_type
    3284                      .dwattr DW$T$40, DW_AT_byte_size(0x01)
    3285              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3286                      .dwattr DW$373, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
    3287                      .dwattr DW$373, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3288                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   67

    3289                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3290              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3291                      .dwattr DW$374, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    3292                      .dwattr DW$374, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3293                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3294                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3295              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3296                      .dwattr DW$375, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
    3297                      .dwattr DW$375, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3298                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3299                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3300              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3301                      .dwattr DW$376, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
    3302                      .dwattr DW$376, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3303                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3304                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3305              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3306                      .dwattr DW$377, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    3307                      .dwattr DW$377, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    3308                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3309                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3310                      .dwendtag DW$T$40
    3311              
    3312              
    3313              DW$T$41 .dwtag  DW_TAG_structure_type
    3314                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    3315              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3316                      .dwattr DW$378, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
    3317                      .dwattr DW$378, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3318                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3319                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3320              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3321                      .dwattr DW$379, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    3322                      .dwattr DW$379, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    3323                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3324                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3325                      .dwendtag DW$T$41
    3326              
    3327              
    3328              DW$T$43 .dwtag  DW_TAG_structure_type
    3329                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    3330              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3331                      .dwattr DW$380, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    3332                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3333                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3334                      .dwendtag DW$T$43
    3335              
    3336              
    3337              DW$T$44 .dwtag  DW_TAG_structure_type
    3338                      .dwattr DW$T$44, DW_AT_byte_size(0x01)
    3339              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3340                      .dwattr DW$381, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    3341                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3342                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3343                      .dwendtag DW$T$44
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:31 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
slave485.asm                                                         PAGE   68

    3344              
    3345              
    3346              DW$T$45 .dwtag  DW_TAG_structure_type
    3347                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    3348              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3349                      .dwattr DW$382, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    3350                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3351                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3352                      .dwendtag DW$T$45
    3353              
    3354              
    3355              DW$T$46 .dwtag  DW_TAG_structure_type
    3356                      .dwattr DW$T$46, DW_AT_byte_size(0x03)
    3357              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3358                      .dwattr DW$383, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    3359                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3360                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3361              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3362                      .dwattr DW$384, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    3363                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3364                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3365              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
