TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:32 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("spi.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("DebugStringOut"), DW_AT_symbol_name("_DebugStringOut")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)

    3409                      .dwendtag DW$T$89
    3410              
    3411              
    3412              DW$T$91 .dwtag  DW_TAG_subroutine_type
    3413                      .dwattr DW$T$91, DW_AT_language(DW_LANG_C)
    3414              DW$150  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3415              DW$151  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3416                      .dwendtag DW$T$91
    3417              
    3418              
    3419              DW$T$94 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    3420                      .dwattr DW$T$94, DW_AT_language(DW_LANG_C)
    3421              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    3422                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3423                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    3424              DW$T$86 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
    3425                      .dwattr DW$T$86, DW_AT_address_class(0x16)
    3426              
    3427              DW$T$95 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
    3428                      .dwattr DW$T$95, DW_AT_language(DW_LANG_C)
    3429              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    3430                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3431                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    3432              
    3433              DW$T$100        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
    3434                      .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    3435              DW$T$103        .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$20)
    3436                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    3437              DW$T$104        .dwtag  DW_TAG_typedef, DW_AT_name("safestruct1struct"), DW_AT_type(*DW$T$24)
    3438                      .dwattr DW$T$104, DW_AT_language(DW_LANG_C)
    3439              DW$T$106        .dwtag  DW_TAG_typedef, DW_AT_name("safestruct2struct"), DW_AT_type(*DW$T$37)
    3440                      .dwattr DW$T$106, DW_AT_language(DW_LANG_C)
    3441              DW$T$108        .dwtag  DW_TAG_typedef, DW_AT_name("xtswplusanastruct"), DW_AT_type(*DW$T$38)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   75

    3442                      .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
    3443              DW$T$110        .dwtag  DW_TAG_typedef, DW_AT_name("clockstruct"), DW_AT_type(*DW$T$39)
    3444                      .dwattr DW$T$110, DW_AT_language(DW_LANG_C)
    3445              DW$152  .dwtag  DW_TAG_far_type
    3446                      .dwattr DW$152, DW_AT_type(*DW$T$111)
    3447              DW$T$112        .dwtag  DW_TAG_volatile_type
    3448                      .dwattr DW$T$112, DW_AT_type(*DW$152)
    3449              DW$T$114        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$47)
    3450                      .dwattr DW$T$114, DW_AT_language(DW_LANG_C)
    3451              DW$153  .dwtag  DW_TAG_far_type
    3452                      .dwattr DW$153, DW_AT_type(*DW$T$115)
    3453              DW$T$116        .dwtag  DW_TAG_volatile_type
    3454                      .dwattr DW$T$116, DW_AT_type(*DW$153)
    3455              DW$154  .dwtag  DW_TAG_far_type
    3456                      .dwattr DW$154, DW_AT_type(*DW$T$119)
    3457              DW$T$120        .dwtag  DW_TAG_volatile_type
    3458                      .dwattr DW$T$120, DW_AT_type(*DW$154)
    3459              DW$T$79 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$55)
    3460                      .dwattr DW$T$79, DW_AT_address_class(0x16)
    3461              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("uartreadC"), DW_AT_type(*DW$T$56)
    3462                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    3463              DW$T$124        .dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$58)
    3464                      .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
    3465              DW$T$126        .dwtag  DW_TAG_typedef, DW_AT_name("alarmsstruct"), DW_AT_type(*DW$T$59)
    3466                      .dwattr DW$T$126, DW_AT_language(DW_LANG_C)
    3467              DW$T$128        .dwtag  DW_TAG_typedef, DW_AT_name("firmwarestruct"), DW_AT_type(*DW$T$60)
    3468                      .dwattr DW$T$128, DW_AT_language(DW_LANG_C)
    3469              DW$155  .dwtag  DW_TAG_far_type
    3470                      .dwattr DW$155, DW_AT_type(*DW$T$76)
    3471              DW$T$130        .dwtag  DW_TAG_volatile_type
    3472                      .dwattr DW$T$130, DW_AT_type(*DW$155)
    3473              DW$T$132        .dwtag  DW_TAG_typedef, DW_AT_name("flashaddrstruct"), DW_AT_type(*DW$T$77)
    3474                      .dwattr DW$T$132, DW_AT_language(DW_LANG_C)
    3475              DW$T$133        .dwtag  DW_TAG_typedef, DW_AT_name("flashflags"), DW_AT_type(*DW$T$78)
    3476                      .dwattr DW$T$133, DW_AT_language(DW_LANG_C)
    3477              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    3478                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3479                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    3480              
    3481              DW$T$20 .dwtag  DW_TAG_structure_type
    3482                      .dwattr DW$T$20, DW_AT_name("tag_settingsstruct")
    3483                      .dwattr DW$T$20, DW_AT_byte_size(0x24)
    3484              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3485                      .dwattr DW$156, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    3486                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3487                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3488              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3489                      .dwattr DW$157, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    3490                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3491                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3492              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3493                      .dwattr DW$158, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    3494                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3495                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3496              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   76

    3497                      .dwattr DW$159, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    3498                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3499                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3500              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3501                      .dwattr DW$160, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    3502                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3503                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3504              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3505                      .dwattr DW$161, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    3506                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3507                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3508              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3509                      .dwattr DW$162, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    3510                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3511                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3512              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3513                      .dwattr DW$163, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    3514                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3515                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3516              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3517                      .dwattr DW$164, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    3518                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3519                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3520              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3521                      .dwattr DW$165, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    3522                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3523                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3524              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3525                      .dwattr DW$166, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    3526                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3527                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3528              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3529                      .dwattr DW$167, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    3530                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3531                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3532              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3533                      .dwattr DW$168, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    3534                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3535                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3536              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3537                      .dwattr DW$169, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    3538                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3539                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3540              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3541                      .dwattr DW$170, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    3542                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3543                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3544              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3545                      .dwattr DW$171, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    3546                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3547                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3548              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3549                      .dwattr DW$172, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    3550                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3551                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   77

    3552              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3553                      .dwattr DW$173, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    3554                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3555                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3556              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3557                      .dwattr DW$174, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    3558                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3559                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3560              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3561                      .dwattr DW$175, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    3562                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3563                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3564              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3565                      .dwattr DW$176, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    3566                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3567                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3568              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3569                      .dwattr DW$177, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    3570                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3571                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3572              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3573                      .dwattr DW$178, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    3574                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3575                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3576              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3577                      .dwattr DW$179, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    3578                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3579                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3580              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3581                      .dwattr DW$180, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    3582                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3583                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3584              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3585                      .dwattr DW$181, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    3586                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3587                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3588              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3589                      .dwattr DW$182, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    3590                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3591                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3592              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3593                      .dwattr DW$183, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    3594                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3595                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3596              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3597                      .dwattr DW$184, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    3598                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3599                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3600              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3601                      .dwattr DW$185, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    3602                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3603                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3604              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3605                      .dwattr DW$186, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    3606                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   78

    3607                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3608              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3609                      .dwattr DW$187, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    3610                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3611                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3612              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3613                      .dwattr DW$188, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    3614                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3615                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3616              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3617                      .dwattr DW$189, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    3618                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3619                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3620              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3621                      .dwattr DW$190, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    3622                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3623                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3624                      .dwendtag DW$T$20
    3625              
    3626              
    3627              DW$T$24 .dwtag  DW_TAG_structure_type
    3628                      .dwattr DW$T$24, DW_AT_name("tag_safestruct1struct")
    3629                      .dwattr DW$T$24, DW_AT_byte_size(0x1f)
    3630              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3631                      .dwattr DW$191, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    3632                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3633                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3634              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3635                      .dwattr DW$192, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    3636                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3637                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3638                      .dwendtag DW$T$24
    3639              
    3640              
    3641              DW$T$37 .dwtag  DW_TAG_structure_type
    3642                      .dwattr DW$T$37, DW_AT_name("tag_safestruct2struct")
    3643                      .dwattr DW$T$37, DW_AT_byte_size(0x1e)
    3644              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3645                      .dwattr DW$193, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    3646                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3647                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3648              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3649                      .dwattr DW$194, DW_AT_name("log"), DW_AT_symbol_name("_log")
    3650                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3651                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3652              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3653                      .dwattr DW$195, DW_AT_name("modbus"), DW_AT_symbol_name("_modbus")
    3654                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3655                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3656              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3657                      .dwattr DW$196, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    3658                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3659                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3660              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    3661                      .dwattr DW$197, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   79

    3662                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3663                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3664              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3665                      .dwattr DW$198, DW_AT_name("modbusbaud"), DW_AT_symbol_name("_modbusbaud")
    3666                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3667                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3668              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    3669                      .dwattr DW$199, DW_AT_name("modbus2"), DW_AT_symbol_name("_modbus2")
    3670                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3671                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3672              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    3673                      .dwattr DW$200, DW_AT_name("sync"), DW_AT_symbol_name("_sync")
    3674                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3675                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3676              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    3677                      .dwattr DW$201, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    3678                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3679                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3680              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3681                      .dwattr DW$202, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    3682                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3683                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3684              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    3685                      .dwattr DW$203, DW_AT_name("tempcomp"), DW_AT_symbol_name("_tempcomp")
    3686                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3687                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3688                      .dwendtag DW$T$37
    3689              
    3690              
    3691              DW$T$38 .dwtag  DW_TAG_structure_type
    3692                      .dwattr DW$T$38, DW_AT_name("tag_xtswplusanastruct")
    3693                      .dwattr DW$T$38, DW_AT_byte_size(0x0e)
    3694              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    3695                      .dwattr DW$204, DW_AT_name("analog18ma"), DW_AT_symbol_name("_analog18ma")
    3696                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3697                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3698                      .dwendtag DW$T$38
    3699              
    3700              
    3701              DW$T$39 .dwtag  DW_TAG_structure_type
    3702                      .dwattr DW$T$39, DW_AT_name("tag_clockstruct")
    3703                      .dwattr DW$T$39, DW_AT_byte_size(0x0e)
    3704              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3705                      .dwattr DW$205, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
    3706                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3707                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3708              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3709                      .dwattr DW$206, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
    3710                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3711                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3712              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3713                      .dwattr DW$207, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
    3714                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3715                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3716              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   80

    3717                      .dwattr DW$208, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
    3718                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3719                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3720              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3721                      .dwattr DW$209, DW_AT_name("day"), DW_AT_symbol_name("_day")
    3722                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3723                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3724              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3725                      .dwattr DW$210, DW_AT_name("date"), DW_AT_symbol_name("_date")
    3726                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3727                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3728              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3729                      .dwattr DW$211, DW_AT_name("month"), DW_AT_symbol_name("_month")
    3730                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3731                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3732              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3733                      .dwattr DW$212, DW_AT_name("year"), DW_AT_symbol_name("_year")
    3734                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3735                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3736              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3737                      .dwattr DW$213, DW_AT_name("control"), DW_AT_symbol_name("_control")
    3738                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3739                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3740              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    3741                      .dwattr DW$214, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
    3742                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3743                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3744              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3745                      .dwattr DW$215, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
    3746                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3747                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3748                      .dwendtag DW$T$39
    3749              
    3750              DW$T$111        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$40)
    3751                      .dwattr DW$T$111, DW_AT_language(DW_LANG_C)
    3752              
    3753              DW$T$47 .dwtag  DW_TAG_structure_type
    3754                      .dwattr DW$T$47, DW_AT_name("tag_configstruct")
    3755                      .dwattr DW$T$47, DW_AT_byte_size(0x18)
    3756              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3757                      .dwattr DW$216, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    3758                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3759                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3760              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3761                      .dwattr DW$217, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    3762                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3763                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3764              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    3765                      .dwattr DW$218, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    3766                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3767                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3768              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3769                      .dwattr DW$219, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    3770                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3771                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   81

    3772              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    3773                      .dwattr DW$220, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    3774                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3775                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3776              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    3777                      .dwattr DW$221, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    3778                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3779                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3780                      .dwendtag DW$T$47
    3781              
    3782              DW$T$115        .dwtag  DW_TAG_typedef, DW_AT_name("gpbport"), DW_AT_type(*DW$T$50)
    3783                      .dwattr DW$T$115, DW_AT_language(DW_LANG_C)
    3784              DW$T$119        .dwtag  DW_TAG_typedef, DW_AT_name("gpfport"), DW_AT_type(*DW$T$53)
    3785                      .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
    3786              DW$T$55 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    3787                      .dwattr DW$T$55, DW_AT_encoding(DW_ATE_signed_char)
    3788                      .dwattr DW$T$55, DW_AT_byte_size(0x01)
    3789              
    3790              DW$T$56 .dwtag  DW_TAG_structure_type
    3791                      .dwattr DW$T$56, DW_AT_name("tag_uartreadC")
    3792                      .dwattr DW$T$56, DW_AT_byte_size(0x68)
    3793              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3794                      .dwattr DW$222, DW_AT_name("receiveINTR"), DW_AT_symbol_name("_receiveINTR")
    3795                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3796                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3797              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3798                      .dwattr DW$223, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
    3799                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3800                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3801              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3802                      .dwattr DW$224, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
    3803                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3804                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3805              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3806                      .dwattr DW$225, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    3807                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3808                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3809              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    3810                      .dwattr DW$226, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
    3811                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x67]
    3812                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3813                      .dwendtag DW$T$56
    3814              
    3815              
    3816              DW$T$58 .dwtag  DW_TAG_structure_type
    3817                      .dwattr DW$T$58, DW_AT_name("tag_sdsettingsstruct")
    3818                      .dwattr DW$T$58, DW_AT_byte_size(0x04)
    3819              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3820                      .dwattr DW$227, DW_AT_name("present"), DW_AT_symbol_name("_present")
    3821                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3822                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3823              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3824                      .dwattr DW$228, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
    3825                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3826                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   82

    3827              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3828                      .dwattr DW$229, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
    3829                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3830                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3831              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    3832                      .dwattr DW$230, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
    3833                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3834                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3835                      .dwendtag DW$T$58
    3836              
    3837              
    3838              DW$T$59 .dwtag  DW_TAG_structure_type
    3839                      .dwattr DW$T$59, DW_AT_name("tag_alarmsstruct")
    3840                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    3841              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3842                      .dwattr DW$231, DW_AT_name("slavefailure"), DW_AT_symbol_name("_slavefailure")
    3843                      .dwattr DW$231, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3844                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3845                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3846              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3847                      .dwattr DW$232, DW_AT_name("slavefailurelatched"), DW_AT_symbol_name("_slavefailurelatched")
    3848                      .dwattr DW$232, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3849                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3850                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3851              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3852                      .dwattr DW$233, DW_AT_name("framfailure"), DW_AT_symbol_name("_framfailure")
    3853                      .dwattr DW$233, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3854                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3855                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3856              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3857                      .dwattr DW$234, DW_AT_name("framfailurelatched"), DW_AT_symbol_name("_framfailurelatched")
    3858                      .dwattr DW$234, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3859                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3860                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3861              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3862                      .dwattr DW$235, DW_AT_name("pccommsfailure"), DW_AT_symbol_name("_pccommsfailure")
    3863                      .dwattr DW$235, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3864                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3865                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3866              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3867                      .dwattr DW$236, DW_AT_name("pccommsfailurelatched"), DW_AT_symbol_name("_pccommsfailurelatched")
    3868                      .dwattr DW$236, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3869                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3870                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3871              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3872                      .dwattr DW$237, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    3873                      .dwattr DW$237, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3874                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3875                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3876              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3877                      .dwattr DW$238, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    3878                      .dwattr DW$238, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3879                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3880                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3881              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   83

    3882                      .dwattr DW$239, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    3883                      .dwattr DW$239, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3884                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3885                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3886              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3887                      .dwattr DW$240, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    3888                      .dwattr DW$240, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3889                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3890                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3891              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3892                      .dwattr DW$241, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    3893                      .dwattr DW$241, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3894                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3895                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3896              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3897                      .dwattr DW$242, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    3898                      .dwattr DW$242, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3899                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3900                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3901              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3902                      .dwattr DW$243, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    3903                      .dwattr DW$243, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3904                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3905                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3906              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3907                      .dwattr DW$244, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    3908                      .dwattr DW$244, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3909                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3910                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3911              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3912                      .dwattr DW$245, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    3913                      .dwattr DW$245, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3914                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3915                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3916              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3917                      .dwattr DW$246, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    3918                      .dwattr DW$246, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3919                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3920                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3921                      .dwendtag DW$T$59
    3922              
    3923              
    3924              DW$T$60 .dwtag  DW_TAG_structure_type
    3925                      .dwattr DW$T$60, DW_AT_name("tag_firmwarestruct")
    3926                      .dwattr DW$T$60, DW_AT_byte_size(0x02)
    3927              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3928                      .dwattr DW$247, DW_AT_name("spu2"), DW_AT_symbol_name("_spu2")
    3929                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3930                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3931              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3932                      .dwattr DW$248, DW_AT_name("spu1"), DW_AT_symbol_name("_spu1")
    3933                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3934                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3935                      .dwendtag DW$T$60
    3936              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   84

    3937              
    3938              DW$T$76 .dwtag  DW_TAG_structure_type
    3939                      .dwattr DW$T$76, DW_AT_name("SPI_REGS")
    3940                      .dwattr DW$T$76, DW_AT_byte_size(0x10)
    3941              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3942                      .dwattr DW$249, DW_AT_name("SPICCR"), DW_AT_symbol_name("_SPICCR")
    3943                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3944                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3945              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3946                      .dwattr DW$250, DW_AT_name("SPICTL"), DW_AT_symbol_name("_SPICTL")
    3947                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3948                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3949              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3950                      .dwattr DW$251, DW_AT_name("SPISTS"), DW_AT_symbol_name("_SPISTS")
    3951                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3952                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3953              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3954                      .dwattr DW$252, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3955                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3956                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3957              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3958                      .dwattr DW$253, DW_AT_name("SPIBRR"), DW_AT_symbol_name("_SPIBRR")
    3959                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3960                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3961              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3962                      .dwattr DW$254, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3963                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3964                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3965              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3966                      .dwattr DW$255, DW_AT_name("SPIRXEMU"), DW_AT_symbol_name("_SPIRXEMU")
    3967                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3968                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3969              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3970                      .dwattr DW$256, DW_AT_name("SPIRXBUF"), DW_AT_symbol_name("_SPIRXBUF")
    3971                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3972                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3973              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3974                      .dwattr DW$257, DW_AT_name("SPITXBUF"), DW_AT_symbol_name("_SPITXBUF")
    3975                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3976                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3977              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3978                      .dwattr DW$258, DW_AT_name("SPIDAT"), DW_AT_symbol_name("_SPIDAT")
    3979                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3980                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3981              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3982                      .dwattr DW$259, DW_AT_name("SPIFFTX"), DW_AT_symbol_name("_SPIFFTX")
    3983                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3984                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3985              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3986                      .dwattr DW$260, DW_AT_name("SPIFFRX"), DW_AT_symbol_name("_SPIFFRX")
    3987                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3988                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3989              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    3990                      .dwattr DW$261, DW_AT_name("SPIFFCT"), DW_AT_symbol_name("_SPIFFCT")
    3991                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   85

    3992                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3993              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
    3994                      .dwattr DW$262, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3995                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3996                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3997              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3998                      .dwattr DW$263, DW_AT_name("SPIPRI"), DW_AT_symbol_name("_SPIPRI")
    3999                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4000                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4001                      .dwendtag DW$T$76
    4002              
    4003              
    4004              DW$T$77 .dwtag  DW_TAG_structure_type
    4005                      .dwattr DW$T$77, DW_AT_name("tag_addressstruct")
    4006                      .dwattr DW$T$77, DW_AT_byte_size(0x04)
    4007              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4008                      .dwattr DW$264, DW_AT_name("page"), DW_AT_symbol_name("_page")
    4009                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4010                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4011              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4012                      .dwattr DW$265, DW_AT_name("byteaddr"), DW_AT_symbol_name("_byteaddr")
    4013                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4014                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4015                      .dwendtag DW$T$77
    4016              
    4017              
    4018              DW$T$78 .dwtag  DW_TAG_structure_type
    4019                      .dwattr DW$T$78, DW_AT_name("tag_flashflags")
    4020                      .dwattr DW$T$78, DW_AT_byte_size(0x04)
    4021              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4022                      .dwattr DW$266, DW_AT_name("flash1"), DW_AT_symbol_name("_flash1")
    4023                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4024                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4025              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4026                      .dwattr DW$267, DW_AT_name("flash2"), DW_AT_symbol_name("_flash2")
    4027                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4028                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4029              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4030                      .dwattr DW$268, DW_AT_name("flash3"), DW_AT_symbol_name("_flash3")
    4031                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4032                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4033              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4034                      .dwattr DW$269, DW_AT_name("flash4"), DW_AT_symbol_name("_flash4")
    4035                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4036                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4037                      .dwendtag DW$T$78
    4038              
    4039              
    4040              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    4041                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    4042                      .dwattr DW$T$21, DW_AT_byte_size(0x0e)
    4043              DW$270  .dwtag  DW_TAG_subrange_type
    4044                      .dwattr DW$270, DW_AT_upper_bound(0x0d)
    4045                      .dwendtag DW$T$21
    4046              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   86

    4047              
    4048              DW$T$54 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    4049                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    4050                      .dwattr DW$T$54, DW_AT_byte_size(0x64)
    4051              DW$271  .dwtag  DW_TAG_subrange_type
    4052                      .dwattr DW$271, DW_AT_upper_bound(0x63)
    4053                      .dwendtag DW$T$54
    4054              
    4055              
    4056              DW$T$75 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    4057                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
    4058                      .dwattr DW$T$75, DW_AT_byte_size(0x02)
    4059              DW$272  .dwtag  DW_TAG_subrange_type
    4060                      .dwattr DW$272, DW_AT_upper_bound(0x01)
    4061                      .dwendtag DW$T$75
    4062              
    4063              
    4064              DW$T$19 .dwtag  DW_TAG_structure_type
    4065                      .dwattr DW$T$19, DW_AT_byte_size(0x02)
    4066              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4067                      .dwattr DW$273, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    4068                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4069                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4070              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4071                      .dwattr DW$274, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    4072                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4073                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4074                      .dwendtag DW$T$19
    4075              
    4076              
    4077              DW$T$22 .dwtag  DW_TAG_structure_type
    4078                      .dwattr DW$T$22, DW_AT_byte_size(0x1e)
    4079              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4080                      .dwattr DW$275, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    4081                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4082                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4083              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4084                      .dwattr DW$276, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    4085                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4086                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4087              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    4088                      .dwattr DW$277, DW_AT_name("chan18ma"), DW_AT_symbol_name("_chan18ma")
    4089                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4090                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4091              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    4092                      .dwattr DW$278, DW_AT_name("notused"), DW_AT_symbol_name("_notused")
    4093                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4094                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4095                      .dwendtag DW$T$22
    4096              
    4097              
    4098              DW$T$23 .dwtag  DW_TAG_structure_type
    4099                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    4100              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4101                      .dwattr DW$279, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   87

    4102                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4103                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4104                      .dwendtag DW$T$23
    4105              
    4106              
    4107              DW$T$26 .dwtag  DW_TAG_structure_type
    4108                      .dwattr DW$T$26, DW_AT_byte_size(0x0b)
    4109              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4110                      .dwattr DW$280, DW_AT_name("calprtzero"), DW_AT_symbol_name("_calprtzero")
    4111                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4112                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4113              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4114                      .dwattr DW$281, DW_AT_name("calprtfullscale"), DW_AT_symbol_name("_calprtfullscale")
    4115                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4116                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4117              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4118                      .dwattr DW$282, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    4119                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4120                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4121              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4122                      .dwattr DW$283, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    4123                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4124                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4125              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4126                      .dwattr DW$284, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    4127                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4128                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4129                      .dwendtag DW$T$26
    4130              
    4131              
    4132              DW$T$27 .dwtag  DW_TAG_structure_type
    4133                      .dwattr DW$T$27, DW_AT_byte_size(0x03)
    4134              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4135                      .dwattr DW$285, DW_AT_name("mainrate"), DW_AT_symbol_name("_mainrate")
    4136                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4137                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4138              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4139                      .dwattr DW$286, DW_AT_name("trendrate"), DW_AT_symbol_name("_trendrate")
    4140                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4141                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4142              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4143                      .dwattr DW$287, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    4144                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4145                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4146                      .dwendtag DW$T$27
    4147              
    4148              
    4149              DW$T$28 .dwtag  DW_TAG_structure_type
    4150                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    4151              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4152                      .dwattr DW$288, DW_AT_name("address"), DW_AT_symbol_name("_address")
    4153                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4154                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4155                      .dwendtag DW$T$28
    4156              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   88

    4157              
    4158              DW$T$29 .dwtag  DW_TAG_structure_type
    4159                      .dwattr DW$T$29, DW_AT_byte_size(0x02)
    4160              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4161                      .dwattr DW$289, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    4162                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4163                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4164              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4165                      .dwattr DW$290, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    4166                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4167                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4168                      .dwendtag DW$T$29
    4169              
    4170              
    4171              DW$T$30 .dwtag  DW_TAG_structure_type
    4172                      .dwattr DW$T$30, DW_AT_byte_size(0x03)
    4173              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4174                      .dwattr DW$291, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    4175                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4176                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4177              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4178                      .dwattr DW$292, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    4179                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4180                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4181              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4182                      .dwattr DW$293, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    4183                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4184                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4185                      .dwendtag DW$T$30
    4186              
    4187              
    4188              DW$T$31 .dwtag  DW_TAG_structure_type
    4189                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    4190              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4191                      .dwattr DW$294, DW_AT_name("rate"), DW_AT_symbol_name("_rate")
    4192                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4193                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4194                      .dwendtag DW$T$31
    4195              
    4196              
    4197              DW$T$32 .dwtag  DW_TAG_structure_type
    4198                      .dwattr DW$T$32, DW_AT_byte_size(0x02)
    4199              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4200                      .dwattr DW$295, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    4201                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4202                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4203              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4204                      .dwattr DW$296, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    4205                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4206                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4207                      .dwendtag DW$T$32
    4208              
    4209              
    4210              DW$T$33 .dwtag  DW_TAG_structure_type
    4211                      .dwattr DW$T$33, DW_AT_byte_size(0x04)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   89

    4212              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4213                      .dwattr DW$297, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    4214                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4215                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4216              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4217                      .dwattr DW$298, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
    4218                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4219                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4220              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4221                      .dwattr DW$299, DW_AT_name("notused3"), DW_AT_symbol_name("_notused3")
    4222                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4223                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4224              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4225                      .dwattr DW$300, DW_AT_name("notused4"), DW_AT_symbol_name("_notused4")
    4226                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4227                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4228                      .dwendtag DW$T$33
    4229              
    4230              
    4231              DW$T$34 .dwtag  DW_TAG_structure_type
    4232                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    4233              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4234                      .dwattr DW$301, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    4235                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4236                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4237                      .dwendtag DW$T$34
    4238              
    4239              
    4240              DW$T$35 .dwtag  DW_TAG_structure_type
    4241                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    4242              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4243                      .dwattr DW$302, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    4244                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4245                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4246                      .dwendtag DW$T$35
    4247              
    4248              
    4249              DW$T$36 .dwtag  DW_TAG_structure_type
    4250                      .dwattr DW$T$36, DW_AT_byte_size(0x01)
    4251              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4252                      .dwattr DW$303, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
    4253                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4254                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4255                      .dwendtag DW$T$36
    4256              
    4257              
    4258              DW$T$40 .dwtag  DW_TAG_structure_type
    4259                      .dwattr DW$T$40, DW_AT_name("tag_timers")
    4260                      .dwattr DW$T$40, DW_AT_byte_size(0x4c)
    4261              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4262                      .dwattr DW$304, DW_AT_name("update"), DW_AT_symbol_name("_update")
    4263                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4264                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4265              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4266                      .dwattr DW$305, DW_AT_name("general"), DW_AT_symbol_name("_general")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   90

    4267                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4268                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4269              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4270                      .dwattr DW$306, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    4271                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4272                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4273              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4274                      .dwattr DW$307, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    4275                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4276                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4277              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4278                      .dwattr DW$308, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    4279                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4280                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4281              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4282                      .dwattr DW$309, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    4283                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4284                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4285              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4286                      .dwattr DW$310, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    4287                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4288                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4289              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4290                      .dwattr DW$311, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    4291                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4292                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4293              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4294                      .dwattr DW$312, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    4295                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4296                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4297              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4298                      .dwattr DW$313, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    4299                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4300                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4301              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    4302                      .dwattr DW$314, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    4303                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4304                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4305              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    4306                      .dwattr DW$315, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    4307                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4308                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4309              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4310                      .dwattr DW$316, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    4311                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4312                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4313              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4314                      .dwattr DW$317, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    4315                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4316                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4317              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4318                      .dwattr DW$318, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    4319                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4320                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4321              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   91

    4322                      .dwattr DW$319, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    4323                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4324                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4325              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4326                      .dwattr DW$320, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    4327                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4328                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4329              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4330                      .dwattr DW$321, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    4331                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4332                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4333              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4334                      .dwattr DW$322, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    4335                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4336                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4337              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4338                      .dwattr DW$323, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    4339                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4340                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4341              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4342                      .dwattr DW$324, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    4343                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4344                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4345              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4346                      .dwattr DW$325, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    4347                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4348                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4349              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4350                      .dwattr DW$326, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    4351                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4352                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4353              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4354                      .dwattr DW$327, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    4355                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4356                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4357              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4358                      .dwattr DW$328, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    4359                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4360                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4361              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4362                      .dwattr DW$329, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    4363                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4364                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4365              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4366                      .dwattr DW$330, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    4367                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4368                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4369              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4370                      .dwattr DW$331, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    4371                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4372                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4373              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4374                      .dwattr DW$332, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    4375                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4376                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   92

    4377              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4378                      .dwattr DW$333, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    4379                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4380                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4381              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4382                      .dwattr DW$334, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    4383                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4384                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4385              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4386                      .dwattr DW$335, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    4387                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4388                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4389              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4390                      .dwattr DW$336, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    4391                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    4392                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4393              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4394                      .dwattr DW$337, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    4395                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4396                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4397              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4398                      .dwattr DW$338, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    4399                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4400                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4401              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4402                      .dwattr DW$339, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    4403                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4404                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4405              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4406                      .dwattr DW$340, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    4407                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4408                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4409              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4410                      .dwattr DW$341, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    4411                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4412                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4413              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4414                      .dwattr DW$342, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    4415                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4416                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4417              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4418                      .dwattr DW$343, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    4419                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4420                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4421              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4422                      .dwattr DW$344, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    4423                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4424                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4425              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4426                      .dwattr DW$345, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    4427                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4428                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4429              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4430                      .dwattr DW$346, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    4431                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   93

    4432                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4433                      .dwendtag DW$T$40
    4434              
    4435              
    4436              DW$T$41 .dwtag  DW_TAG_structure_type
    4437                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    4438              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4439                      .dwattr DW$347, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
    4440                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4441                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4442                      .dwendtag DW$T$41
    4443              
    4444              
    4445              DW$T$42 .dwtag  DW_TAG_structure_type
    4446                      .dwattr DW$T$42, DW_AT_byte_size(0x01)
    4447              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4448                      .dwattr DW$348, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
    4449                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4450                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4451                      .dwendtag DW$T$42
    4452              
    4453              
    4454              DW$T$43 .dwtag  DW_TAG_structure_type
    4455                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    4456              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4457                      .dwattr DW$349, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
    4458                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4459                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4460                      .dwendtag DW$T$43
    4461              
    4462              
    4463              DW$T$44 .dwtag  DW_TAG_structure_type
    4464                      .dwattr DW$T$44, DW_AT_byte_size(0x03)
    4465              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4466                      .dwattr DW$350, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    4467                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4468                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4469              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4470                      .dwattr DW$351, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    4471                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4472                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4473              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4474                      .dwattr DW$352, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    4475                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4476                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4477                      .dwendtag DW$T$44
    4478              
    4479              
    4480              DW$T$45 .dwtag  DW_TAG_structure_type
    4481                      .dwattr DW$T$45, DW_AT_byte_size(0x02)
    4482              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4483                      .dwattr DW$353, DW_AT_name("shortlrate"), DW_AT_symbol_name("_shortlrate")
    4484                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4485                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4486              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   94

    4487                      .dwattr DW$354, DW_AT_name("longlrate"), DW_AT_symbol_name("_longlrate")
    4488                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4489                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4490                      .dwendtag DW$T$45
    4491              
    4492              
    4493              DW$T$46 .dwtag  DW_TAG_structure_type
    4494                      .dwattr DW$T$46, DW_AT_byte_size(0x10)
    4495              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4496                      .dwattr DW$355, DW_AT_name("wiorequest"), DW_AT_symbol_name("_wiorequest")
    4497                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4498                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4499              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4500                      .dwattr DW$356, DW_AT_name("wiocancelled"), DW_AT_symbol_name("_wiocancelled")
    4501                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4502                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4503              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4504                      .dwattr DW$357, DW_AT_name("wioreceived"), DW_AT_symbol_name("_wioreceived")
    4505                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4506                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4507              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4508                      .dwattr DW$358, DW_AT_name("slaverequest"), DW_AT_symbol_name("_slaverequest")
    4509                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4510                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4511              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4512                      .dwattr DW$359, DW_AT_name("slavereceived"), DW_AT_symbol_name("_slavereceived")
    4513                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4514                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4515              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4516                      .dwattr DW$360, DW_AT_name("slaveretry"), DW_AT_symbol_name("_slaveretry")
    4517                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4518                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4519              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4520                      .dwattr DW$361, DW_AT_name("pcrequest"), DW_AT_symbol_name("_pcrequest")
    4521                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4522                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4523              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4524                      .dwattr DW$362, DW_AT_name("pcreqtimeout"), DW_AT_symbol_name("_pcreqtimeout")
    4525                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4526                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4527                      .dwendtag DW$T$46
    4528              
    4529              
    4530              DW$T$50 .dwtag  DW_TAG_structure_type
    4531                      .dwattr DW$T$50, DW_AT_name("taggpbport")
    4532                      .dwattr DW$T$50, DW_AT_byte_size(0x01)
    4533              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    4534                      .dwattr DW$363, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    4535                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4536                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4537                      .dwendtag DW$T$50
    4538              
    4539              
    4540              DW$T$53 .dwtag  DW_TAG_structure_type
    4541                      .dwattr DW$T$53, DW_AT_name("taggpfport")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:32 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
spi.asm                                                              PAGE   95

    4542                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
    4543              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    4544                      .dwattr DW$364, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    4545                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4546                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4547                      .dwendtag DW$T$53
    4548              
    4549              
    4550              DW$T$57 .dwtag  DW_TAG_structure_type
    4551                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
    4552              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4553                      .dwattr DW$365, DW_AT_name("settings"), DW_AT_symbol_name("_settings")
    4554                      .dwattr DW$365, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4555                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4556                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4557              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4558                      .dwattr DW$366, DW_AT_name("sensorstatus"), DW_AT_symbol_name("_sensorstatus")
    4559                      .dwattr DW$366, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4560                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4561                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
