TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:33 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("utils.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("sprintf"), DW_AT_symbol_name("_sprintf")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$10)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    4140              DW$242  .dwtag  DW_TAG_far_type
    4141                      .dwattr DW$242, DW_AT_type(*DW$T$124)
    4142              DW$T$125        .dwtag  DW_TAG_volatile_type
    4143                      .dwattr DW$T$125, DW_AT_type(*DW$242)
    4144              DW$T$128        .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$23)
    4145                      .dwattr DW$T$128, DW_AT_language(DW_LANG_C)
    4146              DW$T$129        .dwtag  DW_TAG_typedef, DW_AT_name("livestruct"), DW_AT_type(*DW$T$24)
    4147                      .dwattr DW$T$129, DW_AT_language(DW_LANG_C)
    4148              DW$T$130        .dwtag  DW_TAG_typedef, DW_AT_name("calibrationdatetimestruct"), DW_AT_type(*DW$T$27)
    4149                      .dwattr DW$T$130, DW_AT_language(DW_LANG_C)
    4150              DW$T$132        .dwtag  DW_TAG_typedef, DW_AT_name("clockstruct"), DW_AT_type(*DW$T$28)
    4151                      .dwattr DW$T$132, DW_AT_language(DW_LANG_C)
    4152              DW$243  .dwtag  DW_TAG_far_type
    4153                      .dwattr DW$243, DW_AT_type(*DW$T$134)
    4154              DW$T$135        .dwtag  DW_TAG_volatile_type
    4155                      .dwattr DW$T$135, DW_AT_type(*DW$243)
    4156              DW$T$137        .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$33)
    4157                      .dwattr DW$T$137, DW_AT_language(DW_LANG_C)
    4158              DW$T$139        .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$40)
    4159                      .dwattr DW$T$139, DW_AT_language(DW_LANG_C)
    4160              DW$T$142        .dwtag  DW_TAG_typedef, DW_AT_name("loopcheckstruct"), DW_AT_type(*DW$T$44)
    4161                      .dwattr DW$T$142, DW_AT_language(DW_LANG_C)
    4162              DW$T$144        .dwtag  DW_TAG_typedef, DW_AT_name("offsetstruct"), DW_AT_type(*DW$T$46)
    4163                      .dwattr DW$T$144, DW_AT_language(DW_LANG_C)
    4164              DW$T$146        .dwtag  DW_TAG_typedef, DW_AT_name("functionstruct"), DW_AT_type(*DW$T$48)
    4165                      .dwattr DW$T$146, DW_AT_language(DW_LANG_C)
    4166              DW$T$147        .dwtag  DW_TAG_typedef, DW_AT_name("speedcompstruct"), DW_AT_type(*DW$T$51)
    4167                      .dwattr DW$T$147, DW_AT_language(DW_LANG_C)
    4168              DW$T$148        .dwtag  DW_TAG_typedef, DW_AT_name("sdsettingsstruct"), DW_AT_type(*DW$T$53)
    4169                      .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    4170              DW$T$150        .dwtag  DW_TAG_typedef, DW_AT_name("alarmsstruct"), DW_AT_type(*DW$T$54)
    4171                      .dwattr DW$T$150, DW_AT_language(DW_LANG_C)
    4172              DW$T$152        .dwtag  DW_TAG_typedef, DW_AT_name("wiosettingsstruct"), DW_AT_type(*DW$T$55)
    4173                      .dwattr DW$T$152, DW_AT_language(DW_LANG_C)
    4174              DW$T$153        .dwtag  DW_TAG_typedef, DW_AT_name("rtcbatstruct"), DW_AT_type(*DW$T$57)
    4175                      .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    4176              DW$T$155        .dwtag  DW_TAG_typedef, DW_AT_name("rpmstruct"), DW_AT_type(*DW$T$59)
    4177                      .dwattr DW$T$155, DW_AT_language(DW_LANG_C)
    4178              
    4179              DW$T$158        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$157)
    4180                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    4181                      .dwattr DW$T$158, DW_AT_byte_size(0x30)
    4182              DW$244  .dwtag  DW_TAG_subrange_type
    4183                      .dwattr DW$244, DW_AT_upper_bound(0x07)
    4184                      .dwendtag DW$T$158
    4185              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   91

    4186              DW$T$65 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$64)
    4187                      .dwattr DW$T$65, DW_AT_address_class(0x16)
    4188              DW$T$81 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$80)
    4189                      .dwattr DW$T$81, DW_AT_address_class(0x16)
    4190              
    4191              DW$T$168        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$80)
    4192                      .dwattr DW$T$168, DW_AT_language(DW_LANG_C)
    4193                      .dwattr DW$T$168, DW_AT_byte_size(0x34)
    4194              DW$245  .dwtag  DW_TAG_subrange_type
    4195                      .dwattr DW$245, DW_AT_upper_bound(0x0c)
    4196              DW$246  .dwtag  DW_TAG_subrange_type
    4197                      .dwattr DW$246, DW_AT_upper_bound(0x03)
    4198                      .dwendtag DW$T$168
    4199              
    4200              
    4201              DW$T$169        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$64)
    4202                      .dwattr DW$T$169, DW_AT_language(DW_LANG_C)
    4203                      .dwattr DW$T$169, DW_AT_byte_size(0x64)
    4204              DW$247  .dwtag  DW_TAG_subrange_type
    4205                      .dwattr DW$247, DW_AT_upper_bound(0x63)
    4206                      .dwendtag DW$T$169
    4207              
    4208              DW$T$124        .dwtag  DW_TAG_typedef, DW_AT_name("gpdport"), DW_AT_type(*DW$T$21)
    4209                      .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
    4210              
    4211              DW$T$23 .dwtag  DW_TAG_structure_type
    4212                      .dwattr DW$T$23, DW_AT_name("tag_settingsstruct")
    4213                      .dwattr DW$T$23, DW_AT_byte_size(0x24)
    4214              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4215                      .dwattr DW$248, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    4216                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4217                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4218              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4219                      .dwattr DW$249, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    4220                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4221                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4222              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4223                      .dwattr DW$250, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    4224                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4225                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4226              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4227                      .dwattr DW$251, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    4228                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4229                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4230              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4231                      .dwattr DW$252, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    4232                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4233                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4234              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4235                      .dwattr DW$253, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    4236                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4237                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4238              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4239                      .dwattr DW$254, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    4240                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   92

    4241                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4242              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4243                      .dwattr DW$255, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    4244                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4245                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4246              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4247                      .dwattr DW$256, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    4248                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4249                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4250              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4251                      .dwattr DW$257, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    4252                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4253                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4254              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4255                      .dwattr DW$258, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    4256                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4257                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4258              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4259                      .dwattr DW$259, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    4260                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4261                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4262              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4263                      .dwattr DW$260, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    4264                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4265                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4266              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4267                      .dwattr DW$261, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    4268                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4269                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4270              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4271                      .dwattr DW$262, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    4272                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4273                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4274              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4275                      .dwattr DW$263, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    4276                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4277                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4278              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4279                      .dwattr DW$264, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    4280                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4281                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4282              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4283                      .dwattr DW$265, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    4284                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4285                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4286              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4287                      .dwattr DW$266, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    4288                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4289                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4290              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4291                      .dwattr DW$267, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    4292                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4293                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4294              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4295                      .dwattr DW$268, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   93

    4296                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4297                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4298              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4299                      .dwattr DW$269, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    4300                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4301                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4302              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4303                      .dwattr DW$270, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    4304                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4305                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4306              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4307                      .dwattr DW$271, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    4308                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4309                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4310              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4311                      .dwattr DW$272, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    4312                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4313                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4314              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4315                      .dwattr DW$273, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    4316                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4317                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4318              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4319                      .dwattr DW$274, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    4320                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4321                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4322              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4323                      .dwattr DW$275, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    4324                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4325                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4326              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4327                      .dwattr DW$276, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    4328                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4329                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4330              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4331                      .dwattr DW$277, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    4332                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4333                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4334              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4335                      .dwattr DW$278, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    4336                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4337                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4338              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    4339                      .dwattr DW$279, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    4340                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4341                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4342              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4343                      .dwattr DW$280, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    4344                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4345                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4346              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4347                      .dwattr DW$281, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    4348                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4349                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4350              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   94

    4351                      .dwattr DW$282, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    4352                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4353                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4354                      .dwendtag DW$T$23
    4355              
    4356              
    4357              DW$T$24 .dwtag  DW_TAG_structure_type
    4358                      .dwattr DW$T$24, DW_AT_name("tag_livestruct")
    4359                      .dwattr DW$T$24, DW_AT_byte_size(0x03)
    4360              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4361                      .dwattr DW$283, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
    4362                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4363                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4364              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4365                      .dwattr DW$284, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
    4366                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4367                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4368              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4369                      .dwattr DW$285, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
    4370                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4371                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4372                      .dwendtag DW$T$24
    4373              
    4374              
    4375              DW$T$27 .dwtag  DW_TAG_structure_type
    4376                      .dwattr DW$T$27, DW_AT_name("tag_calibrationdatetimestruct")
    4377                      .dwattr DW$T$27, DW_AT_byte_size(0x07)
    4378              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    4379                      .dwattr DW$286, DW_AT_name("calcomplete"), DW_AT_symbol_name("_calcomplete")
    4380                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4381                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4382              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    4383                      .dwattr DW$287, DW_AT_name("verification"), DW_AT_symbol_name("_verification")
    4384                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4385                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4386              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4387                      .dwattr DW$288, DW_AT_name("chksum"), DW_AT_symbol_name("_chksum")
    4388                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4389                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4390                      .dwendtag DW$T$27
    4391              
    4392              
    4393              DW$T$28 .dwtag  DW_TAG_structure_type
    4394                      .dwattr DW$T$28, DW_AT_name("tag_clockstruct")
    4395                      .dwattr DW$T$28, DW_AT_byte_size(0x0e)
    4396              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4397                      .dwattr DW$289, DW_AT_name("WPstate"), DW_AT_symbol_name("_WPstate")
    4398                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4399                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4400              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4401                      .dwattr DW$290, DW_AT_name("seconds"), DW_AT_symbol_name("_seconds")
    4402                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4403                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4404              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4405                      .dwattr DW$291, DW_AT_name("minutes"), DW_AT_symbol_name("_minutes")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   95

    4406                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4407                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4408              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4409                      .dwattr DW$292, DW_AT_name("hours"), DW_AT_symbol_name("_hours")
    4410                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4411                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4412              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4413                      .dwattr DW$293, DW_AT_name("day"), DW_AT_symbol_name("_day")
    4414                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4415                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4416              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4417                      .dwattr DW$294, DW_AT_name("date"), DW_AT_symbol_name("_date")
    4418                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4419                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4420              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4421                      .dwattr DW$295, DW_AT_name("month"), DW_AT_symbol_name("_month")
    4422                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4423                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4424              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4425                      .dwattr DW$296, DW_AT_name("year"), DW_AT_symbol_name("_year")
    4426                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4427                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4428              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4429                      .dwattr DW$297, DW_AT_name("control"), DW_AT_symbol_name("_control")
    4430                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4431                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4432              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    4433                      .dwattr DW$298, DW_AT_name("framstamp"), DW_AT_symbol_name("_framstamp")
    4434                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4435                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4436              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4437                      .dwattr DW$299, DW_AT_name("clockerr"), DW_AT_symbol_name("_clockerr")
    4438                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4439                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4440                      .dwendtag DW$T$28
    4441              
    4442              DW$T$134        .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$30)
    4443                      .dwattr DW$T$134, DW_AT_language(DW_LANG_C)
    4444              
    4445              DW$T$33 .dwtag  DW_TAG_structure_type
    4446                      .dwattr DW$T$33, DW_AT_name("tag_allsensorstruct")
    4447                      .dwattr DW$T$33, DW_AT_byte_size(0x2d)
    4448              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4449                      .dwattr DW$300, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
    4450                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4451                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4452              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4453                      .dwattr DW$301, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
    4454                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4455                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4456              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4457                      .dwattr DW$302, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
    4458                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4459                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4460              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   96

    4461                      .dwattr DW$303, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
    4462                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4463                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4464              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4465                      .dwattr DW$304, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
    4466                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4467                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4468              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4469                      .dwattr DW$305, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
    4470                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4471                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4472              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4473                      .dwattr DW$306, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
    4474                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4475                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4476              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4477                      .dwattr DW$307, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
    4478                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4479                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4480              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4481                      .dwattr DW$308, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
    4482                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4483                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4484              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4485                      .dwattr DW$309, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    4486                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4487                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4488              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4489                      .dwattr DW$310, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    4490                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4491                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4492              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4493                      .dwattr DW$311, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
    4494                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4495                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4496              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4497                      .dwattr DW$312, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
    4498                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4499                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4500              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4501                      .dwattr DW$313, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    4502                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4503                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4504              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4505                      .dwattr DW$314, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    4506                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4507                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4508              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4509                      .dwattr DW$315, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    4510                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4511                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4512              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    4513                      .dwattr DW$316, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    4514                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4515                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   97

    4516              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4517                      .dwattr DW$317, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
    4518                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4519                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4520              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4521                      .dwattr DW$318, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
    4522                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4523                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4524              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4525                      .dwattr DW$319, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
    4526                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4527                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4528              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4529                      .dwattr DW$320, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
    4530                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4531                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4532              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    4533                      .dwattr DW$321, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
    4534                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4535                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4536              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4537                      .dwattr DW$322, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
    4538                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4539                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4540              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4541                      .dwattr DW$323, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
    4542                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4543                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4544              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4545                      .dwattr DW$324, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
    4546                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4547                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4548              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4549                      .dwattr DW$325, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
    4550                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4551                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4552              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4553                      .dwattr DW$326, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
    4554                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4555                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4556              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4557                      .dwattr DW$327, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
    4558                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4559                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4560              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4561                      .dwattr DW$328, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
    4562                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4563                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4564              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    4565                      .dwattr DW$329, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
    4566                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4567                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4568              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4569                      .dwattr DW$330, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow"
    4570                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   98

    4571                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4572              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4573                      .dwattr DW$331, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHig
    4574                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4575                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4576                      .dwendtag DW$T$33
    4577              
    4578              
    4579              DW$T$40 .dwtag  DW_TAG_structure_type
    4580                      .dwattr DW$T$40, DW_AT_name("tag_configstruct")
    4581                      .dwattr DW$T$40, DW_AT_byte_size(0x18)
    4582              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    4583                      .dwattr DW$332, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
    4584                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4585                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4586              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    4587                      .dwattr DW$333, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
    4588                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4589                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4590              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    4591                      .dwattr DW$334, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
    4592                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4593                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4594              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    4595                      .dwattr DW$335, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
    4596                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4597                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4598              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4599                      .dwattr DW$336, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
    4600                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4601                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4602              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4603                      .dwattr DW$337, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    4604                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4605                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4606                      .dwendtag DW$T$40
    4607              
    4608              
    4609              DW$T$44 .dwtag  DW_TAG_structure_type
    4610                      .dwattr DW$T$44, DW_AT_name("tag_loopcheckstruct")
    4611                      .dwattr DW$T$44, DW_AT_byte_size(0x10)
    4612              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    4613                      .dwattr DW$338, DW_AT_name("min"), DW_AT_symbol_name("_min")
    4614                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4615                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4616              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    4617                      .dwattr DW$339, DW_AT_name("max"), DW_AT_symbol_name("_max")
    4618                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4619                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4620              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    4621                      .dwattr DW$340, DW_AT_name("last"), DW_AT_symbol_name("_last")
    4622                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4623                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4624              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    4625                      .dwattr DW$341, DW_AT_name("value"), DW_AT_symbol_name("_value")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE   99

    4626                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4627                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4628                      .dwendtag DW$T$44
    4629              
    4630              
    4631              DW$T$46 .dwtag  DW_TAG_structure_type
    4632                      .dwattr DW$T$46, DW_AT_name("tag_offsetstruct")
    4633                      .dwattr DW$T$46, DW_AT_byte_size(0x1c)
    4634              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    4635                      .dwattr DW$342, DW_AT_name("val"), DW_AT_symbol_name("_val")
    4636                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4637                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4638                      .dwendtag DW$T$46
    4639              
    4640              
    4641              DW$T$48 .dwtag  DW_TAG_structure_type
    4642                      .dwattr DW$T$48, DW_AT_name("tag_functionstruct")
    4643                      .dwattr DW$T$48, DW_AT_byte_size(0x08)
    4644              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    4645                      .dwattr DW$343, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    4646                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4647                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4648                      .dwendtag DW$T$48
    4649              
    4650              
    4651              DW$T$51 .dwtag  DW_TAG_structure_type
    4652                      .dwattr DW$T$51, DW_AT_name("tag_speedcompstruct")
    4653                      .dwattr DW$T$51, DW_AT_byte_size(0x19)
    4654              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4655                      .dwattr DW$344, DW_AT_name("stageflag"), DW_AT_symbol_name("_stageflag")
    4656                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4657                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4658              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4659                      .dwattr DW$345, DW_AT_name("status"), DW_AT_symbol_name("_status")
    4660                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4661                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4662              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    4663                      .dwattr DW$346, DW_AT_name("speedbands"), DW_AT_symbol_name("_speedbands")
    4664                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4665                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4666              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4667                      .dwattr DW$347, DW_AT_name("slopecoeff"), DW_AT_symbol_name("_slopecoeff")
    4668                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4669                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4670              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4671                      .dwattr DW$348, DW_AT_name("initialtimer"), DW_AT_symbol_name("_initialtimer")
    4672                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4673                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4674              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4675                      .dwattr DW$349, DW_AT_name("learningmodetimer"), DW_AT_symbol_name("_learningmodetimer")
    4676                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4677                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4678              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4679                      .dwattr DW$350, DW_AT_name("intervaltimer"), DW_AT_symbol_name("_intervaltimer")
    4680                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  100

    4681                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4682              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4683                      .dwattr DW$351, DW_AT_name("numsamples"), DW_AT_symbol_name("_numsamples")
    4684                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4685                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4686              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4687                      .dwattr DW$352, DW_AT_name("learningleft"), DW_AT_symbol_name("_learningleft")
    4688                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4689                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4690              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4691                      .dwattr DW$353, DW_AT_name("intervalleft"), DW_AT_symbol_name("_intervalleft")
    4692                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4693                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4694              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4695                      .dwattr DW$354, DW_AT_name("manappliedminsamples"), DW_AT_symbol_name("_manappliedminsamples")
    4696                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4697                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4698              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4699                      .dwattr DW$355, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    4700                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4701                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4702              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4703                      .dwattr DW$356, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    4704                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4705                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4706              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4707                      .dwattr DW$357, DW_AT_name("unused3"), DW_AT_symbol_name("_unused3")
    4708                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4709                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4710              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4711                      .dwattr DW$358, DW_AT_name("unused4"), DW_AT_symbol_name("_unused4")
    4712                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4713                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4714              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4715                      .dwattr DW$359, DW_AT_name("unused5"), DW_AT_symbol_name("_unused5")
    4716                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4717                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4718              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4719                      .dwattr DW$360, DW_AT_name("unused6"), DW_AT_symbol_name("_unused6")
    4720                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4721                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4722              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4723                      .dwattr DW$361, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    4724                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4725                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4726              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4727                      .dwattr DW$362, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    4728                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4729                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4730              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4731                      .dwattr DW$363, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    4732                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4733                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4734                      .dwendtag DW$T$51
    4735              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  101

    4736              
    4737              DW$T$53 .dwtag  DW_TAG_structure_type
    4738                      .dwattr DW$T$53, DW_AT_name("tag_sdsettingsstruct")
    4739                      .dwattr DW$T$53, DW_AT_byte_size(0x04)
    4740              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4741                      .dwattr DW$364, DW_AT_name("present"), DW_AT_symbol_name("_present")
    4742                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4743                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4744              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4745                      .dwattr DW$365, DW_AT_name("sequence"), DW_AT_symbol_name("_sequence")
    4746                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4747                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4748              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4749                      .dwattr DW$366, DW_AT_name("errornum"), DW_AT_symbol_name("_errornum")
    4750                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4751                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4752              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    4753                      .dwattr DW$367, DW_AT_name("readstatus"), DW_AT_symbol_name("_readstatus")
    4754                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4755                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4756                      .dwendtag DW$T$53
    4757              
    4758              
    4759              DW$T$54 .dwtag  DW_TAG_structure_type
    4760                      .dwattr DW$T$54, DW_AT_name("tag_alarmsstruct")
    4761                      .dwattr DW$T$54, DW_AT_byte_size(0x01)
    4762              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4763                      .dwattr DW$368, DW_AT_name("slavefailure"), DW_AT_symbol_name("_slavefailure")
    4764                      .dwattr DW$368, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4765                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4766                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4767              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4768                      .dwattr DW$369, DW_AT_name("slavefailurelatched"), DW_AT_symbol_name("_slavefailurelatched")
    4769                      .dwattr DW$369, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4770                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4771                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4772              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4773                      .dwattr DW$370, DW_AT_name("framfailure"), DW_AT_symbol_name("_framfailure")
    4774                      .dwattr DW$370, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4775                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4776                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4777              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4778                      .dwattr DW$371, DW_AT_name("framfailurelatched"), DW_AT_symbol_name("_framfailurelatched")
    4779                      .dwattr DW$371, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4780                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4781                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4782              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4783                      .dwattr DW$372, DW_AT_name("pccommsfailure"), DW_AT_symbol_name("_pccommsfailure")
    4784                      .dwattr DW$372, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4785                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4786                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4787              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4788                      .dwattr DW$373, DW_AT_name("pccommsfailurelatched"), DW_AT_symbol_name("_pccommsfailurelatched")
    4789                      .dwattr DW$373, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4790                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  102

    4791                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4792              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4793                      .dwattr DW$374, DW_AT_name("unused7"), DW_AT_symbol_name("_unused7")
    4794                      .dwattr DW$374, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4795                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4796                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4797              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4798                      .dwattr DW$375, DW_AT_name("unused8"), DW_AT_symbol_name("_unused8")
    4799                      .dwattr DW$375, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4800                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4801                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4802              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4803                      .dwattr DW$376, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    4804                      .dwattr DW$376, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4805                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4806                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4807              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4808                      .dwattr DW$377, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    4809                      .dwattr DW$377, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4810                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4811                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4812              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4813                      .dwattr DW$378, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    4814                      .dwattr DW$378, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4815                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4816                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4817              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4818                      .dwattr DW$379, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    4819                      .dwattr DW$379, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4820                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4821                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4822              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4823                      .dwattr DW$380, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    4824                      .dwattr DW$380, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4825                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4826                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4827              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4828                      .dwattr DW$381, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    4829                      .dwattr DW$381, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4830                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4831                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4832              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4833                      .dwattr DW$382, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    4834                      .dwattr DW$382, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4835                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4836                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4837              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4838                      .dwattr DW$383, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    4839                      .dwattr DW$383, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4840                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4841                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4842                      .dwendtag DW$T$54
    4843              
    4844              
    4845              DW$T$55 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  103

    4846                      .dwattr DW$T$55, DW_AT_name("tag_wiosettingsstruct")
    4847                      .dwattr DW$T$55, DW_AT_byte_size(0x0a)
    4848              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4849                      .dwattr DW$384, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    4850                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4851                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4852              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4853                      .dwattr DW$385, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
    4854                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4855                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4856              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4857                      .dwattr DW$386, DW_AT_name("alarmupperlevel"), DW_AT_symbol_name("_alarmupperlevel")
    4858                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4859                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4860              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4861                      .dwattr DW$387, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    4862                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4863                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4864              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4865                      .dwattr DW$388, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
    4866                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4867                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4868              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4869                      .dwattr DW$389, DW_AT_name("scaledmin"), DW_AT_symbol_name("_scaledmin")
    4870                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4871                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4872              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4873                      .dwattr DW$390, DW_AT_name("scaledmax"), DW_AT_symbol_name("_scaledmax")
    4874                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4875                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4876              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4877                      .dwattr DW$391, DW_AT_name("units"), DW_AT_symbol_name("_units")
    4878                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4879                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4880              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4881                      .dwattr DW$392, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    4882                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4883                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4884              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4885                      .dwattr DW$393, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    4886                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4887                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4888                      .dwendtag DW$T$55
    4889              
    4890              
    4891              DW$T$57 .dwtag  DW_TAG_structure_type
    4892                      .dwattr DW$T$57, DW_AT_name("tag_rtcbatstruct")
    4893                      .dwattr DW$T$57, DW_AT_byte_size(0x02)
    4894              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4895                      .dwattr DW$394, DW_AT_name("mV"), DW_AT_symbol_name("_mV")
    4896                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4897                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4898              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    4899                      .dwattr DW$395, DW_AT_name("alarms"), DW_AT_symbol_name("_alarms")
    4900                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  104

    4901                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4902                      .dwendtag DW$T$57
    4903              
    4904              
    4905              DW$T$59 .dwtag  DW_TAG_structure_type
    4906                      .dwattr DW$T$59, DW_AT_byte_size(0x13)
    4907              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4908                      .dwattr DW$396, DW_AT_name("count"), DW_AT_symbol_name("_count")
    4909                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4910                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4911              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4912                      .dwattr DW$397, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
    4913                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4914                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4915              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4916                      .dwattr DW$398, DW_AT_name("previouscount"), DW_AT_symbol_name("_previouscount")
    4917                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4918                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4919              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4920                      .dwattr DW$399, DW_AT_name("sampleperiod"), DW_AT_symbol_name("_sampleperiod")
    4921                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4922                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4923              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4924                      .dwattr DW$400, DW_AT_name("period"), DW_AT_symbol_name("_period")
    4925                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4926                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4927              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    4928                      .dwattr DW$401, DW_AT_name("stable"), DW_AT_symbol_name("_stable")
    4929                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4930                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4931                      .dwendtag DW$T$59
    4932              
    4933              DW$402  .dwtag  DW_TAG_far_type
    4934                      .dwattr DW$402, DW_AT_type(*DW$T$156)
    4935              DW$T$157        .dwtag  DW_TAG_const_type
    4936                      .dwattr DW$T$157, DW_AT_type(*DW$402)
    4937              DW$T$64 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    4938                      .dwattr DW$T$64, DW_AT_encoding(DW_ATE_signed_char)
    4939                      .dwattr DW$T$64, DW_AT_byte_size(0x01)
    4940              DW$403  .dwtag  DW_TAG_far_type
    4941                      .dwattr DW$403, DW_AT_type(*DW$T$64)
    4942              DW$T$80 .dwtag  DW_TAG_const_type
    4943                      .dwattr DW$T$80, DW_AT_type(*DW$403)
    4944              
    4945              DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    4946                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    4947                      .dwattr DW$T$45, DW_AT_byte_size(0x1c)
    4948              DW$404  .dwtag  DW_TAG_subrange_type
    4949                      .dwattr DW$404, DW_AT_upper_bound(0x1b)
    4950                      .dwendtag DW$T$45
    4951              
    4952              
    4953              DW$T$58 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    4954                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    4955                      .dwattr DW$T$58, DW_AT_byte_size(0x0e)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  105

    4956              DW$405  .dwtag  DW_TAG_subrange_type
    4957                      .dwattr DW$405, DW_AT_upper_bound(0x0d)
    4958                      .dwendtag DW$T$58
    4959              
    4960              
    4961              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    4962                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    4963                      .dwattr DW$T$29, DW_AT_byte_size(0x0e)
    4964              DW$406  .dwtag  DW_TAG_subrange_type
    4965                      .dwattr DW$406, DW_AT_upper_bound(0x0d)
    4966                      .dwendtag DW$T$29
    4967              
    4968              
    4969              DW$T$50 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    4970                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    4971                      .dwattr DW$T$50, DW_AT_byte_size(0x06)
    4972              DW$407  .dwtag  DW_TAG_subrange_type
    4973                      .dwattr DW$407, DW_AT_upper_bound(0x02)
    4974              DW$408  .dwtag  DW_TAG_subrange_type
    4975                      .dwattr DW$408, DW_AT_upper_bound(0x01)
    4976                      .dwendtag DW$T$50
    4977              
    4978              
    4979              DW$T$21 .dwtag  DW_TAG_structure_type
    4980                      .dwattr DW$T$21, DW_AT_name("taggpdport")
    4981                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    4982              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    4983                      .dwattr DW$409, DW_AT_name("selunion"), DW_AT_symbol_name("_selunion")
    4984                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4985                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4986                      .dwendtag DW$T$21
    4987              
    4988              
    4989              DW$T$22 .dwtag  DW_TAG_structure_type
    4990                      .dwattr DW$T$22, DW_AT_byte_size(0x02)
    4991              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4992                      .dwattr DW$410, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    4993                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4994                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4995              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4996                      .dwattr DW$411, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    4997                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4998                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4999                      .dwendtag DW$T$22
    5000              
    5001              
    5002              DW$T$25 .dwtag  DW_TAG_structure_type
    5003                      .dwattr DW$T$25, DW_AT_byte_size(0x03)
    5004              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5005                      .dwattr DW$412, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
    5006                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5007                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5008              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5009                      .dwattr DW$413, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
    5010                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  106

    5011                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5012              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5013                      .dwattr DW$414, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
    5014                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5015                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5016                      .dwendtag DW$T$25
    5017              
    5018              
    5019              DW$T$26 .dwtag  DW_TAG_structure_type
    5020                      .dwattr DW$T$26, DW_AT_byte_size(0x03)
    5021              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5022                      .dwattr DW$415, DW_AT_name("yrmnth"), DW_AT_symbol_name("_yrmnth")
    5023                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5024                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5025              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5026                      .dwattr DW$416, DW_AT_name("datehrs"), DW_AT_symbol_name("_datehrs")
    5027                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5028                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5029              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5030                      .dwattr DW$417, DW_AT_name("minssecs"), DW_AT_symbol_name("_minssecs")
    5031                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5032                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5033                      .dwendtag DW$T$26
    5034              
    5035              
    5036              DW$T$30 .dwtag  DW_TAG_structure_type
    5037                      .dwattr DW$T$30, DW_AT_name("tag_timers")
    5038                      .dwattr DW$T$30, DW_AT_byte_size(0x4c)
    5039              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5040                      .dwattr DW$418, DW_AT_name("update"), DW_AT_symbol_name("_update")
    5041                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5042                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5043              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5044                      .dwattr DW$419, DW_AT_name("general"), DW_AT_symbol_name("_general")
    5045                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5046                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5047              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5048                      .dwattr DW$420, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    5049                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5050                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5051              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5052                      .dwattr DW$421, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    5053                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5054                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5055              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5056                      .dwattr DW$422, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    5057                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5058                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5059              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5060                      .dwattr DW$423, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    5061                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5062                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5063              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5064                      .dwattr DW$424, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    5065                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  107

    5066                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5067              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5068                      .dwattr DW$425, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    5069                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5070                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5071              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5072                      .dwattr DW$426, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    5073                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5074                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5075              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5076                      .dwattr DW$427, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    5077                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5078                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5079              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    5080                      .dwattr DW$428, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    5081                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5082                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5083              DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    5084                      .dwattr DW$429, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    5085                      .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5086                      .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5087              DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5088                      .dwattr DW$430, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    5089                      .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5090                      .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5091              DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5092                      .dwattr DW$431, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    5093                      .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5094                      .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5095              DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5096                      .dwattr DW$432, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    5097                      .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5098                      .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5099              DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5100                      .dwattr DW$433, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    5101                      .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5102                      .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5103              DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5104                      .dwattr DW$434, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    5105                      .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5106                      .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5107              DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5108                      .dwattr DW$435, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    5109                      .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    5110                      .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5111              DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5112                      .dwattr DW$436, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    5113                      .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5114                      .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5115              DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5116                      .dwattr DW$437, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    5117                      .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    5118                      .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5119              DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5120                      .dwattr DW$438, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  108

    5121                      .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5122                      .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5123              DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5124                      .dwattr DW$439, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    5125                      .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5126                      .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5127              DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5128                      .dwattr DW$440, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    5129                      .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    5130                      .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5131              DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5132                      .dwattr DW$441, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    5133                      .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5134                      .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5135              DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5136                      .dwattr DW$442, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    5137                      .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    5138                      .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5139              DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5140                      .dwattr DW$443, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    5141                      .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5142                      .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5143              DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5144                      .dwattr DW$444, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
    5145                      .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    5146                      .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5147              DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5148                      .dwattr DW$445, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    5149                      .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5150                      .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5151              DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5152                      .dwattr DW$446, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    5153                      .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    5154                      .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5155              DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5156                      .dwattr DW$447, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    5157                      .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5158                      .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5159              DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5160                      .dwattr DW$448, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    5161                      .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5162                      .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5163              DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5164                      .dwattr DW$449, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    5165                      .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    5166                      .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    5167              DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5168                      .dwattr DW$450, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    5169                      .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    5170                      .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5171              DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5172                      .dwattr DW$451, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    5173                      .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5174                      .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5175              DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  109

    5176                      .dwattr DW$452, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    5177                      .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    5178                      .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5179              DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5180                      .dwattr DW$453, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    5181                      .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5182                      .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5183              DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5184                      .dwattr DW$454, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    5185                      .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    5186                      .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5187              DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5188                      .dwattr DW$455, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    5189                      .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5190                      .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5191              DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5192                      .dwattr DW$456, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    5193                      .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    5194                      .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5195              DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5196                      .dwattr DW$457, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    5197                      .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5198                      .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5199              DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5200                      .dwattr DW$458, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    5201                      .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    5202                      .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5203              DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5204                      .dwattr DW$459, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    5205                      .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5206                      .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5207              DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    5208                      .dwattr DW$460, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    5209                      .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    5210                      .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5211                      .dwendtag DW$T$30
    5212              
    5213              
    5214              DW$T$31 .dwtag  DW_TAG_structure_type
    5215                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    5216              DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5217                      .dwattr DW$461, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
    5218                      .dwattr DW$461, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5219                      .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5220                      .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5221              DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5222                      .dwattr DW$462, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
    5223                      .dwattr DW$462, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5224                      .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5225                      .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5226              DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5227                      .dwattr DW$463, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
    5228                      .dwattr DW$463, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5229                      .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5230                      .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:34 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
utils.asm                                                            PAGE  110

    5231              DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5232                      .dwattr DW$464, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
    5233                      .dwattr DW$464, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5234                      .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5235                      .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5236              DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5237                      .dwattr DW$465, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    5238                      .dwattr DW$465, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    5239                      .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5240                      .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5241                      .dwendtag DW$T$31
    5242              
    5243              
    5244              DW$T$32 .dwtag  DW_TAG_structure_type
    5245                      .dwattr DW$T$32, DW_AT_byte_size(0x01)
    5246              DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5247                      .dwattr DW$466, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
    5248                      .dwattr DW$466, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5249                      .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5250                      .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5251              DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5252                      .dwattr DW$467, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
    5253                      .dwattr DW$467, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    5254                      .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5255                      .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5256                      .dwendtag DW$T$32
    5257              
    5258              
    5259              DW$T$34 .dwtag  DW_TAG_structure_type
    5260                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
    5261              DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
