TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 20 14:13:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
version.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Tue Sep 20 14:13:26 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("version.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$3)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

     304              DW$17   .dwtag  DW_TAG_loop
     305                      .dwattr DW$17, DW_AT_name("D:\DEV\Amot\BearingWear\XTSW_V6_20\version.asm:L5:1:1474377206")
     306                      .dwattr DW$17, DW_AT_begin_file("version.c")
     307                      .dwattr DW$17, DW_AT_begin_line(0x5c)
     308                      .dwattr DW$17, DW_AT_end_line(0x5f)
     309              DW$18   .dwtag  DW_TAG_loop_range
     310                      .dwattr DW$18, DW_AT_low_pc(DW$L$_DummyFunction$2$B)
     311                      .dwattr DW$18, DW_AT_high_pc(DW$L$_DummyFunction$2$E)
     312                      .dwendtag DW$17
     313              
     314                      .dwattr DW$16, DW_AT_end_file("version.c")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 20 14:13:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
version.asm                                                          PAGE    7

     315                      .dwattr DW$16, DW_AT_end_line(0x60)
     316                      .dwattr DW$16, DW_AT_end_column(0x01)
     317                      .dwendtag DW$16
     318              
     319              ;***************************************************************
     320              ;* UNDEFINED EXTERNAL REFERENCES                               *
     321              ;***************************************************************
     322                      .global _memset
     323                      .global _SaveFirmwareStruct
     324                      .global _allsensors
     325                      .global _slave485mb
     326              
     327              ;***************************************************************
     328              ;* TYPE INFORMATION                                            *
     329              ;***************************************************************
     330              DW$T$3  .dwtag  DW_TAG_pointer_type
     331                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     332              
     333              DW$T$27 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
     334                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     335              DW$19   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     336              DW$20   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     337              DW$21   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
     338                      .dwendtag DW$T$27
     339              
     340              
     341              DW$T$29 .dwtag  DW_TAG_subroutine_type
     342                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     343              
     344              DW$T$31 .dwtag  DW_TAG_subroutine_type
     345                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     346              DW$22   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     347                      .dwendtag DW$T$31
     348              
     349              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     350                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     351                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     352              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     353                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     354                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     355              
     356              DW$T$37 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
     357                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     358              DW$23   .dwtag  DW_TAG_far_type
     359                      .dwattr DW$23, DW_AT_type(*DW$T$11)
     360              DW$T$39 .dwtag  DW_TAG_const_type
     361                      .dwattr DW$T$39, DW_AT_type(*DW$23)
     362              DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
     363                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     364              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("allsensorstruct"), DW_AT_type(*DW$T$22)
     365                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     366              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("slavecmdstruct"), DW_AT_type(*DW$T$24)
     367                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     368              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("firmwarestruct"), DW_AT_type(*DW$T$25)
     369                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 20 14:13:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
version.asm                                                          PAGE    8

     370              
     371              DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$44)
     372                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
     373                      .dwattr DW$T$45, DW_AT_byte_size(0x34)
     374              DW$24   .dwtag  DW_TAG_subrange_type
     375                      .dwattr DW$24, DW_AT_upper_bound(0x33)
     376                      .dwendtag DW$T$45
     377              
     378              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     379                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     380                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
     381              
     382              DW$T$22 .dwtag  DW_TAG_structure_type
     383                      .dwattr DW$T$22, DW_AT_name("tag_allsensorstruct")
     384                      .dwattr DW$T$22, DW_AT_byte_size(0x2d)
     385              DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     386                      .dwattr DW$25, DW_AT_name("numsensors"), DW_AT_symbol_name("_numsensors")
     387                      .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     388                      .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     389              DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     390                      .dwattr DW$26, DW_AT_name("numsensorsspu1"), DW_AT_symbol_name("_numsensorsspu1")
     391                      .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     392                      .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     393              DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     394                      .dwattr DW$27, DW_AT_name("numsensorsspu2"), DW_AT_symbol_name("_numsensorsspu2")
     395                      .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     396                      .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     397              DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     398                      .dwattr DW$28, DW_AT_name("nominalspeed"), DW_AT_symbol_name("_nominalspeed")
     399                      .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     400                      .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     401              DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     402                      .dwattr DW$29, DW_AT_name("rpmmin"), DW_AT_symbol_name("_rpmmin")
     403                      .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     404                      .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     405              DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     406                      .dwattr DW$30, DW_AT_name("rpmmax"), DW_AT_symbol_name("_rpmmax")
     407                      .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     408                      .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     409              DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     410                      .dwattr DW$31, DW_AT_name("reflash"), DW_AT_symbol_name("_reflash")
     411                      .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     412                      .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     413              DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     414                      .dwattr DW$32, DW_AT_name("sensorhysteresis"), DW_AT_symbol_name("_sensorhysteresis")
     415                      .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     416                      .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     417              DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     418                      .dwattr DW$33, DW_AT_name("cylinderhysteresis"), DW_AT_symbol_name("_cylinderhysteresis")
     419                      .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     420                      .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     421              DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     422                      .dwattr DW$34, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
     423                      .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     424                      .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 20 14:13:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
version.asm                                                          PAGE    9

     425              DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     426                      .dwattr DW$35, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
     427                      .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     428                      .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     429              DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     430                      .dwattr DW$36, DW_AT_name("slowdowndevcallevel"), DW_AT_symbol_name("_slowdowndevcallevel")
     431                      .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     432                      .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     433              DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     434                      .dwattr DW$37, DW_AT_name("alarmdevcallevel"), DW_AT_symbol_name("_alarmdevcallevel")
     435                      .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     436                      .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     437              DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     438                      .dwattr DW$38, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
     439                      .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     440                      .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     441              DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     442                      .dwattr DW$39, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
     443                      .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     444                      .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     445              DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     446                      .dwattr DW$40, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
     447                      .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     448                      .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     449              DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     450                      .dwattr DW$41, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
     451                      .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     452                      .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     453              DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     454                      .dwattr DW$42, DW_AT_name("slowdownack"), DW_AT_symbol_name("_slowdownack")
     455                      .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     456                      .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     457              DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     458                      .dwattr DW$43, DW_AT_name("alarmack"), DW_AT_symbol_name("_alarmack")
     459                      .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     460                      .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     461              DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     462                      .dwattr DW$44, DW_AT_name("maxmintimer"), DW_AT_symbol_name("_maxmintimer")
     463                      .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     464                      .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     465              DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     466                      .dwattr DW$45, DW_AT_name("enginedircal"), DW_AT_symbol_name("_enginedircal")
     467                      .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     468                      .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     469              DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     470                      .dwattr DW$46, DW_AT_name("dirorder"), DW_AT_symbol_name("_dirorder")
     471                      .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     472                      .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     473              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     474                      .dwattr DW$47, DW_AT_name("prewarningtimer"), DW_AT_symbol_name("_prewarningtimer")
     475                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     476                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     477              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     478                      .dwattr DW$48, DW_AT_name("prewarninglevel"), DW_AT_symbol_name("_prewarninglevel")
     479                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 20 14:13:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
version.asm                                                          PAGE   10

     480                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     481              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     482                      .dwattr DW$49, DW_AT_name("rpmlimit"), DW_AT_symbol_name("_rpmlimit")
     483                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
     484                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     485              DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     486                      .dwattr DW$50, DW_AT_name("dsss"), DW_AT_symbol_name("_dsss")
     487                      .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     488                      .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     489              DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     490                      .dwattr DW$51, DW_AT_name("slowdowncallevel"), DW_AT_symbol_name("_slowdowncallevel")
     491                      .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
     492                      .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     493              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     494                      .dwattr DW$52, DW_AT_name("alarmcallevel"), DW_AT_symbol_name("_alarmcallevel")
     495                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     496                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     497              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     498                      .dwattr DW$53, DW_AT_name("cylinderalarmcallevel"), DW_AT_symbol_name("_cylinderalarmcallevel")
     499                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     500                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     501              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     502                      .dwattr DW$54, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
     503                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     504                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     505              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     506                      .dwattr DW$55, DW_AT_name("iBarredVibrationSpeedLow"), DW_AT_symbol_name("_iBarredVibrationSpeedLow")
     507                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
     508                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     509              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     510                      .dwattr DW$56, DW_AT_name("iBarredVibrationSpeedHigh"), DW_AT_symbol_name("_iBarredVibrationSpeedHigh
     511                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     512                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     513                      .dwendtag DW$T$22
     514              
     515              
     516              DW$T$24 .dwtag  DW_TAG_structure_type
     517                      .dwattr DW$T$24, DW_AT_name("tag_slavecmdstruct")
     518                      .dwattr DW$T$24, DW_AT_byte_size(0x48)
     519              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     520                      .dwattr DW$57, DW_AT_name("SlaveAddr"), DW_AT_symbol_name("_SlaveAddr")
     521                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     522                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     523              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     524                      .dwattr DW$58, DW_AT_name("Func"), DW_AT_symbol_name("_Func")
     525                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     526                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     527              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     528                      .dwattr DW$59, DW_AT_name("StartAdd"), DW_AT_symbol_name("_StartAdd")
     529                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     530                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     531              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     532                      .dwattr DW$60, DW_AT_name("NoReg"), DW_AT_symbol_name("_NoReg")
     533                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     534                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 20 14:13:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
version.asm                                                          PAGE   11

     535              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     536                      .dwattr DW$61, DW_AT_name("ByteCount"), DW_AT_symbol_name("_ByteCount")
     537                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     538                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     539              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     540                      .dwattr DW$62, DW_AT_name("Data"), DW_AT_symbol_name("_Data")
     541                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     542                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     543              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     544                      .dwattr DW$63, DW_AT_name("txmode"), DW_AT_symbol_name("_txmode")
     545                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
     546                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     547              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     548                      .dwattr DW$64, DW_AT_name("slavelost"), DW_AT_symbol_name("_slavelost")
     549                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     550                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     551              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     552                      .dwattr DW$65, DW_AT_name("slavenotready"), DW_AT_symbol_name("_slavenotready")
     553                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
     554                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     555                      .dwendtag DW$T$24
     556              
     557              
     558              DW$T$25 .dwtag  DW_TAG_structure_type
     559                      .dwattr DW$T$25, DW_AT_name("tag_firmwarestruct")
     560                      .dwattr DW$T$25, DW_AT_byte_size(0x02)
     561              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     562                      .dwattr DW$66, DW_AT_name("spu2"), DW_AT_symbol_name("_spu2")
     563                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     564                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     565              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     566                      .dwattr DW$67, DW_AT_name("spu1"), DW_AT_symbol_name("_spu1")
     567                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     568                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     569                      .dwendtag DW$T$25
     570              
     571              DW$68   .dwtag  DW_TAG_far_type
     572                      .dwattr DW$68, DW_AT_type(*DW$T$43)
     573              DW$T$44 .dwtag  DW_TAG_const_type
     574                      .dwattr DW$T$44, DW_AT_type(*DW$68)
     575              
     576              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     577                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     578                      .dwattr DW$T$21, DW_AT_byte_size(0x0e)
     579              DW$69   .dwtag  DW_TAG_subrange_type
     580                      .dwattr DW$69, DW_AT_upper_bound(0x0d)
     581                      .dwendtag DW$T$21
     582              
     583              
     584              DW$T$23 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     585                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     586                      .dwattr DW$T$23, DW_AT_byte_size(0x40)
     587              DW$70   .dwtag  DW_TAG_subrange_type
     588                      .dwattr DW$70, DW_AT_upper_bound(0x3f)
     589                      .dwendtag DW$T$23
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 20 14:13:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
version.asm                                                          PAGE   12

     590              
     591              
     592              DW$T$19 .dwtag  DW_TAG_structure_type
     593                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
     594              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     595                      .dwattr DW$71, DW_AT_name("newval"), DW_AT_symbol_name("_newval")
     596                      .dwattr DW$71, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     597                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     598                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     599              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     600                      .dwattr DW$72, DW_AT_name("calmode"), DW_AT_symbol_name("_calmode")
     601                      .dwattr DW$72, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     602                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     603                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     604              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     605                      .dwattr DW$73, DW_AT_name("startcal"), DW_AT_symbol_name("_startcal")
     606                      .dwattr DW$73, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     607                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     608                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     609              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     610                      .dwattr DW$74, DW_AT_name("newvalspu2"), DW_AT_symbol_name("_newvalspu2")
     611                      .dwattr DW$74, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     612                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     613                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     614              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     615                      .dwattr DW$75, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
     616                      .dwattr DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     617                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     618                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     619                      .dwendtag DW$T$19
     620              
     621              
     622              DW$T$20 .dwtag  DW_TAG_structure_type
     623                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
     624              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     625                      .dwattr DW$76, DW_AT_name("slowdowncntrl"), DW_AT_symbol_name("_slowdowncntrl")
     626                      .dwattr DW$76, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     627                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     628                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     629              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     630                      .dwattr DW$77, DW_AT_name("unused"), DW_AT_symbol_name("_unused")
     631                      .dwattr DW$77, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     632                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     634                      .dwendtag DW$T$20
     635              
     636              DW$T$43 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     637                      .dwattr DW$T$43, DW_AT_encoding(DW_ATE_signed_char)
     638                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
     639              
     640                      .dwattr DW$16, DW_AT_external(0x01)
     641                      .dwattr DW$15, DW_AT_external(0x01)
     642                      .dwattr DW$14, DW_AT_external(0x01)
     643                      .dwattr DW$14, DW_AT_type(*DW$T$11)
     644                      .dwattr DW$12, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 20 14:13:26 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
version.asm                                                          PAGE   13

     645                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     646              
     647              ;***************************************************************
     648              ;* DWARF REGISTER MAP                                          *
     649              ;***************************************************************
     650              
     651              DW$78   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     652                      .dwattr DW$78, DW_AT_location[DW_OP_reg0]
     653              DW$79   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
     654                      .dwattr DW$79, DW_AT_location[DW_OP_reg1]
     655              DW$80   .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
     656                      .dwattr DW$80, DW_AT_location[DW_OP_reg2]
     657              DW$81   .dwtag  DW_TAG_assign_register, DW_AT_name("PH")
     658                      .dwattr DW$81, DW_AT_location[DW_OP_reg3]
     659              DW$82   .dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
     660                      .dwattr DW$82, DW_AT_location[DW_OP_reg4]
     661              DW$83   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
     662                      .dwattr DW$83, DW_AT_location[DW_OP_reg5]
     663              DW$84   .dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
     664                      .dwattr DW$84, DW_AT_location[DW_OP_reg6]
     665              DW$85   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
     666                      .dwattr DW$85, DW_AT_location[DW_OP_reg7]
     667              DW$86   .dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
     668                      .dwattr DW$86, DW_AT_location[DW_OP_reg8]
     669              DW$87   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
     670                      .dwattr DW$87, DW_AT_location[DW_OP_reg9]
     671              DW$88   .dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
     672                      .dwattr DW$88, DW_AT_location[DW_OP_reg10]
     673              DW$89   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
     674                      .dwattr DW$89, DW_AT_location[DW_OP_reg11]
     675              DW$90   .dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
     676                      .dwattr DW$90, DW_AT_location[DW_OP_reg12]
     677              DW$91   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
     678                      .dwattr DW$91, DW_AT_location[DW_OP_reg13]
     679              DW$92   .dwtag  DW_TAG_assign_register, DW_AT_name("AR5")
     680                      .dwattr DW$92, DW_AT_location[DW_OP_reg14]
     681              DW$93   .dwtag  DW_TAG_assign_register, DW_AT_name("XAR5")
     682                      .dwattr DW$93, DW_AT_location[DW_OP_reg15]
     683              DW$94   .dwtag  DW_TAG_assign_register, DW_AT_name("AR6")
