TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:35 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("wio.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$3)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

    1466              DW$T$3  .dwtag  DW_TAG_pointer_type
    1467                      .dwattr DW$T$3, DW_AT_address_class(0x16)
    1468              
    1469              DW$T$40 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
    1470                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   34

    1471              DW$49   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1472              DW$50   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1473              DW$51   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
    1474                      .dwendtag DW$T$40
    1475              
    1476              
    1477              DW$T$43 .dwtag  DW_TAG_subroutine_type
    1478                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    1479              DW$52   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1480              DW$53   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1481              DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
    1482              DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1483                      .dwendtag DW$T$43
    1484              
    1485              
    1486              DW$T$45 .dwtag  DW_TAG_subroutine_type
    1487                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    1488              DW$56   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1489                      .dwendtag DW$T$45
    1490              
    1491              
    1492              DW$T$47 .dwtag  DW_TAG_subroutine_type
    1493                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    1494              
    1495              DW$T$49 .dwtag  DW_TAG_subroutine_type
    1496                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
    1497              DW$57   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1498                      .dwendtag DW$T$49
    1499              
    1500              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1501                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1502                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    1503              
    1504              DW$T$51 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1505                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
    1506              DW$58   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1507                      .dwendtag DW$T$51
    1508              
    1509              
    1510              DW$T$53 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1511                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
    1512              
    1513              DW$T$55 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1514                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
    1515              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1516                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1517                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1518              DW$T$42 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
    1519                      .dwattr DW$T$42, DW_AT_address_class(0x16)
    1520              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
    1521                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    1522              DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("wiosettingsstruct"), DW_AT_type(*DW$T$19)
    1523                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1524              
    1525              DW$T$65 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$64)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   35

    1526                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1527              DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("waterinoilstruct"), DW_AT_type(*DW$T$22)
    1528                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1529              
    1530              DW$T$70 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$69)
    1531                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    1532              DW$T$73 .dwtag  DW_TAG_typedef, DW_AT_name("settingsstruct"), DW_AT_type(*DW$T$24)
    1533                      .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    1534              DW$59   .dwtag  DW_TAG_far_type
    1535                      .dwattr DW$59, DW_AT_type(*DW$T$74)
    1536              DW$T$75 .dwtag  DW_TAG_volatile_type
    1537                      .dwattr DW$T$75, DW_AT_type(*DW$59)
    1538              DW$60   .dwtag  DW_TAG_far_type
    1539                      .dwattr DW$60, DW_AT_type(*DW$T$77)
    1540              DW$T$78 .dwtag  DW_TAG_volatile_type
    1541                      .dwattr DW$T$78, DW_AT_type(*DW$60)
    1542              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1543                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1544                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1545              
    1546              DW$T$19 .dwtag  DW_TAG_structure_type
    1547                      .dwattr DW$T$19, DW_AT_name("tag_wiosettingsstruct")
    1548                      .dwattr DW$T$19, DW_AT_byte_size(0x0a)
    1549              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1550                      .dwattr DW$61, DW_AT_name("enabled"), DW_AT_symbol_name("_enabled")
    1551                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1553              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1554                      .dwattr DW$62, DW_AT_name("alarmmask"), DW_AT_symbol_name("_alarmmask")
    1555                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1556                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1557              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1558                      .dwattr DW$63, DW_AT_name("alarmupperlevel"), DW_AT_symbol_name("_alarmupperlevel")
    1559                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1560                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1561              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1562                      .dwattr DW$64, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    1563                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1564                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1565              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1566                      .dwattr DW$65, DW_AT_name("hysteresis"), DW_AT_symbol_name("_hysteresis")
    1567                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1568                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1569              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1570                      .dwattr DW$66, DW_AT_name("scaledmin"), DW_AT_symbol_name("_scaledmin")
    1571                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1572                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1573              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1574                      .dwattr DW$67, DW_AT_name("scaledmax"), DW_AT_symbol_name("_scaledmax")
    1575                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1576                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1577              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1578                      .dwattr DW$68, DW_AT_name("units"), DW_AT_symbol_name("_units")
    1579                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1580                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   36

    1581              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1582                      .dwattr DW$69, DW_AT_name("unused1"), DW_AT_symbol_name("_unused1")
    1583                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1584                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1585              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1586                      .dwattr DW$70, DW_AT_name("unused2"), DW_AT_symbol_name("_unused2")
    1587                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1588                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1589                      .dwendtag DW$T$19
    1590              
    1591              DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    1592                      .dwattr DW$T$64, DW_AT_address_class(0x16)
    1593              
    1594              DW$T$22 .dwtag  DW_TAG_structure_type
    1595                      .dwattr DW$T$22, DW_AT_name("tag_waterinoilstruct")
    1596                      .dwattr DW$T$22, DW_AT_byte_size(0x0c)
    1597              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1598                      .dwattr DW$71, DW_AT_name("netadd"), DW_AT_symbol_name("_netadd")
    1599                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1601              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1602                      .dwattr DW$72, DW_AT_name("temperature"), DW_AT_symbol_name("_temperature")
    1603                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1604                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1605              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1606                      .dwattr DW$73, DW_AT_name("activity"), DW_AT_symbol_name("_activity")
    1607                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1608                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1609              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1610                      .dwattr DW$74, DW_AT_name("content"), DW_AT_symbol_name("_content")
    1611                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1612                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1613              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1614                      .dwattr DW$75, DW_AT_name("temperature_int"), DW_AT_symbol_name("_temperature_int")
    1615                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1616                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1617              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1618                      .dwattr DW$76, DW_AT_name("activity_int"), DW_AT_symbol_name("_activity_int")
    1619                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1620                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1621              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1622                      .dwattr DW$77, DW_AT_name("content_int"), DW_AT_symbol_name("_content_int")
    1623                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1624                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1625              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1626                      .dwattr DW$78, DW_AT_name("wioalarms"), DW_AT_symbol_name("_wioalarms")
    1627                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1628                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1629                      .dwendtag DW$T$22
    1630              
    1631              DW$T$69 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$68)
    1632                      .dwattr DW$T$69, DW_AT_address_class(0x16)
    1633              
    1634              DW$T$24 .dwtag  DW_TAG_structure_type
    1635                      .dwattr DW$T$24, DW_AT_name("tag_settingsstruct")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   37

    1636                      .dwattr DW$T$24, DW_AT_byte_size(0x24)
    1637              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1638                      .dwattr DW$79, DW_AT_name("watchdog"), DW_AT_symbol_name("_watchdog")
    1639                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1641              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1642                      .dwattr DW$80, DW_AT_name("ledflashflag"), DW_AT_symbol_name("_ledflashflag")
    1643                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1644                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1645              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1646                      .dwattr DW$81, DW_AT_name("updatesafe"), DW_AT_symbol_name("_updatesafe")
    1647                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1648                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1649              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1650                      .dwattr DW$82, DW_AT_name("tableconfigtype"), DW_AT_symbol_name("_tableconfigtype")
    1651                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1652                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1653              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1654                      .dwattr DW$83, DW_AT_name("caltableconfigtype"), DW_AT_symbol_name("_caltableconfigtype")
    1655                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1656                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1657              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1658                      .dwattr DW$84, DW_AT_name("eventmsgid"), DW_AT_symbol_name("_eventmsgid")
    1659                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1660                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1661              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1662                      .dwattr DW$85, DW_AT_name("configoperationcomplete"), DW_AT_symbol_name("_configoperationcomplete")
    1663                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1664                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1665              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1666                      .dwattr DW$86, DW_AT_name("sdcarderr"), DW_AT_symbol_name("_sdcarderr")
    1667                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1668                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1669              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1670                      .dwattr DW$87, DW_AT_name("sderase"), DW_AT_symbol_name("_sderase")
    1671                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1672                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1673              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1674                      .dwattr DW$88, DW_AT_name("sdreinit"), DW_AT_symbol_name("_sdreinit")
    1675                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1676                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1677              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1678                      .dwattr DW$89, DW_AT_name("sdcardupdate"), DW_AT_symbol_name("_sdcardupdate")
    1679                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1680                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1681              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1682                      .dwattr DW$90, DW_AT_name("cardreadflag"), DW_AT_symbol_name("_cardreadflag")
    1683                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1684                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1685              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1686                      .dwattr DW$91, DW_AT_name("ignore"), DW_AT_symbol_name("_ignore")
    1687                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1688                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1689              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1690                      .dwattr DW$92, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   38

    1691                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1692                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1693              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1694                      .dwattr DW$93, DW_AT_name("spiinuse"), DW_AT_symbol_name("_spiinuse")
    1695                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1696                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1697              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1698                      .dwattr DW$94, DW_AT_name("dcpeakhold"), DW_AT_symbol_name("_dcpeakhold")
    1699                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1700                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1701              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1702                      .dwattr DW$95, DW_AT_name("dcpause"), DW_AT_symbol_name("_dcpause")
    1703                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1704                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1705              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1706                      .dwattr DW$96, DW_AT_name("mastermode"), DW_AT_symbol_name("_mastermode")
    1707                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1708                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1709              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1710                      .dwattr DW$97, DW_AT_name("updatescaling"), DW_AT_symbol_name("_updatescaling")
    1711                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1712                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1713              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1714                      .dwattr DW$98, DW_AT_name("forwardasternflag"), DW_AT_symbol_name("_forwardasternflag")
    1715                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1716                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1717              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1718                      .dwattr DW$99, DW_AT_name("initprogress"), DW_AT_symbol_name("_initprogress")
    1719                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1720                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1721              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1722                      .dwattr DW$100, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    1723                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1724                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1725              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1726                      .dwattr DW$101, DW_AT_name("slowdowncounter"), DW_AT_symbol_name("_slowdowncounter")
    1727                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1728                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1729              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1730                      .dwattr DW$102, DW_AT_name("slowdowncondition"), DW_AT_symbol_name("_slowdowncondition")
    1731                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1732                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1733              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1734                      .dwattr DW$103, DW_AT_name("slowdownlevel"), DW_AT_symbol_name("_slowdownlevel")
    1735                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1736                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1737              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1738                      .dwattr DW$104, DW_AT_name("alarmlevel"), DW_AT_symbol_name("_alarmlevel")
    1739                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1740                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1741              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1742                      .dwattr DW$105, DW_AT_name("slowdowndevlevel"), DW_AT_symbol_name("_slowdowndevlevel")
    1743                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1744                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1745              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   39

    1746                      .dwattr DW$106, DW_AT_name("alarmdevlevel"), DW_AT_symbol_name("_alarmdevlevel")
    1747                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1748                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1749              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1750                      .dwattr DW$107, DW_AT_name("cylinderalarmlevel"), DW_AT_symbol_name("_cylinderalarmlevel")
    1751                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1752                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1753              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1754                      .dwattr DW$108, DW_AT_name("temperaturealarm"), DW_AT_symbol_name("_temperaturealarm")
    1755                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1756                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1757              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1758                      .dwattr DW$109, DW_AT_name("temperatureslowdown"), DW_AT_symbol_name("_temperatureslowdown")
    1759                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1760                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1761              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1762                      .dwattr DW$110, DW_AT_name("anadebug"), DW_AT_symbol_name("_anadebug")
    1763                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1764                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1765              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1766                      .dwattr DW$111, DW_AT_name("serialdebug"), DW_AT_symbol_name("_serialdebug")
    1767                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1768                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1769              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1770                      .dwattr DW$112, DW_AT_name("timerrunning"), DW_AT_symbol_name("_timerrunning")
    1771                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1772                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1773              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1774                      .dwattr DW$113, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    1775                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1776                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1777                      .dwendtag DW$T$24
    1778              
    1779              DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$26)
    1780                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    1781              DW$T$77 .dwtag  DW_TAG_typedef, DW_AT_name("inputstruct"), DW_AT_type(*DW$T$38)
    1782                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    1783              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    1784                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    1785                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    1786              DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("wioalarmstruct"), DW_AT_type(*DW$T$20)
    1787                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1788              
    1789              DW$T$23 .dwtag  DW_TAG_structure_type
    1790                      .dwattr DW$T$23, DW_AT_byte_size(0x02)
    1791              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1792                      .dwattr DW$114, DW_AT_name("enb"), DW_AT_symbol_name("_enb")
    1793                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1795              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1796                      .dwattr DW$115, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    1797                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1798                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1799                      .dwendtag DW$T$23
    1800              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   40

    1801              
    1802              DW$T$26 .dwtag  DW_TAG_structure_type
    1803                      .dwattr DW$T$26, DW_AT_name("tag_timers")
    1804                      .dwattr DW$T$26, DW_AT_byte_size(0x4c)
    1805              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1806                      .dwattr DW$116, DW_AT_name("update"), DW_AT_symbol_name("_update")
    1807                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1809              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1810                      .dwattr DW$117, DW_AT_name("general"), DW_AT_symbol_name("_general")
    1811                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1812                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1813              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1814                      .dwattr DW$118, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
    1815                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1816                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1817              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1818                      .dwattr DW$119, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
    1819                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1820                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1821              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1822                      .dwattr DW$120, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
    1823                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1824                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1825              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1826                      .dwattr DW$121, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
    1827                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1828                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1829              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1830                      .dwattr DW$122, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
    1831                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1832                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1833              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1834                      .dwattr DW$123, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
    1835                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1836                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1837              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1838                      .dwattr DW$124, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
    1839                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1840                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1841              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1842                      .dwattr DW$125, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
    1843                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1844                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1845              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1846                      .dwattr DW$126, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
    1847                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1848                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1849              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1850                      .dwattr DW$127, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
    1851                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1852                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1853              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1854                      .dwattr DW$128, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
    1855                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   41

    1856                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1857              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1858                      .dwattr DW$129, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
    1859                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1860                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1861              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1862                      .dwattr DW$130, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
    1863                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1864                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1865              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1866                      .dwattr DW$131, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    1867                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1868                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1869              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1870                      .dwattr DW$132, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
    1871                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1872                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1873              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1874                      .dwattr DW$133, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
    1875                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1876                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1877              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1878                      .dwattr DW$134, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
    1879                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1880                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1881              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1882                      .dwattr DW$135, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
    1883                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1884                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1885              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1886                      .dwattr DW$136, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
    1887                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1888                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1889              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1890                      .dwattr DW$137, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
    1891                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1892                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1893              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1894                      .dwattr DW$138, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
    1895                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1896                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1897              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1898                      .dwattr DW$139, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
    1899                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1900                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1901              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1902                      .dwattr DW$140, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
    1903                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    1904                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1905              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1906                      .dwattr DW$141, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
    1907                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1908                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1909              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1910                      .dwattr DW$142, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   42

    1911                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1912                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1913              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1914                      .dwattr DW$143, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
    1915                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1916                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1917              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1918                      .dwattr DW$144, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
    1919                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1920                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1921              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1922                      .dwattr DW$145, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
    1923                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1924                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1925              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1926                      .dwattr DW$146, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
    1927                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1928                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1929              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1930                      .dwattr DW$147, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
    1931                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1932                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1933              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1934                      .dwattr DW$148, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
    1935                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    1936                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1937              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1938                      .dwattr DW$149, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
    1939                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1940                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1941              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1942                      .dwattr DW$150, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
    1943                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1944                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1945              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1946                      .dwattr DW$151, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
    1947                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1948                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1949              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1950                      .dwattr DW$152, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
    1951                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1952                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1953              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1954                      .dwattr DW$153, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
    1955                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1956                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1957              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1958                      .dwattr DW$154, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
    1959                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1960                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1961              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1962                      .dwattr DW$155, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
    1963                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1964                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1965              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   43

    1966                      .dwattr DW$156, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
    1967                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1968                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1969              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1970                      .dwattr DW$157, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
    1971                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1972                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1973              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1974                      .dwattr DW$158, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
    1975                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1976                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1977                      .dwendtag DW$T$26
    1978              
    1979              
    1980              DW$T$38 .dwtag  DW_TAG_structure_type
    1981                      .dwattr DW$T$38, DW_AT_name("tag_inputstruct")
    1982                      .dwattr DW$T$38, DW_AT_byte_size(0xfe)
    1983              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1984                      .dwattr DW$159, DW_AT_name("flags"), DW_AT_symbol_name("_flags")
    1985                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1986                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1987              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1988                      .dwattr DW$160, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
    1989                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1990                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1991              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    1992                      .dwattr DW$161, DW_AT_name("rawresults"), DW_AT_symbol_name("_rawresults")
    1993                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1994                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1995              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    1996                      .dwattr DW$162, DW_AT_name("amps"), DW_AT_symbol_name("_amps")
    1997                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    1998                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1999              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2000                      .dwattr DW$163, DW_AT_name("prtchan"), DW_AT_symbol_name("_prtchan")
    2001                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2002                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2003              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2004                      .dwattr DW$164, DW_AT_name("analog"), DW_AT_symbol_name("_analog")
    2005                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2006                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2007                      .dwendtag DW$T$38
    2008              
    2009              
    2010              DW$T$25 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2011                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    2012                      .dwattr DW$T$25, DW_AT_byte_size(0x0e)
    2013              DW$165  .dwtag  DW_TAG_subrange_type
    2014                      .dwattr DW$165, DW_AT_upper_bound(0x0d)
    2015                      .dwendtag DW$T$25
    2016              
    2017              
    2018              DW$T$20 .dwtag  DW_TAG_structure_type
    2019                      .dwattr DW$T$20, DW_AT_name("tag_wioalarmstruct")
    2020                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   44

    2021              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2022                      .dwattr DW$166, DW_AT_name("alarmupper"), DW_AT_symbol_name("_alarmupper")
    2023                      .dwattr DW$166, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2024                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2025                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2026              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2027                      .dwattr DW$167, DW_AT_name("alarmupperlatched"), DW_AT_symbol_name("_alarmupperlatched")
    2028                      .dwattr DW$167, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2029                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2031              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2032                      .dwattr DW$168, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
    2033                      .dwattr DW$168, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2034                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2036              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2037                      .dwattr DW$169, DW_AT_name("alarmlatched"), DW_AT_symbol_name("_alarmlatched")
    2038                      .dwattr DW$169, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2039                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2040                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2041              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2042                      .dwattr DW$170, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    2043                      .dwattr DW$170, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2044                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2045                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2046              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2047                      .dwattr DW$171, DW_AT_name("commslatched"), DW_AT_symbol_name("_commslatched")
    2048                      .dwattr DW$171, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2049                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2051              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2052                      .dwattr DW$172, DW_AT_name("analoglow"), DW_AT_symbol_name("_analoglow")
    2053                      .dwattr DW$172, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2054                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2056              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2057                      .dwattr DW$173, DW_AT_name("analoghigh"), DW_AT_symbol_name("_analoghigh")
    2058                      .dwattr DW$173, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2059                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2061              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2062                      .dwattr DW$174, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    2063                      .dwattr DW$174, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2064                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2065                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2066              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2067                      .dwattr DW$175, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    2068                      .dwattr DW$175, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2069                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2070                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2071              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2072                      .dwattr DW$176, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    2073                      .dwattr DW$176, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2074                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2075                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   45

    2076              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2077                      .dwattr DW$177, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    2078                      .dwattr DW$177, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2079                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2080                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2081              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2082                      .dwattr DW$178, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    2083                      .dwattr DW$178, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2084                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2086              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2087                      .dwattr DW$179, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    2088                      .dwattr DW$179, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2089                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2091              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2092                      .dwattr DW$180, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    2093                      .dwattr DW$180, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2094                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2095                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2096              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2097                      .dwattr DW$181, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    2098                      .dwattr DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2099                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2101                      .dwendtag DW$T$20
    2102              
    2103              
    2104              DW$T$27 .dwtag  DW_TAG_structure_type
    2105                      .dwattr DW$T$27, DW_AT_byte_size(0x39)
    2106              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2107                      .dwattr DW$182, DW_AT_name("ready"), DW_AT_symbol_name("_ready")
    2108                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2110              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2111                      .dwattr DW$183, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2112                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2113                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2114              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2115                      .dwattr DW$184, DW_AT_name("newrpm"), DW_AT_symbol_name("_newrpm")
    2116                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2117                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2118              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2119                      .dwattr DW$185, DW_AT_name("rpmstart"), DW_AT_symbol_name("_rpmstart")
    2120                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2121                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2122              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2123                      .dwattr DW$186, DW_AT_name("startupcounter"), DW_AT_symbol_name("_startupcounter")
    2124                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2125                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2126                      .dwendtag DW$T$27
    2127              
    2128              
    2129              DW$T$30 .dwtag  DW_TAG_structure_type
    2130                      .dwattr DW$T$30, DW_AT_byte_size(0x2a)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   46

    2131              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    2132                      .dwattr DW$187, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2133                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2134                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2135              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2136                      .dwattr DW$188, DW_AT_name("peakoffset"), DW_AT_symbol_name("_peakoffset")
    2137                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2138                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2139                      .dwendtag DW$T$30
    2140              
    2141              
    2142              DW$T$32 .dwtag  DW_TAG_structure_type
    2143                      .dwattr DW$T$32, DW_AT_byte_size(0x62)
    2144              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2145                      .dwattr DW$189, DW_AT_name("current"), DW_AT_symbol_name("_current")
    2146                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2148              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2149                      .dwattr DW$190, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2150                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2151                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2152              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2153                      .dwattr DW$191, DW_AT_name("counterA"), DW_AT_symbol_name("_counterA")
    2154                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2155                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2156              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2157                      .dwattr DW$192, DW_AT_name("counterB"), DW_AT_symbol_name("_counterB")
    2158                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2159                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2160              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2161                      .dwattr DW$193, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
    2162                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2163                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2164                      .dwendtag DW$T$32
    2165              
    2166              
    2167              DW$T$34 .dwtag  DW_TAG_structure_type
    2168                      .dwattr DW$T$34, DW_AT_byte_size(0x1c)
    2169              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2170                      .dwattr DW$194, DW_AT_name("value"), DW_AT_symbol_name("_value")
    2171                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2173                      .dwendtag DW$T$34
    2174              
    2175              
    2176              DW$T$37 .dwtag  DW_TAG_structure_type
    2177                      .dwattr DW$T$37, DW_AT_byte_size(0x1a)
    2178              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2179                      .dwattr DW$195, DW_AT_name("value"), DW_AT_symbol_name("_value")
    2180                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2181                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2182              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2183                      .dwattr DW$196, DW_AT_name("chan"), DW_AT_symbol_name("_chan")
    2184                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2185                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   47

    2186              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2187                      .dwattr DW$197, DW_AT_name("scalefactor"), DW_AT_symbol_name("_scalefactor")
    2188                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2189                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2190                      .dwendtag DW$T$37
    2191              
    2192              
    2193              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    2194                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    2195                      .dwattr DW$T$29, DW_AT_byte_size(0x0e)
    2196              DW$198  .dwtag  DW_TAG_subrange_type
    2197                      .dwattr DW$198, DW_AT_upper_bound(0x0d)
    2198                      .dwendtag DW$T$29
    2199              
    2200              
    2201              DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    2202                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    2203                      .dwattr DW$T$35, DW_AT_byte_size(0x08)
    2204              DW$199  .dwtag  DW_TAG_subrange_type
    2205                      .dwattr DW$199, DW_AT_upper_bound(0x07)
    2206                      .dwendtag DW$T$35
    2207              
    2208              
    2209              DW$T$33 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    2210                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    2211                      .dwattr DW$T$33, DW_AT_byte_size(0x1c)
    2212              DW$200  .dwtag  DW_TAG_subrange_type
    2213                      .dwattr DW$200, DW_AT_upper_bound(0x1b)
    2214                      .dwendtag DW$T$33
    2215              
    2216              
    2217              DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$13)
    2218                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    2219                      .dwattr DW$T$31, DW_AT_byte_size(0x1c)
    2220              DW$201  .dwtag  DW_TAG_subrange_type
    2221                      .dwattr DW$201, DW_AT_upper_bound(0x0d)
    2222                      .dwendtag DW$T$31
    2223              
    2224              
    2225              DW$T$28 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    2226                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    2227                      .dwattr DW$T$28, DW_AT_byte_size(0x1c)
    2228              DW$202  .dwtag  DW_TAG_subrange_type
    2229                      .dwattr DW$202, DW_AT_upper_bound(0x0d)
    2230                      .dwendtag DW$T$28
    2231              
    2232              
    2233              DW$T$36 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    2234                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    2235                      .dwattr DW$T$36, DW_AT_byte_size(0x10)
    2236              DW$203  .dwtag  DW_TAG_subrange_type
    2237                      .dwattr DW$203, DW_AT_upper_bound(0x07)
    2238                      .dwendtag DW$T$36
    2239              
    2240              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:35 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wio.asm                                                              PAGE   48

    2241                      .dwattr DW$34, DW_AT_external(0x01)
    2242                      .dwattr DW$48, DW_AT_external(0x01)
    2243                      .dwattr DW$41, DW_AT_external(0x01)
    2244                      .dwattr DW$37, DW_AT_external(0x01)
    2245                      .dwattr DW$37, DW_AT_type(*DW$T$10)
    2246                      .dwattr DW$45, DW_AT_external(0x01)
    2247                      .dwattr DW$32, DW_AT_external(0x01)
    2248                      .dwattr DW$33, DW_AT_external(0x01)
    2249                      .dwattr DW$43, DW_AT_external(0x01)
    2250                      .dwattr DW$46, DW_AT_external(0x01)
    2251                      .dwattr DW$35, DW_AT_external(0x01)
    2252                      .dwattr DW$40, DW_AT_external(0x01)
