TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 18 12:16:36 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("wioprim.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("memset"), DW_AT_symbol_name("_memset")
      15                      .dwattr DW$1, DW_AT_type(*DW$T$3)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

     612              ;***************************************************************
     613              DW$T$3  .dwtag  DW_TAG_pointer_type
     614                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     615              
     616              DW$T$35 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
     617                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     618              DW$33   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     619              DW$34   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     620              DW$35   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
     621                      .dwendtag DW$T$35
     622              
     623              
     624              DW$T$38 .dwtag  DW_TAG_subroutine_type
     625                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     626              DW$36   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   14

     627              DW$37   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     628                      .dwendtag DW$T$38
     629              
     630              
     631              DW$T$40 .dwtag  DW_TAG_subroutine_type
     632                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     633              DW$38   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     634                      .dwendtag DW$T$40
     635              
     636              
     637              DW$T$42 .dwtag  DW_TAG_subroutine_type
     638                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     639              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     640                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     641                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     642              
     643              DW$T$44 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     644                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     645              
     646              DW$T$46 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     647                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     648              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     649                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     650                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     651              DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
     652                      .dwattr DW$T$37, DW_AT_address_class(0x16)
     653              
     654              DW$T$48 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
     655                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     656              DW$39   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
     657              DW$40   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     658                      .dwendtag DW$T$48
     659              
     660              
     661              DW$T$50 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     662                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
     663                      .dwattr DW$T$50, DW_AT_byte_size(0x0a)
     664              DW$41   .dwtag  DW_TAG_subrange_type
     665                      .dwattr DW$41, DW_AT_upper_bound(0x09)
     666                      .dwendtag DW$T$50
     667              
     668              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
     669                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     670              DW$T$53 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$52)
     671                      .dwattr DW$T$53, DW_AT_address_class(0x16)
     672              
     673              DW$T$54 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$53)
     674                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
     675              DW$42   .dwtag  DW_TAG_far_type
     676                      .dwattr DW$42, DW_AT_type(*DW$T$58)
     677              DW$T$59 .dwtag  DW_TAG_volatile_type
     678                      .dwattr DW$T$59, DW_AT_type(*DW$42)
     679              DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("configstruct"), DW_AT_type(*DW$T$30)
     680                      .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
     681              DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("uartreadC"), DW_AT_type(*DW$T$33)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   15

     682                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
     683              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     684                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     685                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
     686              DW$T$52 .dwtag  DW_TAG_typedef, DW_AT_name("waterinoilstruct"), DW_AT_type(*DW$T$21)
     687                      .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
     688              DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("timersstruct"), DW_AT_type(*DW$T$23)
     689                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
     690              
     691              DW$T$30 .dwtag  DW_TAG_structure_type
     692                      .dwattr DW$T$30, DW_AT_name("tag_configstruct")
     693                      .dwattr DW$T$30, DW_AT_byte_size(0x18)
     694              DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     695                      .dwattr DW$43, DW_AT_name("filter"), DW_AT_symbol_name("_filter")
     696                      .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     698              DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     699                      .dwattr DW$44, DW_AT_name("alarmenable"), DW_AT_symbol_name("_alarmenable")
     700                      .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     701                      .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     702              DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     703                      .dwattr DW$45, DW_AT_name("trendmax"), DW_AT_symbol_name("_trendmax")
     704                      .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     705                      .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     706              DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     707                      .dwattr DW$46, DW_AT_name("inputs"), DW_AT_symbol_name("_inputs")
     708                      .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     709                      .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     710              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     711                      .dwattr DW$47, DW_AT_name("sdsettings"), DW_AT_symbol_name("_sdsettings")
     712                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     713                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     714              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     715                      .dwattr DW$48, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
     716                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     717                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     718                      .dwendtag DW$T$30
     719              
     720              
     721              DW$T$33 .dwtag  DW_TAG_structure_type
     722                      .dwattr DW$T$33, DW_AT_name("tag_uartreadC")
     723                      .dwattr DW$T$33, DW_AT_byte_size(0x68)
     724              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     725                      .dwattr DW$49, DW_AT_name("receiveINTR"), DW_AT_symbol_name("_receiveINTR")
     726                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     728              DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     729                      .dwattr DW$50, DW_AT_name("currentcharcount"), DW_AT_symbol_name("_currentcharcount")
     730                      .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     731                      .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     732              DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     733                      .dwattr DW$51, DW_AT_name("previouscharcount"), DW_AT_symbol_name("_previouscharcount")
     734                      .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     735                      .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     736              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   16

     737                      .dwattr DW$52, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
     738                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     739                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     740              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
     741                      .dwattr DW$53, DW_AT_name("uartcharrx"), DW_AT_symbol_name("_uartcharrx")
     742                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x67]
     743                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     744                      .dwendtag DW$T$33
     745              
     746              
     747              DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
     748                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     749                      .dwattr DW$T$31, DW_AT_byte_size(0x64)
     750              DW$54   .dwtag  DW_TAG_subrange_type
     751                      .dwattr DW$54, DW_AT_upper_bound(0x63)
     752                      .dwendtag DW$T$31
     753              
     754              
     755              DW$T$21 .dwtag  DW_TAG_structure_type
     756                      .dwattr DW$T$21, DW_AT_name("tag_waterinoilstruct")
     757                      .dwattr DW$T$21, DW_AT_byte_size(0x0c)
     758              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     759                      .dwattr DW$55, DW_AT_name("netadd"), DW_AT_symbol_name("_netadd")
     760                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     762              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     763                      .dwattr DW$56, DW_AT_name("temperature"), DW_AT_symbol_name("_temperature")
     764                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     765                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     766              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     767                      .dwattr DW$57, DW_AT_name("activity"), DW_AT_symbol_name("_activity")
     768                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     769                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     770              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     771                      .dwattr DW$58, DW_AT_name("content"), DW_AT_symbol_name("_content")
     772                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     773                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     774              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     775                      .dwattr DW$59, DW_AT_name("temperature_int"), DW_AT_symbol_name("_temperature_int")
     776                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     777                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     778              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     779                      .dwattr DW$60, DW_AT_name("activity_int"), DW_AT_symbol_name("_activity_int")
     780                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     781                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     782              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     783                      .dwattr DW$61, DW_AT_name("content_int"), DW_AT_symbol_name("_content_int")
     784                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     785                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     786              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     787                      .dwattr DW$62, DW_AT_name("wioalarms"), DW_AT_symbol_name("_wioalarms")
     788                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     789                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     790                      .dwendtag DW$T$21
     791              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   17

     792              
     793              DW$T$23 .dwtag  DW_TAG_structure_type
     794                      .dwattr DW$T$23, DW_AT_name("tag_timers")
     795                      .dwattr DW$T$23, DW_AT_byte_size(0x4c)
     796              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     797                      .dwattr DW$63, DW_AT_name("update"), DW_AT_symbol_name("_update")
     798                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     800              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     801                      .dwattr DW$64, DW_AT_name("general"), DW_AT_symbol_name("_general")
     802                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     803                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     804              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     805                      .dwattr DW$65, DW_AT_name("rxcharTimeout"), DW_AT_symbol_name("_rxcharTimeout")
     806                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     807                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     808              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     809                      .dwattr DW$66, DW_AT_name("wiorxtimeout"), DW_AT_symbol_name("_wiorxtimeout")
     810                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     811                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     812              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     813                      .dwattr DW$67, DW_AT_name("wiomasterrxtimeout"), DW_AT_symbol_name("_wiomasterrxtimeout")
     814                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     815                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     816              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     817                      .dwattr DW$68, DW_AT_name("masterrxtimeout"), DW_AT_symbol_name("_masterrxtimeout")
     818                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     819                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     820              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     821                      .dwattr DW$69, DW_AT_name("slaverxtimeout"), DW_AT_symbol_name("_slaverxtimeout")
     822                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     823                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     824              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     825                      .dwattr DW$70, DW_AT_name("sectick"), DW_AT_symbol_name("_sectick")
     826                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     827                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     828              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     829                      .dwattr DW$71, DW_AT_name("ledflash"), DW_AT_symbol_name("_ledflash")
     830                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     831                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     832              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     833                      .dwattr DW$72, DW_AT_name("prtsettle"), DW_AT_symbol_name("_prtsettle")
     834                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     835                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     836              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     837                      .dwattr DW$73, DW_AT_name("chantimeout"), DW_AT_symbol_name("_chantimeout")
     838                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     839                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     840              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     841                      .dwattr DW$74, DW_AT_name("chanwait"), DW_AT_symbol_name("_chanwait")
     842                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     843                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     844              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     845                      .dwattr DW$75, DW_AT_name("pcrxtimeout"), DW_AT_symbol_name("_pcrxtimeout")
     846                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   18

     847                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     848              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     849                      .dwattr DW$76, DW_AT_name("pctxtimeout"), DW_AT_symbol_name("_pctxtimeout")
     850                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
     851                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     852              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     853                      .dwattr DW$77, DW_AT_name("spistatus"), DW_AT_symbol_name("_spistatus")
     854                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     855                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     856              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     857                      .dwattr DW$78, DW_AT_name("rpm"), DW_AT_symbol_name("_rpm")
     858                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     859                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     860              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     861                      .dwattr DW$79, DW_AT_name("slaverqst"), DW_AT_symbol_name("_slaverqst")
     862                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     863                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     864              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     865                      .dwattr DW$80, DW_AT_name("mastermodebutton"), DW_AT_symbol_name("_mastermodebutton")
     866                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
     867                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     868              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     869                      .dwattr DW$81, DW_AT_name("dcmode"), DW_AT_symbol_name("_dcmode")
     870                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     871                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     872              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
     873                      .dwattr DW$82, DW_AT_name("calibrate"), DW_AT_symbol_name("_calibrate")
     874                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     875                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     876              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
     877                      .dwattr DW$83, DW_AT_name("calibrate2"), DW_AT_symbol_name("_calibrate2")
     878                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     879                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     880              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     881                      .dwattr DW$84, DW_AT_name("alarmreflash"), DW_AT_symbol_name("_alarmreflash")
     882                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     883                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     884              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     885                      .dwattr DW$85, DW_AT_name("slowdownreflash"), DW_AT_symbol_name("_slowdownreflash")
     886                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
     887                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     888              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     889                      .dwattr DW$86, DW_AT_name("wiorqst"), DW_AT_symbol_name("_wiorqst")
     890                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     891                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     892              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     893                      .dwattr DW$87, DW_AT_name("rpmtimeout"), DW_AT_symbol_name("_rpmtimeout")
     894                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
     895                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     896              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     897                      .dwattr DW$88, DW_AT_name("analogoor"), DW_AT_symbol_name("_analogoor")
     898                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     899                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     900              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     901                      .dwattr DW$89, DW_AT_name("motioncal"), DW_AT_symbol_name("_motioncal")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   19

     902                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
     903                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
     904              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     905                      .dwattr DW$90, DW_AT_name("framcheck"), DW_AT_symbol_name("_framcheck")
     906                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     907                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
     908              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     909                      .dwattr DW$91, DW_AT_name("pcmodbus"), DW_AT_symbol_name("_pcmodbus")
     910                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
     911                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
     912              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     913                      .dwattr DW$92, DW_AT_name("statusreflash"), DW_AT_symbol_name("_statusreflash")
     914                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     915                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
     916              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
     917                      .dwattr DW$93, DW_AT_name("prewarn"), DW_AT_symbol_name("_prewarn")
     918                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     919                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
     920              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     921                      .dwattr DW$94, DW_AT_name("clocktofram"), DW_AT_symbol_name("_clocktofram")
     922                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     923                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
     924              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     925                      .dwattr DW$95, DW_AT_name("debugrapidfast"), DW_AT_symbol_name("_debugrapidfast")
     926                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
     927                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
     928              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     929                      .dwattr DW$96, DW_AT_name("debugupdate"), DW_AT_symbol_name("_debugupdate")
     930                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     931                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     932              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     933                      .dwattr DW$97, DW_AT_name("dircountdown"), DW_AT_symbol_name("_dircountdown")
     934                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
     935                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     936              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     937                      .dwattr DW$98, DW_AT_name("startup"), DW_AT_symbol_name("_startup")
     938                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     939                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     940              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     941                      .dwattr DW$99, DW_AT_name("analogsettle"), DW_AT_symbol_name("_analogsettle")
     942                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
     943                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     944              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     945                      .dwattr DW$100, DW_AT_name("reprogram"), DW_AT_symbol_name("_reprogram")
     946                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     947                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     948              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     949                      .dwattr DW$101, DW_AT_name("reprogramtimeout"), DW_AT_symbol_name("_reprogramtimeout")
     950                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
     951                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     952              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     953                      .dwattr DW$102, DW_AT_name("dcmodestayalive"), DW_AT_symbol_name("_dcmodestayalive")
     954                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     955                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     956              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   20

     957                      .dwattr DW$103, DW_AT_name("biteventchange"), DW_AT_symbol_name("_biteventchange")
     958                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
     959                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     960              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     961                      .dwattr DW$104, DW_AT_name("iSensorReplace"), DW_AT_symbol_name("_iSensorReplace")
     962                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     963                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     964              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
     965                      .dwattr DW$105, DW_AT_name("deltarpm15Delay"), DW_AT_symbol_name("_deltarpm15Delay")
     966                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     967                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
     968                      .dwendtag DW$T$23
     969              
     970              
     971              DW$T$24 .dwtag  DW_TAG_structure_type
     972                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
     973              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     974                      .dwattr DW$106, DW_AT_name("inputtap"), DW_AT_symbol_name("_inputtap")
     975                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     977                      .dwendtag DW$T$24
     978              
     979              
     980              DW$T$25 .dwtag  DW_TAG_structure_type
     981                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
     982              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     983                      .dwattr DW$107, DW_AT_name("bitmap"), DW_AT_symbol_name("_bitmap")
     984                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     986                      .dwendtag DW$T$25
     987              
     988              
     989              DW$T$26 .dwtag  DW_TAG_structure_type
     990                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
     991              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     992                      .dwattr DW$108, DW_AT_name("graphvalue"), DW_AT_symbol_name("_graphvalue")
     993                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     995                      .dwendtag DW$T$26
     996              
     997              
     998              DW$T$27 .dwtag  DW_TAG_structure_type
     999                      .dwattr DW$T$27, DW_AT_byte_size(0x03)
    1000              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1001                      .dwattr DW$109, DW_AT_name("chanlowthreshold"), DW_AT_symbol_name("_chanlowthreshold")
    1002                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1004              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1005                      .dwattr DW$110, DW_AT_name("chanhighthreshold"), DW_AT_symbol_name("_chanhighthreshold")
    1006                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1007                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1008              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1009                      .dwattr DW$111, DW_AT_name("sensorscalingfactor"), DW_AT_symbol_name("_sensorscalingfactor")
    1010                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1011                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   21

    1012                      .dwendtag DW$T$27
    1013              
    1014              
    1015              DW$T$28 .dwtag  DW_TAG_structure_type
    1016                      .dwattr DW$T$28, DW_AT_byte_size(0x02)
    1017              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1018                      .dwattr DW$112, DW_AT_name("shortlrate"), DW_AT_symbol_name("_shortlrate")
    1019                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1021              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1022                      .dwattr DW$113, DW_AT_name("longlrate"), DW_AT_symbol_name("_longlrate")
    1023                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1024                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1025                      .dwendtag DW$T$28
    1026              
    1027              
    1028              DW$T$29 .dwtag  DW_TAG_structure_type
    1029                      .dwattr DW$T$29, DW_AT_byte_size(0x10)
    1030              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1031                      .dwattr DW$114, DW_AT_name("wiorequest"), DW_AT_symbol_name("_wiorequest")
    1032                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1034              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1035                      .dwattr DW$115, DW_AT_name("wiocancelled"), DW_AT_symbol_name("_wiocancelled")
    1036                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1037                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1038              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1039                      .dwattr DW$116, DW_AT_name("wioreceived"), DW_AT_symbol_name("_wioreceived")
    1040                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1041                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1042              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1043                      .dwattr DW$117, DW_AT_name("slaverequest"), DW_AT_symbol_name("_slaverequest")
    1044                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1045                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1046              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1047                      .dwattr DW$118, DW_AT_name("slavereceived"), DW_AT_symbol_name("_slavereceived")
    1048                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1049                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1050              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1051                      .dwattr DW$119, DW_AT_name("slaveretry"), DW_AT_symbol_name("_slaveretry")
    1052                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1053                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1054              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1055                      .dwattr DW$120, DW_AT_name("pcrequest"), DW_AT_symbol_name("_pcrequest")
    1056                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1057                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1058              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1059                      .dwattr DW$121, DW_AT_name("pcreqtimeout"), DW_AT_symbol_name("_pcreqtimeout")
    1060                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1061                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1062                      .dwendtag DW$T$29
    1063              
    1064              DW$T$32 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1065                      .dwattr DW$T$32, DW_AT_encoding(DW_ATE_signed_char)
    1066                      .dwattr DW$T$32, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   22

    1067              
    1068              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$11)
    1069                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    1070                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    1071              DW$122  .dwtag  DW_TAG_subrange_type
    1072                      .dwattr DW$122, DW_AT_upper_bound(0x0d)
    1073                      .dwendtag DW$T$22
    1074              
    1075              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    1076                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    1077                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    1078              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("wioalarmstruct"), DW_AT_type(*DW$T$19)
    1079                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1080              
    1081              DW$T$19 .dwtag  DW_TAG_structure_type
    1082                      .dwattr DW$T$19, DW_AT_name("tag_wioalarmstruct")
    1083                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
    1084              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1085                      .dwattr DW$123, DW_AT_name("alarmupper"), DW_AT_symbol_name("_alarmupper")
    1086                      .dwattr DW$123, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1087                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1089              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1090                      .dwattr DW$124, DW_AT_name("alarmupperlatched"), DW_AT_symbol_name("_alarmupperlatched")
    1091                      .dwattr DW$124, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1092                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1094              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1095                      .dwattr DW$125, DW_AT_name("alarm"), DW_AT_symbol_name("_alarm")
    1096                      .dwattr DW$125, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1097                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1099              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1100                      .dwattr DW$126, DW_AT_name("alarmlatched"), DW_AT_symbol_name("_alarmlatched")
    1101                      .dwattr DW$126, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1102                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1104              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1105                      .dwattr DW$127, DW_AT_name("comms"), DW_AT_symbol_name("_comms")
    1106                      .dwattr DW$127, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1107                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1109              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1110                      .dwattr DW$128, DW_AT_name("commslatched"), DW_AT_symbol_name("_commslatched")
    1111                      .dwattr DW$128, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1112                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1114              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1115                      .dwattr DW$129, DW_AT_name("analoglow"), DW_AT_symbol_name("_analoglow")
    1116                      .dwattr DW$129, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1117                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1119              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1120                      .dwattr DW$130, DW_AT_name("analoghigh"), DW_AT_symbol_name("_analoghigh")
    1121                      .dwattr DW$130, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   23

    1122                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1124              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1125                      .dwattr DW$131, DW_AT_name("unused9"), DW_AT_symbol_name("_unused9")
    1126                      .dwattr DW$131, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1127                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1128                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1129              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1130                      .dwattr DW$132, DW_AT_name("unused10"), DW_AT_symbol_name("_unused10")
    1131                      .dwattr DW$132, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1132                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1134              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1135                      .dwattr DW$133, DW_AT_name("unused11"), DW_AT_symbol_name("_unused11")
    1136                      .dwattr DW$133, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1137                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1139              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1140                      .dwattr DW$134, DW_AT_name("unused12"), DW_AT_symbol_name("_unused12")
    1141                      .dwattr DW$134, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1142                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1144              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1145                      .dwattr DW$135, DW_AT_name("unused13"), DW_AT_symbol_name("_unused13")
    1146                      .dwattr DW$135, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1147                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1149              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1150                      .dwattr DW$136, DW_AT_name("unused14"), DW_AT_symbol_name("_unused14")
    1151                      .dwattr DW$136, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1152                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1154              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1155                      .dwattr DW$137, DW_AT_name("unused15"), DW_AT_symbol_name("_unused15")
    1156                      .dwattr DW$137, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1157                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1159              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1160                      .dwattr DW$138, DW_AT_name("unused16"), DW_AT_symbol_name("_unused16")
    1161                      .dwattr DW$138, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1162                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1164                      .dwendtag DW$T$19
    1165              
    1166              
    1167                      .dwattr DW$28, DW_AT_external(0x01)
    1168                      .dwattr DW$28, DW_AT_type(*DW$T$11)
    1169                      .dwattr DW$22, DW_AT_external(0x01)
    1170                      .dwattr DW$20, DW_AT_external(0x01)
    1171                      .dwattr DW$23, DW_AT_external(0x01)
    1172                      .dwattr DW$24, DW_AT_external(0x01)
    1173                      .dwattr DW$21, DW_AT_external(0x01)
    1174                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1175              
    1176              ;***************************************************************
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 18 12:16:36 2016

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
wioprim.asm                                                          PAGE   24

    1177              ;* DWARF REGISTER MAP                                          *
    1178              ;***************************************************************
    1179              
    1180              DW$139  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    1181                      .dwattr DW$139, DW_AT_location[DW_OP_reg0]
    1182              DW$140  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    1183                      .dwattr DW$140, DW_AT_location[DW_OP_reg1]
    1184              DW$141  .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
    1185                      .dwattr DW$141, DW_AT_location[DW_OP_reg2]
    1186              DW$142  .dwtag  DW_TAG_assign_register, DW_AT_name("PH")
    1187                      .dwattr DW$142, DW_AT_location[DW_OP_reg3]
    1188              DW$143  .dwtag  DW_TAG_assign_register, DW_AT_name("AR0")
    1189                      .dwattr DW$143, DW_AT_location[DW_OP_reg4]
    1190              DW$144  .dwtag  DW_TAG_assign_register, DW_AT_name("XAR0")
    1191                      .dwattr DW$144, DW_AT_location[DW_OP_reg5]
    1192              DW$145  .dwtag  DW_TAG_assign_register, DW_AT_name("AR1")
    1193                      .dwattr DW$145, DW_AT_location[DW_OP_reg6]
    1194              DW$146  .dwtag  DW_TAG_assign_register, DW_AT_name("XAR1")
    1195                      .dwattr DW$146, DW_AT_location[DW_OP_reg7]
    1196              DW$147  .dwtag  DW_TAG_assign_register, DW_AT_name("AR2")
    1197                      .dwattr DW$147, DW_AT_location[DW_OP_reg8]
    1198              DW$148  .dwtag  DW_TAG_assign_register, DW_AT_name("XAR2")
    1199                      .dwattr DW$148, DW_AT_location[DW_OP_reg9]
    1200              DW$149  .dwtag  DW_TAG_assign_register, DW_AT_name("AR3")
    1201                      .dwattr DW$149, DW_AT_location[DW_OP_reg10]
    1202              DW$150  .dwtag  DW_TAG_assign_register, DW_AT_name("XAR3")
    1203                      .dwattr DW$150, DW_AT_location[DW_OP_reg11]
    1204              DW$151  .dwtag  DW_TAG_assign_register, DW_AT_name("AR4")
    1205                      .dwattr DW$151, DW_AT_location[DW_OP_reg12]
    1206              DW$152  .dwtag  DW_TAG_assign_register, DW_AT_name("XAR4")
    1207                      .dwattr DW$152, DW_AT_location[DW_OP_reg13]
    1208              DW$153  .dwtag  DW_TAG_assign_register, DW_AT_name("AR5")
    1209                      .dwattr DW$153, DW_AT_location[DW_OP_reg14]
    1210              DW$154  .dwtag  DW_TAG_assign_register, DW_AT_name("XAR5")
    1211                      .dwattr DW$154, DW_AT_location[DW_OP_reg15]
    1212              DW$155  .dwtag  DW_TAG_assign_register, DW_AT_name("AR6")
    1213                      .dwattr DW$155, DW_AT_location[DW_OP_reg16]
